{
  "body": "# MoonDAO B2B: Final Report\n\n[MoonDAO Final Report Reference](https://docs.google.com/document/d/16F-_bcC0C4889YmuQl6WWChDKQObHhmfjasDna0wOmk/edit?usp=sharing)\n\n## Summary\n\n## **Goal:** The objective of the project team was to establish a foundational framework for MoonDAO’s Decentralized Sales Structure, allowing every MoonDAO member to contribute to the mission through DAO to Business or DAO to DAO engagements. The MoonDAO B2B project was active from the 6th of June to the 14th of August.Subsequently, the project team was dissolved by Astronaut Pablo Moncada, and as a result, no further B2B activities were pursued. The contributions of this project to MoonDAO’s standing in the DeSci ecosystem are significant, addressing and capitalizing on opportunities that might have been overlooked. Challenges encountered included a lack of clarity from MoonDAO senate members on the potential achievements of a MoU and the availability of resources to form competent project teams aligned with community interests. Legal uncertainties due to delays with the MiDAO entity were also a concern but have since been resolved.Lucasart, a key member of the project, departed during the coordination and documentation phases, followed by Mitchie, who exited after developing the inbound onboarding form. Manuel, along with Tyler and Luigi, managed the remaining B2B team responsibilities, focusing on outreach and refining the proposal process from initial contact to MoU creation.Currently, MoonDAO is not engaging in any external, coordinated outreach or partnership initiatives, foregoing potential opportunities to make a greater impact in the Web3 and Space industry.<!--StartFragment-->**Summary**The MoonDAO Partnerships framework (then renamed MoonDAO B2B) had an identity crisis at its inception. The proposal was written by Pablo to be an inbound framework for getting MoonDAO to approve partnership opportunities that came our way. However, there was another vision for how it should operate as a “decentralized sales structure” which was the initial goal. Subsequently the two visions were never aligned after many conversations about how to operate the project. After trying to intervene by some of the initial members of the team to fulfill the initial goals of the project with the inbound pipeline, the project continued on the direction of the initial proposal, Lucas dropped out. Followed by the departure of Mitchie as well after delivering on the inbound framework he agreed to during the proposal creation. Pablo shut down the project after two of the three initial members dropped out, and 4 MOUs had been submitted to the Senate after two months of the project.\n\n## Results\n\n1. **Objective:** Operate a MoonDAO Coalition Pipeline\n\n   1. **Key Result**: Convert at least 70% of high-quality brands that join the MoonDAO coalition through the in-bound pipeline with a perk, benefit, or that goes successfully to the proposal flow. \n\n      1. **Results**: The pipeline did not come online until the end of the project, despite the slowdowns, three partnerships were converted from the inbound pipeline and one more from the outbound pipeline.\n\n      2. **Learnings**: We should move faster and scrappier on the pipeline, the development on it was focused.\n\n      3. **Maintenance**: An operator should continue to monitor that for new requests. Mitchie is currently making sure people do not slip through the cracks.\n\n      4. **Team’s Self-Reported Score**: 0.5\n\n      5. **Team Contributions\\\n         Manuel**: Manuel demonstrated proactive engagement in identifying and reaching out to potential initiatives. He meticulously researched each entity to understand their core values, objectives, and needs, enabling him to tailor his approach effectively. He approached the following initiatives with precision and professionalism, created Opportunity reports, MOUs and presented the senate DeSci Labs and Bitbasel while working proposals with Q Network, Gitcoin, Alpha Persei, Foresight Institute, JOGL and many more. The steady success of MoonDAOs growth is laid out in the work that Manuel did in the DeSci ecosystem, qualifying interests with Future Folklore and engaging with BioDAOs like CryoDAO and ValleyDAO.:**Pablo**: I brought in Intuitive Machines, Future Folklore, and CryoDAO through the inbound MOU system, converting 100% of inbound leads that we identified as high-quality.****\n\n   2. **Key Result**: Have an Net Promoter Score (NPS) of 80 points or more\n\n      1. **Results**:  not applicable.\n\n      2. **Learnings**: N/A\n\n      3. **Maintenance**:\n\n      4. **Team’s Self-Reported Score**: 0\n\n      5. **Team Contributions****Lucas**:**Manuel**:**Pablo**:****3. **Key Result**: Responses within 24 hours for DMs, e-mails, forms or other contacts that don't demand specific qualification or due diligence\n\n   1. **Results**: Built leads pipeline coordinated responsibilities. Automated notifications have been added to Disord.\n\n   2. **Learnings**: Automation needed, communication, lead distribution.\n\n   3. **Maintenance**: ongoing\n\n   4. **Team’s Self-Reported Score**: 0.5\n\n   5. **Team Contributions** **Pablo**: Worked with Mitchie to provide feedback on the structure of the inbound pipeline and integrating it into Discord. Mitchie did most the work on this. I also handled DMs that I got and then had them create MOUs with a quick turn around.****\n\n4. **Key Result**: Make Due Diligence of possible coalition members within a week\n\n   1. **Results**: Leads has been screened and responded to.\n\n   2. **Learnings**: We needed a clear deal flow, review process, valuation, follow ups and proposal flow. We need better alignment at the beginning to make sure that there is a clear idea for the system for inbound requests and outbound activities.\n\n   3. **Maintenance**: ongoing\n\n   4. **Team’s Self-Reported Score**: 0.7\n\n   5. **Team Contributions****Luis:\\\nManuel**: We reviewed the inbound pipeline in our MoonDAO B2B meetings, discussed and coordinated how we want to handle it and approached interested leads.5. **Key Result**: Issue opportunity reports and Meeting reports, making them available to the community within a week\n\n   1. **Results**: [Potential Partnerships](https://drive.google.com/drive/folders/1c09oEe0QZXrwa0k9CMVXCv3w66AQg9lD?usp=sharing)/[ MoonDAO B2B Notes](https://docs.google.com/document/u/0/d/18MgDokAuiyNHXUqobFawZruuXjzLy-W7fve7NecaaiM/edit)\n\n   2. **Learnings**: Documentation is important. We had notes for Meetings and also the opportunity reports are available in our MoonDAO B2B Google Drive.\n\n   3. **Maintenance**:ongoing\n\n   4. **Team’s Self-Reported Score**: 1\n\n   5. **Team Contributions\\\n      Manuel**: I created opportunity reports for MoonDAO in the “Potential Partnerships” folder with a variety of potential partners like Filecoin, NewSpace2060, MetisDAO, Lifespan.io, PikNik, DCentral and Moon Metaverse. As part of my Rocketeer responsibility, I documented every B2B meeting in Notion and Pablo added the MoonDAO B2B Notes.****\n\n6. **Key Result**: Documentation for operating the partnerships pipeline\n\n   1. **Results**: [Strategy](https://drive.google.com/drive/folders/1BsxoPguP3zyOz9ncspVDLre1d1__ho_y?usp=sharing)/ [Processes](https://drive.google.com/drive/folders/1lmaNPCuSW-yDjiM6j7SA02MN6NsQi_6V?usp=sharing)/ [Sales Assets](https://drive.google.com/drive/folders/1mpqMNnbz4Zd987HtaArP3DGd3oFVtmu8?usp=sharing)\n\n   2. **Learnings**:  Results are in the MoonDAO B2B Folder where Email copy and Sales assets can be found. Putting strategy and processes on paper is important for team member context. We never had a dedicated partnerships operator that put together documentation for how future operators should create MOUs and reports for the community.\n\n   3. **Maintenance**: None\n\n   4. **Team’s Self-Reported Score**: 0.7\n\n   5. **Team Contributions\\\n      Manuel**: I created the Sales Assets templates to visualize and convince potential partners. Email copy was created by Lucas. Processes were defined at the beginning of the project. Lucas designed the inbound flow while I created the outbound process. Luis and I picked the top strategy templates to better outline and adjust MoonDAOs growth strategy. We sent it around and received feedback from Rocketeers.**Luis:** Created the MoonDAO B2B workshop guide: ([link figma](https://www.figma.com/file/ALq5fZ4OqM66ljXfc737EH/Moon-DAO-guide?type=whiteboard\\&node-id=0%3A1\\&t=vJdoWBAecsIGAt56-1)) and contributed with the outbound strategy. ****Participate in the strategic sessions of MoonDAO partners, contributing what is necessary in the topics and bottlenecks**Documentation (Marketing Materials)*** Testimonials\n\n* Sales Script\n\n* Sales Assets Overview\n\n* Pricing Sheets & Packages\n\n* Presentation\n\n* Infographics\n\n* Demo Video\n\n* Case Studies**B2B Copy (Sales Assets)**- MoU structure\n\n- Leadmagnets\n\n- Email Copy****7. **Key Result**: Creating a standard MOU that is flexible, ideally specifying automations through smart contracts especially in the case of working with other DAOs\n\n   1. **Results**: An example of the MOU template: [MOU: Intuitive Machines x MoonDAO](https://docs.google.com/document/d/15j3wBoz3Im6ppKpsg2DzM2Kj3CzDLpKHh1TpysjM3UE/edit) [MOU Template](https://docs.google.com/document/d/1nSIZR_C42F2r2620LpWNGtgVOLUcDdm5yM8Fskwci-g/edit?usp=sharing)\n\n   2. **Learnings**: A consistent MOU is helpful for the Senate. Sometimes they received totally different MOUs causing them to not understand what was being voted on, the structure should be consistent and everyone on the team should know how it works. An MOU standard has been implemented into our B2B activities formalizing a potential partnership between the company and MoonDAO. Value transfer and communication is important. Between the company and MoonDAO and within MoonDAO.\n\n   3. **Maintenance**:none\n\n   4. **Team’s Self-Reported Score**: 0.5\n\n   5. **Team Contributions\\\n      Manuel**: I created different MOUs and Opportunity reports asking for feedback how to continue, where to submit and who will be responsible for building real project teams out of these opportunities. Sadly, we did not gain critical mass of any project team and senate members often did not understand the purpose of an MOU up for vote. Luckily, we resolved this issue and now have a clear communication what happens with such proposals.**Pablo**: I used the MOU template for Intuitive Machines and then used it with CryoDAO and Future Folklore.****2. **Objective:** Operate an outbound partnerships strategy\n\n   1. **Key Result**: For outbound reaching out to at least 50 high-quality groups across universities, DAOs, companies, governments that have strategic importance to MoonDAO\n\n      1. **Results**: [MoonDAO CRM](https://docs.google.com/spreadsheets/u/0/d/1EVv31A0162Iq3NY56yIxFfL_lNqOPAGrYyS2bNoNzbU/edit)\n\n      2. **Learnings**: We coordinated outreach activities via Telegram and Email with prospects in the pipeline. Timely Follow Ups are important.\n\n      3. **Maintenance**:ongoing\n\n      4. **Team’s Self-Reported Score**: 0.8\n\n      5. **Team Contributions\\\n         Manuel**: We reached out to more than 200 people already in touch with different MoonDAO members. We coordinated the overall growth strategy for MoonDAO in a early version of a CRM in Google Sheets. In the long run a professional CRM is needed especially when it comes to building meaningful public-private partnerships. Tyler and Luis did an excellent job approaching warm leads and getting them into calls to figure out ways how to cooperate.****\n\n   2. **Key Result**: Putting together a presentation about MoonDAO to share with partners\n\n      1. **Results**: not finished\n\n      2. **Learnings**: We need access to visual MoonDAO assets.\n\n      3. **Maintenance**: ongoing\n\n      4. **Team’s Self-Reported Score**: 0\n\n      5. **Team Contributions**\n\n   3. **Key Result**: Creating emails and automations for responding to members\n\n      1. **Results**: [B2B Copy](https://drive.google.com/drive/folders/1uTd7OoSViXmaCF8zd9a-fnEi1YbeEAe5?usp=sharing)\n\n      2. **Learnings**: Automations are set up by Mitchie triggered by the onboarding form.\n\n      3. **Maintenance**: none\n\n      4. **Team’s Self-Reported Score**: 0.8\n\n      5. **Team Contributions****Lucas**: Lucas created some email copy and was in touch with some potential partners and one minister in Brazil.**Manu:** I just reviewed them because my main focus was on outbound activities and managing the project operations back then.\\\nMitchie: Setup GPT-4 to autogenerate response emails:[ DEMO HERE](https://www.loom.com/share/3d5ba2eed2444bb283cd553d39bb3e7d?sid=72c73b7c-d054-4b77-9ab5-f06b4b10bc87) \\*flashes at beginning are caused by recording software, not visible on actual homepage4. **Key Result**: Organizing AMAs with the communities that we bring into the coalition\n\n   1. **Results**: Work in progress.\n\n   2. **Learnings**: /\n\n   3. **Maintenance**: none\n\n   4. **Team’s Self-Reported Score**: 0 \n\n   5. **Team Contributions****Pablo:** Pablo did AMAs with Intuitive Machines and Future Folklore.**Tyler:** Tyler conducted an asynchronous AMA format discussion on AirChat to introduce MoonDAO to Naval and the AirChat community. 5. **Key Result**: Manage ongoing relationships with partners as they go through the coalition pipeline\n\n   1. **Results**: [Partnership Submission](https://docs.google.com/spreadsheets/d/1oYa-C_a_Cnc4JYDVAzuym9xBTTrfxQ0i86rCiBNzcKc/edit#gid=2143989970)\n\n   2. **Learnings**: Results are in the partnership submission form. Continuous effort to build relationships to key decision makers in other companies and DAOs. Followed up with 202 Warm Leads. Some responded. Manu got 22 of the qualified leads into interviews while coordinating 7 more with Luis and 6 more partnership meetings with Tyler. Luis was then committed to follow up with the inbound leads.**Tyler:**![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXc1FYi00QXzkzO70vCQrPrajDV_QIRhTsWq0YuJ41bE0g3N4v2OnDfrJCzFxxusOaIm8tSuk_2SU2KQulUfS7HLnAfj3uGMguGRw2_matvh3PElLWGefN2gpfAWgXVnTNl6cDGlOheSfQqOOOSMM1IZy-o?key=Mfr5WPyXLJOZIieOPGBj5Q)**Luis:**![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXdAM3umsy3zoJTuR3QlBxLXzZNjannp3WKKGEgx0i-_AT5glwJRZ2wbM8_k7QPigZyg4BSQLxe2qJrT3CIv8ZlZva1pXtsmaEc0X4cTkNZxUSh1olMFZfUnfx-cY9i5mF_zv_h7jF9JspXoK3IblpTgZbRP?key=Mfr5WPyXLJOZIieOPGBj5Q)3. **Maintenance**: ongoing\n\n4. **Team’s Self-Reported Score**: 1\n\n5. **Team Contributions\\\n   Manuel**: I coordinated the team, the outreach, the meetings and the closing part and the proposal flow before the project was shut down.**Luis:** Manage 7 ongoing relationships with partners* Campaigns (DeSci Onboarding + DeSci Labs + DeSci World + Molecule + Opportunities emerged - CryoDAO foundation + Future Folklore + Alpha Persei + Bitbasel)\n\n* Proposals in the pipeline**Follow Ups & meetings coordinated**- Telegram Groups & Email\n\n- Tyler\n\n  - Gitcoin\n\n  - RGN\n\n  - ReFiDAO\n\n  - TalentDAO\n\n  - ZoneAuthority\n\n  - Learnedchaos- Luis\n\n  - Flowcarbon\n\n  - Lobby3\n\n  - KlimaDAO\n\n  - Future Quest\n\n  - OpSci\n\n  - The Science Commons Initiative* Manu\n\n  - Q Network\n\n  - DeSci Labs\n\n  - Filecoin\n\n  - NewSpace2060 & Chinese Space Agency\n\n  - Gitcoin\n\n  - [SpaceDAO.AI](http://spacedao.ai)\n\n  - SpaceRoxDAO\n\n  - Alpha Persei\n\n  - Molecule\n\n  - Foresight Institute\n\n  - Bitbasel\n\n  - MetisDAO\n\n  - Copernic Space\n\n  - Uplift Aerospace\n\n  - JOGL\n\n  - [Lifespan.io](http://lifespan.io)\n\n  - PikNik\n\n  - Darien Advisors\n\n  - DCentral\n\n  - Moon Metaverse****3) **Objective:** Build the necessary infrastructure for the inbound and outbound Coalition pipeline\n\n   1. **Key Result**: Prominent button on our website and Discord for interested people\n\n      1. **Results**: Mitchie added the button for incoming partners on the MoonDAO website. We now have a partnership inquiry channel in our Discord.![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXd7_-e9cLQw_i4E9oUfiBSt8blUIqG1Wj0RpAozkt7TEfO1BEhUmQ3NpZDBJ0j-J4G8H8gjjg3hAOac_SLiASBiq7MnFWoq6G9HWkoP330G0C3FdXX69ieCYXdWpevl1DFtL11n0apnuxaF_WlJWhMANQoZ?key=Mfr5WPyXLJOZIieOPGBj5Q)2) **Learnings**: /\n\n3) **Maintenance**: none\n\n4) **Team’s Self-Reported Score**: 1\n\n5) **Team Contributions****Mitchie**: Developed AI-integrated google sheet which archives submissions and generates a review of the alignment potential, as well as generates and delivers custom response emails on demand;  [Partnership Submissions****](https://docs.google.com/spreadsheets/d/1oYa-C_a_Cnc4JYDVAzuym9xBTTrfxQ0i86rCiBNzcKc/edit#gid=0)**Pablo**: Gave feedback to Mitchie on the flow for the inbound pipeline, working closely with him and answering questions about how we should structure things.**Luis:** Responsibility for initial partner outreach upon form completion:****2. **Key Result**: Display area to prominently feature coalition members of MoonDAO on our website\n\n   1. **Results**:  Partnership section on the website is still work in progress because we still need to close some deals.\n\n   2. **Learnings**: /\n\n   3. **Maintenance**: none\n\n   4. **Team’s Self-Reported Score**: 0\n\n   5. **Team Contributions**\n\n3. **Key Result**: Area to see all the perks for vMOONEY holders from our coalition members\n\n   1. **Results**: We don’t have such information displayed on our website because we don’t have a network of partners that offer benefits to MoonDAO members beside Zero G and Lifeship yet.\n\n   2. **Learnings**: /\n\n   3. **Maintenance**: none\n\n   4. **Team’s Self-Reported Score**: 0\n\n   5. **Team Contributions**\n\n4. **Key Result**: Create a form for the initial interest, and another larger one for the final package that’s put together with the help of the partnerships lead, and identify key areas for automation with operations\n\n   1. **Results**: [Partnership Submission](https://docs.google.com/spreadsheets/d/1oYa-C_a_Cnc4JYDVAzuym9xBTTrfxQ0i86rCiBNzcKc/edit#gid=2143989970)\n\n   2. **Learnings**: We have one form where partners can submit their request.\n\n   3. **Maintenance**: none\n\n   4. **Team’s Self-Reported Score**: 0.7\n\n   5. **Team Contributions**\n\n5. **Key Result**: Create a basic memorandum of understanding with communities\n\n   1. **Results**: [MOU Template](https://docs.google.com/document/u/0/d/1nSIZR_C42F2r2620LpWNGtgVOLUcDdm5yM8Fskwci-g/edit)\n\n   2. **Learnings**: We established a standard for Opportunity reports and MoUs meaking it easier for future MoonDAO B2B members to formalize potential partnerships. Clear value proposition. Clarity around what does MoonDAO get, what can we offer.\n\n   3. **Maintenance**: none\n\n   4. **Team’s Self-Reported Score**: 1\n\n   5. **Team Contributions\\\n      Manuel**: Based on the feedback I received I created this basic MOU template.6) **Key Result**: Create an internal repository / CRM of contacts and information for each of the partners\n\n   1. **Results**: [Leadlists](https://drive.google.com/drive/folders/13nWGmy0OT_EuZldnA2SZPB75jJDsaTNN?usp=sharing) / [MoonDAO CRM Accounts](https://docs.google.com/spreadsheets/u/0/d/1EVv31A0162Iq3NY56yIxFfL_lNqOPAGrYyS2bNoNzbU/edit)\n\n   2. **Learnings**: We have a complete CRM with massive lists of in total 1162 companies, decision-makers and warm leads. We need a reliable CRM system to effectively coordinate outreach activities. Our choice before project shutdown was Hubspot. Lists include: DeSci companies, Crypto Exchanges, Cryptocurrencies, Intellectual Property Offices, Space companies, Future Studies Intititutes and Space Agencies.\n\n   3. **Maintenance**: ongoing\n\n   4. **Team’s Self-Reported Score**: 1**Team Contributions\\\nManuel**: I built all the Account lists of relevant companies and universities, brought my professional network into MoonDAO, attended several conferences with my own expenses representing MoonDAO, spreading the word about our work and following up with every single one of them. I prepared outreach campaigns to decision makers of these companies, prepared copy and multi channel approach via Twitter, Telegram, Linkedin and Email. Due to the unexpected timeline of the project we were not able to make this a successful turnaround.**Account List creation*** Decentralized Science Overview\n\n* Regenerative Finance Overview\n\n* **Future Studies**\n\n* **Space agencies**\n\n* **Space companies**\n\n* **Intellectual Property Offices worldwide**\n\n* **DAO overview**\n\n* **DEX/CEX overview****Lead List creation**<https://docs.google.com/spreadsheets/d/1bRzcE0RWZsouu4QrA0KeoOMcZ9P0XSZZF6S9J34qnLE/edit?usp=sharing>* **Manu’s Professional Network**\n\n* **Past events**\n\n  - **WEFDavos**\n\n  - **ETHDenver****Enrichment of data for Outreach (Find Linkedin, Twitter, Telegram, Email)**\n----------------------------------------------------------------------------------------------\n\n## Coordinape Results\n\n## [Link to the Coordinape](https://coordinape.com/): Make the Astronauts the admin.|                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| Manuel          | 15.33                  | 0                   |\n| Lucas           | 7                      | 0                   |\n| Pablo           | 18.505                 | 0                   |\n| Mitchie         | 28.5053                | 0                   |\n| Luigi           | 15.33                  | 0                   |\n| Tyler           | 15.33                  | 0                   |\n\n**Resources****DeWork**<https://app.dework.xyz/moondao/moondao-partnership/view/board-ljc9o7t4>**Google Drive**<https://drive.google.com/drive/folders/1TZYrXXzlCBt2KYmdxF6VmEcUK52c6NZR>**Strategy**<https://drive.google.com/drive/folders/1BsxoPguP3zyOz9ncspVDLre1d1__ho_y?usp=sharing>- Inbound onboarding funnel\n\n- Outbound strategy<https://drive.google.com/drive/folders/1lmaNPCuSW-yDjiM6j7SA02MN6NsQi_6V?usp=sharing>\n",
  "contributors": "[{\"Contributor\": \"Lucas\", \"Payout Address\": \"0xD5629b8bF9D81720b9A87E01BFbB5D3fc507fe4F\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"42,747\", \"Dai\": \"146.80\"}, {\"Contributor\": \"Pablo\", \"Payout Address\": \"0x679d87D8640e66778c3419D164998E720D7495f6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"106,897\", \"Dai\": \"97.23\"}, {\"Contributor\": \"Mitchie\", \"Payout Address\": \"0x3d1F623BEedc1bdAaeA4E7F968B44e6262eaCcAd\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"167,963\", \"Dai\": \"576.83\"}, {\"Contributor\": \"Manuel\", \"Payout Address\": \"0xE862E2C1ca94eAcfEDe3c95a217c15EF0086a29D\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"93,615\", \"Dai\": \"321.50\"}, {\"Contributor\": \"Tyler\", \"Payout Address\": \"0x680f8C4b76AD9FBE3a25FF40aaceC9Aaf357B885\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"93,615\", \"Dai\": \"321.50\"}, {\"Contributor\": \"Luigi\", \"Payout Address\": \"0x157Bd0591c9E80B5640dEC001E9d73720fa19960\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"93,615\", \"Dai\": \"321.50\"}, {\"Contributor\": \"Luffy\", \"Payout Address\": \"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"12,463\", \"Dai\": \"42.80\"}, {\"Contributor\": \"Coordinape\", \"Payout Address\": \"0x15B513F658f7390D8720dCE321f50974B28672EF\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"12,213\", \"Dai\": \"41.94\"}]"
}
