{
  "body": "# **Lunar Comms Network Topology Analysis: Final Report**\n\n## [MoonDAO Final Report Reference](https://docs.google.com/document/d/16F-_bcC0C4889YmuQl6WWChDKQObHhmfjasDna0wOmk/edit?usp=sharing)\n\n## **Summary**\n\nTLDR: We made a proposal for a similar project and forged strong relationships with industry professionals and experts in the process. The resulting proposal is damn fine, too.This project took a turn to focus on another proposal opportunity along the same lines as the NASA NextSTEP-2, called LunA-10 from DARPA. We assembled a team of 7-8 individuals from across the industry and across the world to formulate an approach to deliver Positioning Navigation and Timing to the moon using communications links as opposed to a dedicated signal. The team submitted a 3-page abstract. The abstract was accepted and we had to write the full proposal, including a 10-page text document, 20-slide presentation, and 4 supplementary documents for things like projected budgets and sample contracts. The team submitted the proposal materials within the deadline.Through the LunA-10 proposal, all of the key results of Objective 1 were achieved. This includes research on the current technology landscape, developing metrics, and identifying a near-term project and future work. The KRs for Objective 2 were mostly achieved too, except for code and simulations which were delayed to the potential contract period of LunA-10.Topics for the proposal included:1) Describing a framework for delivering PNT as a service to cislunar actors, including system architectures and technical details of operation.\n\n2) Proposing work to be done between Nov 2023 and May 2024. We pitched an agent-based model.\n\n3) Proposing potential follow-on work. We pitched an on-orbit experiment with Cubesats in LEO.\n\n4) Explaining the current “state of the art” for all of the technical foundations of our idea\n\n5) Explaining the following characteristic of our proposed solution and how it compares to the current “state of the art” aka GNSS\n\n   1. Scaling: How the system handles tens vs thousands of users and providers.\n\n   2. Commercialization: Potential for monetization and market analysis\n\n   3. Metrics: Quantifiable items to use for data-driven analysis of our proposal vs state of the art\n\n6) Explaining technical challenges, risks, and mitigation strategies for them\n\n7) Estimated budget to complete the proposed work\n\n## **Results**\n\n1. **Objective:** Set up an internal study based on this NASA NextSTEP-2 solicitation (Study Area #3 only)\n\n   1. **Key Result**: Create an outline of the effort and tools needed to complete a network topology analysis\n\n      1. **Results**: This is the basis of the LunA-10 submission. The submitted materials to LunA-10 will be shared to the MoonDAO community after DARPA’s decision is released, with permission from our contributors from other organizations.\n\n      2. **Learnings**: n/a\n\n      3. **Maintenance**: n/a\n\n      4. **Team’s Self-Reported Score**: 1\n\n      5. **Team Contributions****Greg**: Wrote previous work section on three pager which was used for ten pager.\\\n**Pablo**: I supported Phil on both the submitted papers, took ownership of a couple sections (e.g. commercialization) and generally helped fill in gaps to make sure we met the deadlines on each of the submissions. I also helped with editing the paper and presentation.\\\n**Phil**: I was the primary contributor to both submitted papers and the submitted presentation. I also had a major role in architecting the outline of the paper and proposed work. I project managed the cross-org effort to get all deliverables completed within 2 weeks of each deadline.\\\n**Rod**:****2) **Key Result**: Identify and define the nature of each topology under analysis\n\n   1. **Results**:  This is the basis of the LunA-10 submission. The submitted materials to LunA-10 will be shared to the MoonDAO community after DARPA’s decision is released, with permission from our contributors from other organizations.\n\n   2. **Learnings**: n/a\n\n   3. **Maintenance**: n/a\n\n   4. **Team’s Self-Reported Score**: 1\n\n   5. **Team Contributions**\n\n   6. **Greg**: Some assistance consolidating the reference Phil sent out. About six hours or so of research and a couple hours of Obsidian. These didn’t result in a deliverable for DARPA, but helped progress the discussion in the early phases.\\\n      **Pablo**: For this objective I just read the papers that Phil sent over to get a general understanding of prior work in the space. It definitely helped a lot in writing the sections, but Phil deserves the credit here for sourcing the prior art.\\\n      **Phil**: I sourced most of the citations used in our paper, including prior research that serves as the backbone of our proposal. After discovering the existing works, I summarized them for the paper and for other collaborators.\\\n      **Rod**:****\n\n3) **Key Result**: Identify data-driven metrics that can be used to evaluate relative performance/utility of each topology based on these metrics\n\n   1. **Results**:  Quantitative metrics were identified and described for future analysis. \n\n   2. **Learnings**: \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: 1\n\n   5. **Team Contributions** \\\n      **Greg**: Produced the 12 parameters organized into 4 categories that spanned the scope of the DARPA proposal.\\\n      **Pablo**: I asked a bit about what metrics we could use to highlight the advantages of Wi-Wi, but this was all Phil and Greg on the rest of the metrics!\\\n      **Phil**: I made some slight modifications to Greg’s table of metrics, added some of my own, and adapted the table for the paper.\\\n      **Rod**:2. **Objective:** Complete an internal study analyzing relative performance of several network topologies in the context of lunar operations\n\n   1. **Key Result**: Create code models or simulations of each network topology\n\n      1. **Results**: An approach for a model was designed for and described in the LunA-10 submission, but no code was written.\n\n      2. **Learnings**: This is a lot of work!\n\n      3. **Maintenance**: n/a\n\n      4. **Team’s Self-Reported Score**: 0.2\n\n      5. **Team Contributions**\\\n         **Greg**: Early inspiration of ant colony optimization! But it didn't materialize in the papers.\\\n         **Pablo**: Edited some of the sections on modeling and reformatted it into the presentation, but the ideas were all Phil.\\\n         **Phil**: I concepted and described an agent-based model that aims to demonstrate the performance of various PNT networks and interactions between them as the cislunar population grows. This model is described in the paper.\\\n         **Rod**:****\n\n   2. **Key Result**: Document the results of the models and simulations with data-driven metrics from Objective #1\n\n      1. **Results**: No results to document.\n\n      2. **Learnings**: n/a\n\n      3. **Maintenance**: n/a\n\n      4. **Team’s Self-Reported Score**: 0\n\n      5. **Team Contributions**\\\n         **Greg**: n/a\\\n         **Pablo**: n/a\\\n         **Phil**: n/a\\\n         **Rod**: n/a****\n\n   3. **Key Result**: Discuss the results in the context of other lunar communication technologies and missions\n\n      1. **Results**: The proposed PNT service and underlying comms technologies were compared to existing missions and companies, such as Parsec and Helium.\n\n      2. **Learnings**: n/a\n\n      3. **Maintenance**: n/a\n\n      4. **Team’s Self-Reported Score**: 0.8\n\n      5. **Team Contributions**\\\n         **Greg**: None. Go Helium!\\\n         **Pablo**: I brought up Helium and did some investigation on their incentive model and how we could improve on it.\\\n         **Phil**: I linked Pablo’s insights into Helium’s characteristics and successes to potential applications for cislunar space, grounding our research in a real-world analog.\\\n         **Rod**:****\n\n   4. **Key Result**: Identify areas of future research\n\n      1. **Results**: \n\n      2. **Learnings**: n/a\n\n      3. **Maintenance**: n/a\n\n      4. **Team’s Self-Reported Score**: 1\n\n      5. **Team Contributions**\\\n         **Greg**: Hard to assign individual contributions to a collaborative result. Obsidian articles helped. I’ve been beating the drum for refining Moon DAOs “boundary layer” which I believe is key. \\\n         **Pablo**: I think there’s a ton of potential with our LunA grant and there’s a lot of experiments we can do to further that work and test our assumptions. I wouldn’t say I personally did “work” to identify them, but it came naturally from all collaborating on LunA.\\\n         **Phil**: I ideated several promising future works including collaborations between MoonDAO and collaborating orgs for future on-orbit experiments and future research. Most of it is still in the ideation phase, but there is considerable hype from the group and I’ve discussed a number of these ideas with each collaborator separately. Even if we don’t get the LunA-10 contract, I’m certain there will be future collaborations on this topic.\\\n         **Rod**:****\n=====================\n\n## Coordinape **Results**\n\n# [Link to the Coordinape](https://coordinape.com/): Make the Astronauts the admin.|                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| **Phil**        |                        |                     |\n| **Pablo**       |                        |                     |\n| **Greg**        |                        |                     |\n| **Rod**         |                        |                     |\n",
  "contributor": "[{\"Contributor\": \"Pablo\", \"Payout Address\": \"0x679d87D8640e66778c3419D164998E720D7495f6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"752,133\", \"Dai\": \"684.11\"}, {\"Contributor\": \"Phil\", \"Payout Address\": \"0x6bFd9e435cF6194c967094959626ddFF4473a836\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"1,185,925\", \"Dai\": \"4,072.78\"}, {\"Contributor\": \"Greg\", \"Payout Address\": \"0x11646C2BbB14e5db25aB4b4BDAc38Fe35819F844\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"474,370\", \"Dai\": \"1,629.11\"}, {\"Contributor\": \"Coordinape\", \"Payout Address\": \"0x15B513F658f7390D8720dCE321f50974B28672EF\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"7,827\", \"Dai\": \"26.88\"}]"
}
