{
  "body": "# **Project Final Report Template****Summary**\n\n## This proposal has guided the implementation of new methods for operations in regard to stewardship. It’s important to note that, beyond the scope of the achievements outlined below, this proposal has saved MoonDAO an estimated _minimum_ of 281,872 DAI and 3,459,500 MOONEY per year, calculated by carrying forward the costs of the initial space engineering, dev, and community guild charters. This estimate excludes costs averted from the growth guild charter, and the high potential for budgetary bloating, so in reality the costs saved are likely greater. This proposal marked an important cultural pivot point in the history of the DAO. The achievements of the stewards highlighted here were accomplished with 0 MVP.[Original Proposal: Stewardship Q2-2023](https://docs.google.com/document/d/13vqVrIeer_yTslq7Mzi8D3eGKoanGswVCMNCn0rimqw/edit#heading=h.nxmkt432i2sb)\n\n# **Results**\n\n1. **Objective:**  **Increase member quality and retention**\n\n   1. **Key Result**: 15% increase in the number of new members that successfully activate on day one\n\n      1. **Member(s)**: Colin, Mitchie, Rod, Ballack, Luffy\n\n      2. **Results**:\\\n         [Activation Metrics](https://docs.google.com/spreadsheets/d/1K7WIh8YPYGvv1M4gk8w5DJ9bivVyTPDLi9sc2gviGLg/edit?usp=sharing) \\\n         \\- The communicated average is up by 1.17%\\\n         \\- The opened channels down by - 3.98%\\\n         \\*These metrics may be skewed lower by high bot activity\n\n      3. **Learnings:**The baseline activation rate is less revealing than the communicated average (% who send 3+ voice or text messages) and the opened channels average (% who open 3+ channels). Given the context of political strife that MoonDAO has handled this quarter, a better goal might have been to simply maintain the current activation rate. \n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score: .5**\n\n   2. **Key Result**: 10% increase in the number of members that retain the next week\n\n      1. **Member(s)**: Colin, Mitchie, Rod, Ballack, Luffy\n\n      2. **Results**:\\\n         [Retention Metrics](https://docs.google.com/spreadsheets/d/1uYPP801nK3mwCMA4z_xb26euObP10o1aWBrLmE0MpUE/edit?usp=sharing)\\\n         \\- The average retention rate is up by 2%\\*\\\n         \\* The result may be skewed lower by high bot activity\n\n      3. **Learnings:** If activation and retention metrics are to be used as a standard for measuring engagement, we’ll need a definitive solution for bot activity. \n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score: .5**\n\n2. **Objective: Increase operational cohesion**\n\n   1. **Key Result**: Demonstratively viable and systematic approach for onboarding and orienting members\n\n      1. **Member(s)**: Colin, Mitchie, Rod, Ballack, Luffy \n\n      2. **Results**: [Onboarding Cleanup](#objective-increase-operational-cohesion)\n\n      3. **Learnings:** Several barriers to onboarding in Discord have been broken down, however to compensate we’ve also had to increase moderation by making use of the solutions offered by Discord natively, as well as Dyno and MEE6. \n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score: .9**\n\n   2. **Key Result**: Onboarding presentation prepared and presented weekly\n\n      1. **Member(s)**: Colin, Mitchie, Rod, Ballack, Luffy \n\n      2. **Results**: 3 form submissions and ongoing weekly onboarding calls\n\n      3. **Learnings:** Initial attempts at rendering an onboarding presentation have been made, however recently more success has been had simply meeting people where they’re at on the call. Better attendance metrics are required, however there have been several weeks without attendees.\n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score: .3**\n\n3. **Objective: Cultivate interesting and engaging discussion**\n\n   1. **Key Result**: \n\n      1. **Member(s)**:Colin, Mitchie, Rod, Ballack, Luffy\n\n      2. **Results**: The continuation of weekly guild/onboarding, and monthly CN meetings, as well as our AMAs with Gitcoin, Giveth, and Praise.\n\n      3. **Learnings:** Better metrics on attendance are required so that we can qualify the efforts of stewards in this regard. Better documentation and follow up on internal meetings is required, with again better metrics.\n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score: .8**\n\n4. **Objective: Maintain organizational infrastructure (technical and operational) and standards**\n\n   1. **Key Result**: Report of bugs and issues addressed demonstrating >99% uptime\n\n      1. **Member(s)**: Colin, Mitchie, Rod, Ballack, Luffy\n\n      2. **Results**: No major downtime events, excluding partial downtime of the treasury analytics dashboard. The new support/report form will provide better metrics on development support response times. \n\n      3. **Learnings:** Our infrastructure is fractured across several domains which increases maintenance costs. This inspired the much needed development of the App Expansion project.\n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score: .9**\n\n5. **Objective: Maintain attendance at all guild, senate, and town hall events**\n\n   1. **Key Result**: Notes and agendas posted for all guild meetings in #notes-and-agenda channel\n\n      1. **Member(s)**: Colin, Mitchie, Rod, Ballack, Luffy\n\n      2. **Results**: Every event attended by at least one steward. Agendas were published for most of the meetings, however the publication of notes has failed to keep pace.  \n\n      3. **Learnings:** Implementation of LLMs needs to be made a priority for meeting summarization, as well as better metrics for meeting attendance.\n\n      4. **Maintenance**: None\n\n      5. **Team’s Self-Reported Score:  .2**\n----------------------------------------------------------------\n\n# **Team Member Contributions**\n\n### **Ballack @ballack6780**\n\n1. **Objective**: **Onboarding new members**\n\n   1. **Key Result**: Review applications and reach out to appropriate applicants to join MoonDAO\n\n      1. **Specific Contribution**: review over 15 applicants and onboard @ming and @maccon to join MoonDAO for translating and bridge the CN an EN community.\n\n      2. **Impact:__** create the bridge & translation team for translation of all important documents, bridge the multi-communication between CN and EN community/contributors.\n\n      3. **Complexity:** onboard more members to join MoonDAO.****\n\n2. **Objective**: **Maintain organizational infrastructure (technical and operational) and standards**\n\n   1. **Key Result**: Manage the talent pool\n\n      1. **Specific Contribution:** organize the weekly growth guild meeting.\n\n      2. **Impact:** growth guild members can discuss the open points and status of different projects. \n\n      3. **Complexity:** different time zones\n\n   2. **Key Result**: Provide on-time support to new project stewards to ensure the project proposal process is followed smoothly\n\n      1. **Specific Contribution:** support Manual for Gitcoin project proposal for going project process smoothly.\n\n      2. **Impact:** Gitcoin proposal passed the snapshot.\n\n      3. **Complexity:** the time is too tight due to the Gitcoin Grants Timeline.\n\n3. **Objective**: **Cultivate interesting and engaging discussion**\n\n   1. **Key Result**: Daily post of updated information from MoonDAO\n\n      1. **Specific Contribution:** daily posts of MoonDAO Twitter and Discord CN (CN twitter has problems for almost one month).\n\n      2. **Impact:** cn members know our daily works\n\n      3. **Complexity:** need in time translation\n\n   2. **Key Result**: AMA with CN projects\n\n      1. **Specific Contribution:** organized monthly AMA for CN community and made the translation.\n\n      2. **Impact:** strengthen the communication between CN and EN community/contributors.\n\n      3. **Complexity:** oral translation is not easy.\n\n   3. **Key Result**: Marketing push for needed projects from CN Twitter\n\n      1. **Specific Contribution:** Marketing push for Gitcoin, ZeroG projects.\n\n      2. **Impact:** let more pp in twitter know these projects.\n\n      3. **Complexity:** CN twitter has the problem now and needs to figure it out.****\n\n4. **Objective**: \n\n   1. **Key Result**: Represent MoonDAO outside generally\n\n      1. **Specific Contribution:** Represent MoonDAO to potential partnership or outreach before ideation for CN side. Attend Hongkong Web3 events, represent MoonDAO with Greenpill CN for the potential cooperation.\n\n      2. **Impact:** more pp in the crypto world know MoonDAO.\n\n      3. **Complexity:** attend the Hongkong event, paid by myself.**Colin @name.get**5. **Objective**: Maintain organizational infrastructure (technical and operational) and standards\n\n   1. **Key Result**:\\\n      Technical maintenance of websites, smart contracts, discord bots, etc…\n\n      1. **Specific Contribution**:\n\n         1. [Dashboard](https://dashboard.moondao.com)\n\n            1. Troubleshooting treasury page\n\n            2. Created Documentation\n\n            3. Linked [projects page](https://dashboard.moondao.com/#/projects) with snapshot (automated)\n\n         2. [MoonDAO-App](https://app.moondao.com)\n\n            1. Added ‘missions’ dropdown to nav\n\n            2. Minor refactoring\n\n            3. Updated documentation\n\n         3. [Docs](http://docs.moondao.com)\n\n            1. Updated [project guidelines](https://docs.moondao.com/project-guidelines/) to V4\n\n            2. Replaced ‘project steward(s)’ with ‘rocketeer(s)’\n\n            3. Added documentation for Zero-G and Social Media contest\n\n      2. **Impact:__** \\\n         Ensured that the sites are operating smoothly and made adjustments as requested by members and stewards. \n\n      3. **Complexity:**Adjusting code and adding documentation****\n\n6. **Objective**: **Increase member quality and retention**\n\n   1. **Key Result**:  Verification of development skills for new members\n\n      1. **Specific Contribution:**Attended onboarding meetings and assessed dev skills of new members. \n\n      2. **Impact**: __Found several members that are worth following up with and inviting to dev-guild meetings\n\n      3. **Complexity:**Attending the onboarding meeting and talking with other devs.**Luffy @luffy54#4524**7. **Objective**: **Onboarding members to projects**\n\n   1. **Key Result**: Facilitate the ideation to come up with proposals aligned with MoonDAO’s mission and potentially bring positive impacts to the DAO\n\n      1. **Specific Contribution**:In-depth reviews and being delegates for various (\\~15) project proposals,\\\n<https://snapshot.org/#/tomoondao.eth> Early support and giving comments on ideation stage (e.g. vMooney Vestin).\\\n<https://discord.com/channels/914720248140279868/1108476723760201771>Created 2 project proposals (without MVPs) to facilitate the DAO operation. 1. [MoonDAO Proposal: MDP-92: Twitter Verified Organization (snapshot.org)](https://snapshot.org/#/tomoondao.eth/proposal/0xb1d3319b0a0420fcd1fdfe1a3817066efef60db6df02bb7100000e51dffce99e)\n\n2. [MoonDAO Proposal: MDP-91: Treasury Diversification Proposal (snapshot.org)](https://snapshot.org/#/tomoondao.eth/proposal/0x2e845ded6ab00676c6ab71295f715287149d7552edc306a50bb5a1974024bb73)Organized several AMAs with CN community to answer community concerns, collected community questions on hot topics (e.g.<https://docs.google.com/document/d/1G1lTTpHWQTc7g4mUioFmsPsFZdywex-yxGj7WH9d3zM/edit?usp=sharing>) 2) **Impact:__** _ensure proposals have been reviewed and aligned with MoonDAO mission before going to snapshot._ \n\n3) **Complexity:** Time consuming, require broad knowledge and strong critical thinking skills****2) **Key Result**: Onboarding members to right projects\n\n   1. **Specific Contribution:** created a new series of on-boarding calls to onboard new members and answers their questions. Joined and hosted weekly community calls. Shifted the call to a new time slot to increase CN community engagement. \n\n   2. **Impact:** Simplified onboarding process, facilitated CG call \n\n   3. **Complexity:** required strong commitment, and time to join the weekly calls. Keep updated with other members about tasks they are doing and brainstorming for new project proposals.****\n\n3) **Key Result**: Provide on-time support to new project stewards to ensure the project proposal process is followed effortlessly & smoothly\n\n   1. **Specific Contribution:** Provided support for a couple of projects including MoonDAO partnership, merge irl nft, etc. \n\n   2. **Impact:** Some support and comments were positively accepted by the team. \n\n   3. **Complexity:** Couple of hours per week to follow up project progress, early support at the beginning.****8. **Objective**: **Monitor MoonDAO treasury status (NONE)** Given the current MoonDAO spending, I would suggest doing this activity every year. \n\n   1. **Key Result**: Label MoonDAO treasury transactions\n\n      1. **Specific Contribution**: \n\n      2. **Impact:__** \n\n      3. **Complexity:**\n\n   2. **Key Result**: Monitor MoonDAO expense & remaining treasury\n\n      1. **Specific Contribution:**\n\n      2. **Impact:**\n\n      3. **Complexity:**\n\n   3. **Key Result**: Quarterly Treasury Transparent report\n\n      1. **Specific Contribution:**\n\n      2. **Impact:**\n\n      3. **Complexity:**\n\n9. **Objective: Maintain MoonDAO library (shared folder)**\n\n   1. **Key Result:** Monitor the MoonDAO library\n\n      1. **Specific Contribution:** Created MoonDAO shared folders and restructured the folders. Monitored the uploading of completed projects. <https://drive.google.com/drive/u/0/folders/1WHGuYSqpob6_Wbi11VJ65vcYSuIOG3gK>\n\n      2. **Impact:__**  Some projects have been uploaded to the shared folders, many haven’t. \n\n      3. **Complexity:** Not complex but time consuming tasks. Easy to forget due to other more important tasks. ****\n\n   2. **Key Result:** Ensure Rocketeers upload project documents to the right folders\n\n      1. **Specific Contribution: None.**\n\n      2. **Impact:**\n\n      3. **Complexity:****Mitchie @mitchie\\_mitch**10. **Objective**: **Increase member quality and retention**\n\n    1. **Key Result**: Qualify and review members in terms of graphic and web design experience\n\n       1. **Specific Contribution**:\\\n          Onboarded [@sforz](https://discord.com/users/921050686962167878), skilled motion graphics specialist, with the creation of the MoonDAO in Motion project.\n\n       2. **Impact: __**- 1 new moonsettler\\\n          \\- Presence in the introductions channel:\\\n          ****![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXc7qK_U19V-G42F53mGutqvJMZGQo7l2yhGf9_2xN7Xs6u18meaa8o0Cwnbix3PsUsZGvGpMrFWq4GeCCX0AYRxsxrtIfBRNZ8LfuYne--wqTQffx1X0GEXOdRNA3cZj0F5arunQtPziDcgJhj1Kw84UaqC?key=nX1izl196nqG65VN09T2ig \"Points scored\")****\n\n       3. **Complexity:**The major hurdle faced in all guilds has been converting members into contributors. The addition of a singular moonsettler is a small win, but is a substantial contribution (20% of the total) to quality member retention considering the current period of drought in contributorship\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n# **Objective**: **Increase operational cohesion**\n\n10. 1. **Key Result**: Target and address key pain points in our technical and operational infrastructure\n\n       1. **Specific Contribution:** \\\n          After open discussion throughout the quarter, intention to address the operational infrastructure for partnerships has been committed within the scope of the [MoonDAO B2B project](https://docs.google.com/document/d/1We2VmHRf7c-fOB5VbzPo4zatDpfFpa1mVmJx2t6fZCM/edit#heading=h.piq12i6l9hzn).\n\n       2. **Impact:**The impact of the project is yet to be determined, however this project represents a significant development in MoonDAO’s positioning towards profitability.\n\n       3. **Complexity:** \\\n          The programming of the operational infrastructure will require familiarity with MoonDAO’s existing solutions and ability to handle the technical complexity of integrating multiple tools and services.\n\n11. **Objective**: **Cultivate interesting and engaging discussion**\n\n    1. **Key Result**: Ensure violations of our constitution in public channels are addressed immediately with no violation remaining longer than 24 hours.\n\n       1. **Specific Contribution:**Implementation of [the new support/report channel](https://discord.com/channels/914720248140279868/1101277156014821547)\n\n       2. **Impact:**Overall average response time was 9 hours, 2 minutes.\\\n          Since the implementation of the support/report ticketing system, seven submissions have been received with Mitchie being the first-responder on six. Issues resolved have ranged from channel inaccessibility to scams/spam reports and delayed payments. It marks an improvement over the chaotic environment of the previous support channel. Full audit [here](https://docs.google.com/spreadsheets/d/1qWnfB-wrl4ONMlvgO-icRTRX9hTu6UH6U2liIHh1qnI/edit?usp=sharing) \n\n       3. **Complexity:** How best to direct members towards the support/report channel, instead of posting in social channels, remains an issue to be solved.13. **Objective**: **Cultivate interesting and engaging discussion**\n\n    1. **Key Result**: Curate or post at least three highlighted topics in the general, general form, or ideation channels each week for discussion at guild meetings\n\n       1. **Specific Contribution:\\\n          -** Archived channel (see [video](https://www.loom.com/share/1a82c51a15a64e5ca7499b67028b9efc?sid=1216e411-012f-4954-bee4-d41c28248d25))\\\n          \\- Moderation of internal social channels\n\n       2. **Impact:**The objective of consistent posting in the general form was abandoned as the feedback was that the form channel was causing confusion as it was unclear whether the channel was aimed at serving members or contributors. In response to environmental factors, greater attention was placed on moderation.****The number of comments left in general, introduction, and support threads over the three month period to date (April 1st - June 28th) roughly tracks with the amount of moderation provided and overall community engagement. For broader context these graphics present comment count by rocketeer with stewards highlighted.\\\n          ![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXc5iPiLNVkK2jLnp0FqeSPgja4xsmAUpuwLEcvNSYZrvf7eQDx7_eFkFjzaM93qZChO4ubyu0GHhQs129SjiR0sp7Mp_ox3DvaQ3j4Ss0GL-lPjuDQsa-I2PWW-1OM9zhgse4mmZJ4e7ZQQGocWD_FjGzU-?key=nX1izl196nqG65VN09T2ig \"Points scored\")****\n\n       3. **Complexity:** This metric demonstrates a measure of presence in the DAO amidst adversity and resiliency against toxicity and attacks with top commenters often serving on the defensive.14. **Objective**: **Decrease operational resistance**\n\n    1. **Key Result**: Streamline manual process for onboarding and orientation\n\n       1. **Specific Contribution:**[Huge update dump](https://discord.com/channels/914720248140279868/914976122855374958/1110311771899703306)\n\n       2. **Impact:**Integrated Spect forms, MEE6, and Dyno, and Discord settings to great effect and significant reduction in barriers to entry, such as needing to verify with Guild before participation in social channels. The impact has been a much clearer path to engagement for new members as demonstrated below:\\\n          ![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXeASesfBWf4bRTIuEWD6-KrW6w8fazGmfoav1sMDLJ5OGRIWDTxl7xK-TZgY5nHUXkOPvUX7GuTZtL-OCX3Ag32SztN6ClHZrNaYPOyJkCAxF_N1nHcG_djv2OWATCFcgfmExHV6P3p0eDx8gM7j7RaFDo?key=nX1izl196nqG65VN09T2ig)![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfLz1msO-Um275zUjDtBoDtXYg19fLQrderyrO9dRsIH3I5DVo7pWdkH-Zaox7RikskTGsxbe4MlHhvA68Bd2UESdMZYvd9-wKPoyCVMp_UPjgf4V61EUC6aoAUunp9lvWEvisIII-ShjPYVK5WYgLR1daF?key=nX1izl196nqG65VN09T2ig)\\\n          ![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfrbBwuKIBdrkmF3gO7BSAmHSfMaQ_ezcRnDyov_pWVmPTmkbEaK9hlM5nDvMt7tPdSKzLV9FmV0b3aidEfxF2VTLF1C7_XNmB29dzC9a7PqSF-kgJk_E63DSFLzcIPaq-hfwtQSoiwFJdMxZrynpUuTdtM?key=nX1izl196nqG65VN09T2ig)\\\n          Bonus: Getting listed in Discord’s official discovery index leading (so far) to 27 new members.\n\n       3. **Complexity:**Implementation of these features involved extensive planning, analysis of miscellaneous discord roles and permissions, testing, and familiarity with the functions of bots while working closely with Pablo to uncover the necessary historical context.\\\n           \n\n15. **Objective**: **Maintain organizational infrastructure (technical and operational) and standards**\n\n    1. **Key Result**: All website-related errors, bugs, or requests are addressed within 24 hours and resolved immediately\n\n       1. **Specific Contribution:** \\\n          In response to the discord onboarding cleanup initiative the homepage was also streamlined, now forwarding potential candidates directly to Discord. Issues with broken discord invite links were resolved immediately however the reason for the link breaking is yet to be determined. Changes were also implemented to the site to accommodate the needs of the zero-g project as well. One elusive update to the site that was not addressed within 24 hours is the change to the new Google analytics implementation.\n\n       2. **Impact:**Simplified and streamlined user experience as well as project-oriented updates.\n\n       3. **Complexity:**This responsibility requires familiarity with Webflow, an advanced page-builder and CMS engine, as well as coding, SEO, and other graphic design and technical skill sets.\n\n    2. **Key Result**: Review and approve all posts to the blog or and content added to the website to ensure compliance with our constitution\n\n       1. **Specific Contribution:** \\\n          None\n\n       2. **Impact:**Immeasurable - This key result was built on the false assumption that there would be demand from rocketeers or Moonsettlers to publish information on the site. 3. **Complexity:**None****16. **Objective**: **Maintain attendance at all guild, senate, and town hall events**\n\n    1. **Key Result**: Attend/take notes at Dev, Community, and Growth guild meetings\n\n       1. **Specific Contribution:**None\n\n       2. **Impact:** - 8 posts in #notes-and-agenda\\\n\\- Attendance at all but 2 meetings\\\nPrevious note-taking efforts relied on retroactive review of meetings that proved unscalable as the length and number of meetings grew in tandem with project responsibilities. This motivated a re-orientation of focus wherein time previously spent summarizing results was replaced with research and development into methods of automation using AI. The product of this effort will be realized in the form of an upcoming proposal to automate content development for generating voter engagement.**Rod @ionrod**17. **Objective**: **Increase member quality and retention**\n\n    1. **Key Result**: Develop valuable partnerships and professional connections\n\n       1. **Specific Contribution**: \n\n          1. Got in touch with David Chaum (he created blockchain) and his project Astrocool.com. Astrocool involves global decision making, highly relevant to MoonDAO\n\n          2. Shilled MoonDAO at LSIC Extreme Access Telecon, and reached the main presenter - Sarah Withee via email. Philip is also in touch with her and she invited us to present MoonDAO’s Lunar Comms project to LSIC\n\n          3. Arranged AMAs:\n\n             1. [Owocki, founder of Gitcoin](https://twitter.com/OfficialMoonDAO/status/1650515047758589953?s=20)\n\n             2. Griff Green, founder of Giveth: [Part 1](https://twitter.com/i/spaces/1RDxlaNnVYEKL?s=20),  [Part 2](https://twitter.com/i/spaces/1djxXlRWywdxZ?s=20)\n\n             3. [Kristofer, founder of Praise](https://twitter.com/i/spaces/1OdKrzWyBZqKX?s=20)\n\n          4. Created & verified project on Giveth: <https://giveth.io/project/moondao?tab=updates> , formal proposal: [MoonDAO on Giveth](https://docs.google.com/document/d/1AIpcToYg2hL6a2zWNuQVGLxU20EY5yVlMEP8DzBU4iU/edit)\n\n       2. **Impact:__** MoonDAO got recognition in LSIC, and that's HUGE, now MoonDAO is on professional radars. Same with AMAs and Giveth - MoonDAO got recognized by OGs in the regen world.\\\n          However, **the main impact** - getting in touch with Astrocool project (and David Chaum), because that project can actually make cis-lunar economy HUGE\n\n       3. **Complexity:** it’s hard to predict when the new opportunity comes (like with David), and with others it’s hard to organize everything as a lot of members/parties are involved\n\n    2. **Key Result**: Onboard and qualify new members that suit MoonDAO’s needs\n\n       1. **Specific Contribution:** \n\n          1. Responded on all emails applications to SEG\n\n          2. Onboarded to Discord:\n\n             1. AnastasiaAdAstrabunker (ZeroG)\n\n             2. Julio Rezende (ZeroG)\n\n             3. Tyler Shim (worked on NASA CMS, passionate about crypto)\n\n             4. Bunker (he has a lot exp with robotics & aerospace)\n\n       2. **Impact:** We have hardcore space professionals\n\n       3. **Complexity:** The biggest problem is that we do not have specific space exploration projects to work on right now, and those people are mostly in standby mode. Planning to change it by getting in touch with more projects, as well as push several small internal engineering projects\n\n18. **Objective**: **Cultivate interesting and engaging discussion**\n\n    1. **Key Result**: Will support discussions based on Space Systems Engineering experience\n\n       1. **Specific Contribution:** \n\n          1. IRL presentation on crypto meetup on Phangan: Inside MoonDAO ([video](https://www.youtube.com/watch?v=BlTOGeTKoMI), [presentation](https://docs.google.com/presentation/u/0/d/17whOtHKn5QxM5MKEIBDenaGVfHqO_PJn1yW0rFs8KBE/edit?usp=drive_web\\&pli=1))\n\n          2. Drafted [MoonDAO Open Lunar Comm Spec](https://docs.google.com/document/d/11_5uSydqeLG6PzjxEtUZtIJaF6e3BAUs_VECrDE4Rcg/edit)\n\n          3. Drafted the idea of [Lunar Comms ConOps Planner](https://docs.google.com/document/d/1PHGQ6Yq91zVEbo4jAZZa66xcHJgRg7uV9tFiVRZ3zMA/edit)\n\n          4. Updated MoonDAO 2030 Roadmap, plan for 2024 to be more specific, and measurable\n\n       2. **Impact:** Open Lunar Comm Spec,ConOps planner, are important as it keeps space engineers engaged, and changes in the Roadmap will affect the whole MoonDAO life in the next 5-10 years. IRL presentation has small impact, just a nice practice\n\n       3. **Complexity:** Roadmap and Open Lunar Comms requires a lot of precise wording, and collecting feedback from the community. And that precise world requires a lot of mental capabilities e.g. Open Lunar Comms was changed from a regular project to a DePrize-like****\n\n19. **Objective**: **Maintain organizational infrastructure (technical and operational) and standards**\n\n    1. **Key Result**:\\\n       \\- Will help structuring processes related to HW & SW dev\\\n       \\- Will help with technical feasibility analysis related to space engineering projects\n\n       1. **Specific Contribution:** \n\n          1. [Meeting notes, ](https://docs.google.com/document/d/1M2918IUtOwIDtjKHLILuMrti4X9Ut_bIXIR7_Egy3_g/edit)however missed a lot\n\n          2. Reviewed and left a lot of comments in the DePrize\n\n          3. Send 2 updates to a group of SEG members (16 emails), need to send SE updates more systematic\n\n       2. **Impact:** We have several major docs in the SEG folder on Drive, however we luck engagement, \n\n       3. **Complexity:** It takes a lot of time, and this quarter I’ve sucked at it, as I was distracted by a lot of external activities.****\n\n20. **Objective**: **Maintain attendance at all guild, senate, and town hall events**\n\n    1. **Key Result**:\\\n       \\- Will attend most of the events, except regular events that happens from 00:00 ICT to 09:00 ICT\n\n       1. **Specific Contribution:**\n\n          1. Missed one SEG call, as I’ve shilled space exploration on <https://twitter.com/i/spaces/1vAxRAEOrBrJl?s=20>\n\n          2. Attended all Town Halls\n\n       2. **Impact:** Weekly SEG meetings are important, no calls no SEG\n\n       3. **Complexity:** Due to timezone (UTC+7), it’s hard to attend a lot of meetings that happens during the US daytime, to address the issue I’m planning to change my location in a couple of months to be around UTC-4****<https://drive.google.com/drive/folders/17Fq589MbeyEAZviHFDFCwiZ3HSi3a-E6?usp=sharing>21. Total accounts banned: 290\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n# **Honorable Mention**\n\n**Lucas @0xlucasart**Lucas has been a tremendous asset for the stewardship guild and serving on the frontlines of moderation and engagement. In recognition of his efforts, the stewards have decided to include him in the coordinape distribution. ***** \\- Total accounts banned: [290](https://drive.google.com/drive/folders/17Fq589MbeyEAZviHFDFCwiZ3HSi3a-E6?usp=sharing)\\\n  \\- Total messages addressing concerns of the CN community in the quarter: 500 DMs\n\n* \\- Total activity on DMs related to MoonDAO in the quarter: aproxx 1K messages\n\n*****![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfGgFyw05hohi3uqS1JeGfKo6MSD2TwsdvlV2UDnqaq8U4i6iCs8J80_preU6Oa12rc718F33nQZxEDmB2aNGynNFjtGtDFfVslvH24Te7CW0LM074UwTmR-bFSWTufBtyYrI1lCQ938Sb07T1HyA7wFtiY?key=nX1izl196nqG65VN09T2ig)![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfdBctQj4oXSSSbSqeOhZk0qslR1vDdPiDFBD4kVSWsqqc7fPAylqz49hwF2zRxHnwDBQ94q8m76iZV96FRATZa_SiFZeCsSjbNQZFeWMthA7FUeQ-cbT4g0vmiPSQLMCXIMF8lHcd47dHTx2TGUfbVfJ0I?key=nX1izl196nqG65VN09T2ig)![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfKrdJoRtwMlQHttIeX9EQWBBkh8WDbiaTz0fyqClXCg9noS40_pdMTDvzYhPljzOGC38WA2TUOjWzuo5Vhk50Y8twC81C82ukCfoiUNmXsIluZGSDBjK0HB3r_pmm42ic8j0mS0yiYCK_XyRAblxaBLbOr?key=nX1izl196nqG65VN09T2ig)****\n------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\n# **Coordinape Results**\n\n## [Link to the Coordinape](https://coordinape.com/): Make the Astronauts the admin.|                        |                        |                     |\n| ---------------------- | ---------------------- | ------------------- |\n| **Member Name**        | **% of total rewards** | **Upfront Payment** |\n| **@ballack6780**       | 9.50%                  | None                |\n| **@name.get \\***       | 15.00%                 | None                |\n| **@luffy54#4524**      | 10.33%                 | None                |\n| **@mitchie\\_mitch \\*** | 32.17%                 | None                |\n| **@ionrod**            | 12.17%                 | None                |\n| **@0xlucasart**        | 9.00%                  | None                |\n| **@pmoncada**          | 11.67%                 | None                |\n| **Coordinape**         | 0.17%                  | None                |\\*note: The original proposal specified that dev guild stewards would have their MVPs deducted from the bonus of this proposal to handle the overlap, however this is now unnecessary as the total MVPs of all projects are subtracted from the total reward amount.**Project Wrap Up Checklist*** ",
  "contributors": "[{\"Contributor\": \"pmoncada\", \"Payout Address\": \"0x679d87D8640e66778c3419D164998E720D7495f6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"301,056\", \"Dai\": \"1,162.41\"}, {\"Contributor\": \"Mitchie\", \"Payout Address\": \"0x886002B1F355344feFd7df5F9e566E9402C2cF8c\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"752,483\", \"Dai\": \"1,561.45\"}, {\"Contributor\": \"LucasArt\", \"Payout Address\": \"0xD5629b8bF9D81720b9A87E01BFbB5D3fc507fe4F\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"176,974\", \"Dai\": \"898.36\"}, {\"Contributor\": \"Name.get\", \"Payout Address\": \"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"381,728\", \"Dai\": \"0.00\"}, {\"Contributor\": \"ryand2d\", \"Payout Address\": \"0x78176eaabcb3255e898079dc67428e15149cdc99\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"23,307\", \"Dai\": \"0.00\"}, {\"Contributor\": \"Rod\", \"Payout Address\": \"0xA64f2228cceC96076c82abb903021C33859082F8\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"309,709\", \"Dai\": \"1,341.97\"}, {\"Contributor\": \"Ballack\", \"Payout Address\": \"0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"150,349\", \"Dai\": \"819.02\"}, {\"Contributor\": \"luffy54\", \"Payout Address\": \"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"262,883\", \"Dai\": \"1,139.07\"}]"
}
