{
  "body": "# **Desci Community Validations: Final Report**\n\n\n# **Original Proposal**\n\n**Link to related reports:** \n\nProposal: [MDP-129: DeSci Community Validations](https://docs.google.com/document/d/1PiIktcYVQSxFNJAbaVVLj6FpPmGIp_8pv3sKjIyF1M8/edit#heading=h.piq12i6l9hzn)\n\nInterim Report (Q1): [Desci Community Validations: Final Report](https://docs.google.com/document/d/1jVjKnVSUP5r7HswNYfML_-tVW3FmliE02DEmfz2jlVM/edit?usp=sharing)\\\n**Original Abstract:** \n\nCommunity Validations (CVs) are a DAO-native way to build reputation by validating science in an open and transparent fashion. By working on CVs, members of DeSci DAOs can easily contribute, get credited, and receive rewards for their contributions to science. The unified, open and decentralized infrastructure underpinning CVs ensures that contributions can build into a collective reputation over time, helping showcase both the individual work of a contributor and the collective efforts of a DAO.\n\nThis project outlines how MoonDAO could participate as an early adopter and collaborator to the system that allows this decentralized science to circulate and self-regulate in the open. It also places MoonDAO in a position to be an ambassador for space science in the DeSci community and have an active role in lunar research.\n\nContributors will be rewarded for their engagements on DeSci Labs in addition to the normal giving circle rewards.\n\n\n# **Results**\n\n**_Rocketeer note:_** _This project was originally submitted and voted on as a CY2024Q1 project, and was extended into CY2024Q2. This report discusses the project as a whole, including results not discussed in previous reports._\n\n\n## Executive Summary\n\nI said this last time, but this project still needs time to cook. Participation from contributors including the Rocketeer evaporated over the quarter, leaving progress to stagnate. Renewed attempts to invigorate participation were stalled by additional bugs or design flaws with the Desci platform.\n\nIn the end, there was _some_ participation from MoonDAO contributors, but the team decided there was not enough to justify distributing 1 ETH among them proportional to the work done.\n\nThe team has decided to submit this project for this quarter’s retroactive rewards and have a new proposal created for Q3. This is to review the OKRs of the project and to ensure that we can do things that are achievable. \n\n\n## Complications\n\n- The Rocketeer (@phil) transferred duties to a project Moon Settler (@Royalty), stepping down due to personal reasons. Phil mentored Royalty through the Rocketeer role, and they jointly reported updates to the senate over the quarter.\n\n- Desci Labs continued to face bugs that prevented users from fully engaging with the CV feature.\n\n- A lack of original work led to posting the work of others in order to use the platform at all.\n\n- Outside factors, such as the Goerli test net that was powering the desci platform, were deprecated and caused significant downtime on the platform.\n\n\n## Wins\n\n- There were several hosted “workshop” sessions intended to onboard users to the Desci platform. This consisted of live demos, QnA with developers, and guided use of the platform.\n\n- The project saw continued interest and engagement from three MoonDAO contributors in particular: @ryand2d, @Eliza Maria, and @Southside☆.\n\n- 4 nodes were added to the MoonDAO community area on desci.\n\n- Our activity has uncovered at least a dozen issues with the platform, we reported them, and they were either fixed or worked on by the dev team.\n\n\n## Misses\n\n- Outside professionals were not brought in to the project. This was a combination of things going against us\n\n  - Low familiarity with the platform made it hard to teach others.\n\n  - Bugs and issues weakened confidence in the system (eg., \"is this a bug or is this me misunderstanding something?\" usually ended in a bug)\n\n  - Project organizers didn't get responses from the professionals and authors that were contacted.\n\n- Nothing was developed for tracking user engagements for the purpose of prize pool distributions. No tools to do so were built during the project period.\n\n- Rocketeer availability evaporated and this project called for more hands-on leadership than anticipated. @Royalty stepped up to carry it forward but life duties got in their way as well.\n\n- As a globally distributed team only working on this in spare time, regular meetings dissolved quickly due to low attendance.\n\n\n## Important links\n\n- <https://nodes.desci.com/community/moondao> \n\n-\n\n\n## OKRs\n\n1. **Objective: Onboard users to interact with the DeSci CV platform. This is something DeSci Labs has offered support with.**\n\n   1. **Key Result**: At least 10 new nodes are added to DeSci, curated by MoonDAO members. (Need not be new publications, just new to DeSci).\n\n      1. **Results**: __\n\n         1. 4 nodes added to the MoonDAO “radar”, 2 in the “curated” feed.\n\n         2. 10+ nodes created as drafts (but not published).\n\n      2. **Learnings**:\n\n         1. Asynchronously posting links and articles was not effective at engaging new users to engage with the platform. The most effective methods of onboarding new users were synchronous “buddy” sessions.\n\n         2. The team and prospective user base are globally distributed. This makes synchronous activities difficult, mostly due to time zone differences. The team found a time slot that generally worked for the team, but it was not at a convenient time for everyone. This kind of time constraint made synchronous activities less effective because we had less time to spend working together.\n\n         3. The DeSci platform is not very mature. Users (including the core team) ran into problems that blocked progress due to technical issues like UI glitches and unexpected backend maintenance. Other prospective users wished to interact with the platform via mobile, but the platform does not support small screens so this was an obstacle as well.\n\n         4. The DeSci development team is very responsive to feedback and bug reports. At least 5 feedback tickets were created by MoonDAO and all were acted on by DeSci before the end of the project period.\n\n      3. **Maintenance**: \n\n         1. DeSci maintains official user documentation: <https://docs.desci.com/> \n\n         2. Written onboarding instructions were created, tailored for MoonDAO: [DeSci Community Validations](https://docs.google.com/document/d/1VyZmXK-4HDNDfbXsJrzBx2xLd_SkEH-0aLAA-WEA9Vg/edit#heading=h.l3fautocouoo)\n\n2) **Key Result**: At least 10 MoonDAO unique members engage at least once with a Node.\n\n- Engagement = Verify attestations, comment on Nodes, leave reactions on attestations.\n\n- Each engagement counts as valid, rewarded contributions to MoonDAO.\n\n- The reviewer need not be an expert in the field they are reviewing.\n\n1. **Results**: \n\n   1. Created a [public channel](https://discord.com/channels/914720248140279868/1214329286329368647) in the MoonDAO Discord server dedicated to supporting users while they engage with the DeSci platform.\n\n   2. Created a new Discord role (@Researcher) as an opt-in way to notify users interested in publishing research en masse.\n\n   3. MoonDAO members that engaged with DeSci nodes\n\n      1. DeSci CVs project team (3)\n\n      2. Other MoonDAO users who posted in the #research channel (3)\n\n2. **Learnings**: \n\n   1. As mentioned above, asynchronous support via discord was not enough to promote actual engagement with the platform. The new channel and role are steps in the right direction, but server stats show that almost no one actually opted in to the new role and 90%+ of the discussion in the open channel is from the core team.\n\n3. **Maintenance**: \n\n   1. ~~Hosted workshop events in the MoonDAO discord where users can experiment, ask questions, and practice using the platform live with a DeSci staff member present to offer support.~~ These events were discontinued in April 2024.****\n\n**Grade:**  _Does not meet Expectations_****\n\n2. **Objective: Attract professionals and researchers from traditional institutions to participate in MoonDAO. The desired role for these individuals is to be technical advisors and resident experts.**\n\n   1. **Key Result**: At least 5 publishing researchers respond to our requests to participate\n\n- Publishing Researchers = scientists publishing lunar research\n\n- This is something DeSci Labs has offered support with\n\n1. **Results**: \n\n   1. (4) publishing researchers responded to requests. Not all of the researchers who responded were doing Lunar research, but all were involved in space science.\n\n   2. (0) of the researchers who responded actually used DeSci.\n\n2. **Learnings**: \n\n   1. Garnering interest in the project was easy, and it was also relatively easy to continue discussions with scientists about the concept.\n\n   2. Converting interested parties to actually use the platform was very difficult. No amount of documentation or video tutorials converted any users.\n\n3. **Maintenance**: Follow up messages should be sent to leads.\n\n2) **Key Result**: At least 1 publishing researcher joins MoonDAO as a voting member\n\n   1. **Results**: Nope.\n\n   2. **Learnings**: Didn’t get to learn about this process because the previous result is a prerequisite.\n\n   3. **Maintenance**: None.****\n\n3) **Key Result**: Create a new Discord/DAO role to identify verified experts\n\n   1. **Results**: Done.\n\n   2. **Learnings**: Since this is opt-in and wasn’t really announced, nobody has this role. It is not useful unless a significant group of members opts in.\n\n   3. **Maintenance**: A step should be added to the onboarding process to explain this role, or the role should be deprecated.****\n\n**Grade:**  Meets expectations.****\n\n3. **Objective:** Customize DeSci Tooling for Lunar Research Needs\n\n   1. **Key Result**: User sessions with MoonDAO members\n\n      1. **Results**: Planned for Q2.\n\n      2. **Learnings**: n/a\n\n      3. **Maintenance**: n/a\n\n2) **Key Result**: 1 weekly general feedback session throughout period of project\n\n- Create a weekly meeting with all participants\n\n1. **Results**: The team held a weekly meeting (separate from Town Hall) to coordinate work on this project.\n\n2. **Learnings**: Workshop events are necessary.\n\n3. **Maintenance**:****\n\n3) **Key Result**: 1 live ux test per week with desci labs UXR with varying moondao members\n\n- Book one session per week with Carla, rotate participants (will provide calendly)\n\n1. **Results**: Not done.\n\n2. **Learnings**: n/a\n\n3. **Maintenance**: n/a****\n\n4) **Key Result**: Writeup and product spec for MoonDAO tailored tooling received from DeSci Labs\n\n- Nothing to do here, provided by desci labs at end of trial run\n\n1. **Results**: <https://docs.desci.com/community/community-curation> \n\n2. **Learnings**: \n\n3. **Maintenance**:****\n\n**Grade:**  Meets expectations (for results that were completed).\n\n\n# **Member Contributions**\n\n**@philiplinden:** Phil published nodes on the platform and reported several issues to the DeSci dev team. Phil provided weekly progress reports to the community at MoonDAO Town Halls.\n\n**@carla0st:** Technical support and bug identification.\n\n**@royalty:** Worked with Carla on the onboarding documents and gave suggestions to onboard members to the projects. Validated Phil nodes. Organized meetings, supported new user onboarding, and reported progress to the senate every week. Upload a node on the platform and assisted Eliza in submitting her research. \n\n\n# **Reward Distribution**\n\n[_Link to the Coordinape_](https://coordinape.com/)_: Make the Astronauts the admin._\n\n|                 |                        |                     |                                            |                                            |\n| --------------- | ---------------------- | ------------------- | ------------------------------------------ | ------------------------------------------ |\n| **Member Name** | **% of total rewards** | **Upfront Payment** | **Wallet to receive ETH**                  | **Wallet to receive MOONEY**               |\n| _@philiplinden_ | 30%                    | none                | 0x6bFd9e435cF6194c967094959626ddFF4473a836 | 0x6bFd9e435cF6194c967094959626ddFF4473a836 |\n| @carla0st       | 15%                    | none                | 0x573B64aB6896048EE3629C675a4BcF43f15CAe67 | 0x573B64aB6896048EE3629C675a4BcF43f15CAe67 |\n| @royalty        | 35%                    | none                | 0x1D6CAaCB0528fd7EfFfE9029604DD2049a40B3cE | 0x1D6CAaCB0528fd7EfFfE9029604DD2049a40B3cE |\n| @southside      | 5%                     | none                | 0x3d802730A2F2e24b23d53cd7c5D9a06646e1ff10 | 0x3d802730A2F2e24b23d53cd7c5D9a06646e1ff10 |\n| @astroeliza     | 10%                    | none                | 0x08E424b69851b7b210bA3E5E4233Ca6fcc1ADEdb | 0x08E424b69851b7b210bA3E5E4233Ca6fcc1ADEdb |\n| @ryand2d        | 5%                     | none                | 0x78176eaabcb3255e898079dc67428e15149cdc99 | 0x78176eaabcb3255e898079dc67428e15149cdc99 |\n\n\n# **Treasury Transparency**\n\nThe funds held by this project’s Gnosis Safe are requested to be kept here until the end of Q2. At the end of the extended project period, these funds are intended to be completely distributed to MoonDAO members based on verified activity on the DeSci platform.\n\n_Link to Treasury with unused funds returned to the main DAO Treasury._\n\n|                                       |                        |            |                                                |                                                                                                                                                                           |                                           |\n| ------------------------------------- | ---------------------- | ---------- | ---------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ----------------------------------------- |\n| **Txn Title**                         | **Reason**             | **Amount** | **Recipient**                                  | **Etherscan Link or Gnosis Link**                                                                                                                                         | **Deliverable**                           |\n| Treasury Reimbursement                | Unused funds           | 1 ETH      |                                                |                                                                                                                                                                           |                                           |\n| Prize pool transferred to Gnosis Safe | Participant prize pool | 1 ETH      | eth:0x75E13BcA092ab655Ce89fF25fE3f775411D37bd8 | <https://etherscan.io/address/0x75E13BcA092ab655Ce89fF25fE3f775411D37bd8> / <https://etherscan.io/tx/0xf71af315c60dbc0f7c2705b55666008fc0d6602441ae17b38ad38e31d826eee7>  | Prize Pool distributions to contributors  |\n\n**The funds in this Gnosis Safe should be returned to the MoonDAO Treasury.**",
  "contributors": "[{\"Contributor\":\"philiplinden\",\"Payout Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Voting Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Eth\":0.2062,\"Mooney\":125357,\"Dai\":0},{\"Contributor\":\"carla0st\",\"Payout Address\":\"0x573B64aB6896048EE3629C675a4BcF43f15CAe67\",\"Voting Address\":\"0x573B64aB6896048EE3629C675a4BcF43f15CAe67\",\"Eth\":0.1031,\"Mooney\":62678,\"Dai\":0},{\"Contributor\":\"royalty3684\",\"Payout Address\":\"0x1D6CAaCB0528fd7EfFfE9029604DD2049a40B3cE\",\"Voting Address\":\"0x1D6CAaCB0528fd7EfFfE9029604DD2049a40B3cE\",\"Eth\":0.2406,\"Mooney\":146249,\"Dai\":0},{\"Contributor\":\"southside98\",\"Payout Address\":\"0x3d802730A2F2e24b23d53cd7c5D9a06646e1ff10\",\"Voting Address\":\"0x3d802730A2F2e24b23d53cd7c5D9a06646e1ff10\",\"Eth\":0.0344,\"Mooney\":20893,\"Dai\":0},{\"Contributor\":\"astroeliza\",\"Payout Address\":\"0x08E424b69851b7b210bA3E5E4233Ca6fcc1ADEdb\",\"Voting Address\":\"0x08E424b69851b7b210bA3E5E4233Ca6fcc1ADEdb\",\"Eth\":0.0687,\"Mooney\":41786,\"Dai\":0},{\"Contributor\":\"ryand2d\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0xB2d3900807094D4Fe47405871B0C8AdB58E10D42\",\"Eth\":0.0344,\"Mooney\":20893,\"Dai\":0}]"
}
