{
  "body": "# **Spacetime Protocol: Final Report**\n\n\n# **Original Proposal**\n\n**Link to Original Proposal:**[MDP-122: Spacetime Protocol (STP) - DePrize Problem Challenge](https://docs.google.com/document/d/1QmvdYcOehQaq4BBtSwRTY5E-QkFYJC7emk1fQ0CHPQc/edit?usp=sharing)\\\n**Original Abstract:**Spacetime Protocol’s proposal outlines a groundbreaking solution to the evolving demands of lunar and far orbit exploration for the current generation of aerospace enthusiasts. Leveraging commercial off the shelf components, SpaceTime Protocol aims to create a competition based on interconnectivity of separately built satellites. Through use of accessible components and a standardized protocol, two satellite bodies will establish proven communication links without requiring a major investment of capital. Spacetime Protocol's approach fosters collaboration, accessibility, and provides a pathway for students to contribute meaningfully to the future of space exploration.\n\n<!--StartFragment-->\n\n\n# **Results**\n\nAs reported in weekly Town Halls, this project detoured away from the originally proposed roadmap. The originally proposed goal was to integrate this project with DePrize and host a large competition with many participating organizations. The project team quickly found this ambitious goal to be one destined for failure given the current state of DePrize and the core ideas behind Spacetime Protocol—both are simply not mature enough to support that. Instead, the team scoped back the Spacetime Protocol project to have a narrower and more attainable focus: rather than an intercollegiate competition, the project would support a single university group through an engineering capstone project.\n\nPhil and Ashley are both alumni of the Rochester Institute of Technology (RIT) Kate Gleason College of Engineering (KGCoE). KGCoE has a mandatory course for engineering students in their final year where a multidisciplinary team of 4-6 students designs and prototypes a product for a customer. This program is the [Multidisciplinary Senior Design ](https://www.rit.edu/engineering/immerse-yourself/multidisciplinary-senior-design)course (MSD).\n\nThe proposed roadmap is to act as an advisor and customer for a student engineering design team tasked with designing and building a Time Card capable of operating on a Cubesat in Low Earth Orbit. Phil and Ashley have submitted a form of this project to the program for approval and to be conducted by a team of students in the Fall-Spring semesters of 2024. Phil is local to Rochester and can meet with the team in person, and also put students in contact with experts to aid in the design and build process. The specific request is for the design team to modify the published Time Card reference design such that its form factor and components could interface with a Cubesat avionics bus, fit in the Cubesat form factor, and function in a space environment. The requested deliverables from the design team are: research materials, citations, calculations, decision matrices, memos describing design decisions, technical drawings or 3D models, and data from any tests conducted on components. The design team will conduct design reviews at checkpoints along the way and deliver a final report describing the work done at the end. \n\nThe minimum buy-in to sponsor an RIT MSD project is $10,000. Phil and Ashley discussed the idea of sponsoring an RIT MSD project with Open Lunar Foundation as a partnership. Open Lunar has expressed positive interest in gifting money to the project if other sponsors can be found to match it. So far, no official letters of intent have been written by any parties involved.\n\nThe team requests that this project is closed and a new project is opened with the specific intent described above.\n\n1. **Objective:** Benchmarking Established Competitions\n\n   1. **Key Result**:  Leverage existing competitive requirement documents, create a comprehensive set of “must haves” for a DePrize competition\n\n   2. **Key Result**: Establish a management process for competition entry and evaluation/acceptance criteria for submitted materials\n\n   3. **Key Result**: Identify other technical student competitions and compile some documentation about how they were set up, rules, constraints, and outcomes\n\n**Grade:** Does not meet expectations.\n\n2. **Objective:** Scope Definition\n\n   1. **Key Result**: Clearly state the desired outcomes as a Request for Proposal that lays out the _intent_ of the competition deliverables\n\n   2. **Key Result**: Choose a framework for mentorship and technical development\n\n**Grade:** Meets expectations after pivot. Does not meet expectations of the original proposal.****\n\n3. **Objective:** Nurture Professional Connections & Sponsorship Opportunities\n\n   1. **Key Result**: Build a list of potential partnerships and grants for competition\n\n   2. **Key Result**: Form connections with partners and introduce potential teams to MoonDAO\n\n   3. **Key Result**: Recruit 1 subject matter expert as a technical advisor (via letters of intent) for:\n\n- Timekeeping\n\n- RF/Wireless Communications\n\n- FPGA design\n\n- Space Environments\n\n**Grade:** Meets expectations after pivot. Does not meet expectations of the original proposal.****\n\n4. **Objective: Publish Supporting Backgrounders and Primers**\n\n   1. **Key Result**: Prepare a primer on the core technologies and state of the art for deep space timekeeping. It should be an accessible document (under 10 pages, beautiful, and mostly plain language and illustrations)\n\n   2. **Key Result**: Publish the document on DeSci Labs\n\n**Grade:** Does not meet expectations.\n\n\n# **Member Contributions**\n\n**@philiplinden:** Set up and conducted conversations with RIT and Open Lunar Foundation.\n\n**@ashsack:** Set up and conducted conversations with RIT and Open Lunar Foundation.\n\n\n# **Reward Distribution**\n\n|                 |                        |                     |                                            |                                            |\n| --------------- | ---------------------- | ------------------- | ------------------------------------------ | ------------------------------------------ |\n| **Member Name** | **% of total rewards** | **Upfront Payment** | **Wallet to receive ETH**                  | **Wallet to receive MOONEY**               |\n| @philiplinden   | 50%                    | none                | 0x6bFd9e435cF6194c967094959626ddFF4473a836 | 0x6bFd9e435cF6194c967094959626ddFF4473a836 |\n| @ashsack        | 50%                    | none                | 0x3E08F6e00e78019AA571d144e1cC9b30E80F6646 | 0x3E08F6e00e78019AA571d144e1cC9b30E80F6646 |\n\n\n# **Treasury Transparency**\n\n[Link to Treasury](https://app.safe.global/home?chain=eth\\&safe=eth:0x4E1F1Cf3E973516Cd361816c9AdB6C6d922aBfD9) \n\n|                     |            |             |               |                                                                                              |                        |\n| ------------------- | ---------- | ----------- | ------------- | -------------------------------------------------------------------------------------------- | ---------------------- |\n| **Txn Title**       | **Reason** | **Amount**  | **Recipient** | **Etherscan Link or Gnosis Link**                                                            | **Deliverable**        |\n| Nonce 1             | Send       | 0.20283 ETH |               | <https://etherscan.io/address/0x4E1F1Cf3E973516Cd361816c9AdB6C6d922aBfD9>                    | Treasury Reimbursement |\n| Nonce 0             | Send       | 0.01686 ETH | Mitchie       | <https://etherscan.io/tx/0xa4223974477159fdfdae9456cec80ea4f30eaf3be941bf060d50ea9fcb7aa06d> | Gas fee reimbursement  |\n| Funding Transaction |            | 0.2197 ETH  |               |                                                                                              |                        |\n| Safe Creation       |            |             |               | <https://etherscan.io/tx/0x25d5d94e4c7b8215d7b1382771d7a2fd2fa81e9c861eb3db1ad46d90cf3ce114> |                        |\n",
  "contributors": "[{\"Contributor\":\"Phil\",\"Payout Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Voting Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Eth\":0.706,\"Mooney\":363896,\"Dai\":0},{\"Contributor\":\"Ashley\",\"Payout Address\":\"0x3E08F6e00e78019AA571d144e1cC9b30E80F6646\",\"Voting Address\":\"0x3E08F6e00e78019AA571d144e1cC9b30E80F6646\",\"Eth\":0.706,\"Mooney\":363896,\"Dai\":0},{\"Contributor\":\"Pablo\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Eth\":0.030,\"Mooney\":15322,\"Dai\":0},{\"Contributor\":\"Mitchie\",\"Payout Address\":\"0xb1d4c1B9c8DA3191Fdb515Fa7AdeC3D41D014F4f\",\"Voting Address\":\"0x9fDf876a50EA8f95017dCFC7709356887025B5BB\",\"Eth\":0.015,\"Mooney\":7661,\"Dai\":0},{\"Contributor\":\"Colin\",\"Payout Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Voting Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Eth\":0.015,\"Mooney\":7661,\"Dai\":0},{\"Contributor\":\"Ryan\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Eth\":0.015,\"Mooney\":7661,\"Dai\":0}]"
}
