{
  "body": "# **Second Astronaut Reselection: Final Report**\n\nOriginal Proposal [MDP-112: Second Astronaut Reselection](https://docs.google.com/document/d/195vjQ588ZFKu_AhZFpHKFdgi6hiWln_EqkLgrk2ItJA/edit?usp=sharing)****\n\n\nSummary\\\nOver [1,968 entries into the sweepstakes](https://app.moondao.com/sweepstakes), resulting in nearly 40,000,000 MOONEY burned. This report will be submitted before astronaut selection is made.\n-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------\n\nOriginal Proposal:[MDP-112: Second Astronaut Reselection](https://docs.google.com/document/d/195vjQ588ZFKu_AhZFpHKFdgi6hiWln_EqkLgrk2ItJA/edit?usp=sharing)\n\n\n## Results\n\n1. **Objective: Select a new Astronaut With Blue Origin**\n\n   1. **Key Result**: Number of Bots in the selection <10%\n\n      1. **Results**: All entries have a name and email associated with them, and require a transaction cost. Of the 2,000 tickets, we can state with a high degree of confidence that there are far less than 200 (10%) that are bots – there are no obvious or apparent bots within the database right now, despite the fact that we didn’t use any real world ID verification like BrightID, etc.\n\n      2. **Learnings**: Adding a transaction cost is a very effective way to eliminate bots.\n\n      3. **Maintenance**: n/a\n\n      4. **Team’s Self-Reported Score**: 1.0\n\n      5. **Team Contributions**\\\n         **Larrotiz:** Worked with Pablo to find a design that would both prevent botting and be feasible for us to develop before the targeted time of the sweepstakes. Worked with Colin and Daniel to create the modal for submitting name and email to the database and fixed bugs along the way. Supported Daniel on creation of the database. Created the view NFTs and reverification modals for users to view and modify the registration of their NFTs. Worked extensively with Daniel on fixing issues with verification not working properly and creating redundancies to ensure user's name, wallet, and email are saved in case there is an error during the minting process.\\\n         **Pablo:** Went through a ton of designs to land on our final system for verification - originally we were going to do a manual proof of personhood meeting but after working through onboarding with Anna we figured we could get away with a more lightweight verification process. Not using real world ID verification proved to be okay since we are charging 20,000 MOONEY per entry, so botting the sweepstakes would be much more difficult especially considering how the price of botting would get increasingly more expensive. I worked with Larrotiz and Daniel on implementing the system that records just an email address and also verifies the NFT by signing a transaction. Looking at the database there are no names in there more than 50 times (except Martina, which we are fixing now). \\\n         **Ryan:** Review of the entrants in our database for verified entries containing full name, email, etc. Reached out to entrants that did not contain full names (for example first name only or nickname), also manually sent confirmation emails to entrants to let them know they’re in and double check their entries for accuracy. Those emails have a very high open rate which is also a strong signal for non-bot activity.\n\n   2. **Key Result**: Fully sell-out all 9,060 of the NFT collection\n\n      1. **Results**: 1968 entries. We modified the structure of the sweepstakes, allowing for an unlimited total number of mints at 20,000 MOONEY and 50 per person max. Since we are charging MOONEY this creates a natural limit on the number of entries since price dynamics would make it increasingly more expensive to mint more. Last sweepstakes we had a participation rate of 8,000+, however since they were free it is assumed many of those were bought and botted by a few individuals or speculators aiming to purchase and resell the NFT. Given that you cannot resell these NFTs and that you have to pay 20,000 MOONEY, the result of nearly 2,000 entries is a solid amount of participation. Crypto has a significant amount of barriers for new people, but we were able to get many new users of crypto into our community through our new onboarding system. Overall, the result of 2,000 entries is a strong outcome.\n\n      2. **Learnings**: \n\n      3. **Maintenance**:\n\n      4. **Team’s Self-Reported Score**: \n\n      5. **Team Contributions**\\\n         **Daniel:** I tried to help make the process as smooth as possible on the UI side of things by working with the designers, but I think I could have better helped anticipate the barriers that ultimately led some people to not purchase NFTs. \\\n         **Larrotiz:** Worked with Pablo on designing the ETH minting flow. Implemented and tested the ETH minting flow. Created the ETH minting verification procedure for us to register ETH mints within the rest of the database and into the Polygon contract.\\\n         **Mitchie:** \\\n         \\- Assisted through the implementation of updates to the [landing page](https://www.moondao.com/) including, content changes to highlight sweepstakes, additions such as brand partner logos for authenticity and typeface implementation, changes to metadata, and configuration of forwarding links.\\\n         &#x20;\\- Handled the manual tasks of ETH and AMOE verification, ticket minting, multisig coordination, and database entry. See [tracking sheet](https://docs.google.com/spreadsheets/d/1PU8h47xbWCMQP1fkyuBrwhhNa0QOae5lSjL6Jjyt41U/edit#gid=0).  \\\n         **Pablo:** I supported the sweepstakes minting process across promotion, design and engineering, and customer support.\n\n<!--StartFragment-->\n\nOn the design and engineering end: I helped design the initial sweepstakes minting page making decisions all the way from the smart contract to the UI, and then continued improving the process throughout the sweepstakes. I was also heavily involved with improving our onboarding process which made it much easier for people to acquire MOONEY and mint for the sweepstakes. I was involved in authouring, reviewing, or fixing / implementing over [100 bugs and features](https://docs.google.com/document/d/19ScnxapspsDmZsrrPx2h0LLrPqX-UcDZXhNCDDclvX8/edit) associated with the sweepstakes minting and onboarding process. Some highlights include: [allowing for ETH minting](https://x.com/OfficialMoonDAO/status/1742349883045269544?s=20) through a process I designed with Larrotiz, which was responsible for hundreds of mints and made the process simpler for mainnet holders, [designing the original contract for the minting process](https://docs.google.com/document/d/10AfAOG3ExvTLXaxi17bEGgpNJdAvnQU88L666qKz-1M/edit) which borrows some from the previous sweepstakes and zerog but also includes many novel features (ultimately the implementation credit goes to Larrotiz), and designing the new onboarding system which made it simpler for people to join MoonDAO who were unfamiliar with crypto.\n\nOn the promotion end: I hosted [7 AMAs](https://x.com/OfficialMoonDAO/status/1746819572014190679?s=20) for promotion of the sweepstakes reaching 1,500+ views on twitter. Personally did giveaways on my own [Twitter](https://x.com/pablo_moncada_/status/1739307620454862874?s=20) reaching 6,600+ people. Played a big role in drafting and recruiting support for our biggest reach announcement for the sweepstakes and new onboarding flow that got [41k views.](https://x.com/OfficialMoonDAO/status/1732433977728778485?s=20) Did a [livestream countdown](https://x.com/OfficialMoonDAO/status/1746002722963517795?s=20) and engaged with people in the final moments to get more mints, where we got nearly 1,000 mints in the last few hours. Personally used my entries to mint for various influencers and speakers at MoonDAO, most notably Grimes.\n\nOn the support end: I personally supported all tickets that went through <support@moondao.com> (18 individuals helped via 50+ emails), Twitter DMs (difficult to measure since there was a lot of activity there through both the MoonDAO account and also my personal one to support people), and regular Discord tickets.\n\n**Ryan:** Highly involved in both this project and onboarding app improvement, with a particular focus on reducing barriers to entry, reducing number of clicks from hearing about it to entering, reducing jargon, hiding less important or technical aspects (like buy mooney, lock, bridge, etc). Heavily involved in the marketing side, mostly rolling solo with both creation and publication of content across all platforms from launch date of Dec 15 up until the final week or so when Pablo helped out more with X. More on the marketing aspect in another key result, although the marketing is obviously correlated with this key result.****\n\n3. **Key Result**: All previous entrants who re-registered enter for free\n\n   1. **Results**: The bulk of our entries were not those re-registering for free as previous entrants, but were tickets purchased via the marketplace.\n\n   2. **Learnings**: It is not easy to reestablish contact with users on the blockchain, efforts should always be made to establish alternative means of contact (such as email) when trying to build a long-term community. \n\n   3. **Maintenance**: n/a\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions** \\\n      **Larrotiz:** Created and ran a script to find addresses that qualified as previous entrants. Developed the contract to allow a single free mint for those who were on the list of addresses. Tested the script to ensure accuracy and the contract to prevent bugs and exploits. \\\n      **Pablo:** I helped design the logic for getting the whitelist of individuals who participated in the previous sweepstakes. We took all the wallet holders that had the Ticket To Space NFT, filtered it by people who did not sell, and filtered again by people who acquired it within the range of the previous sweepstakes. The credit for the implementation of the script goes to Larrotiz.****\n\n4. **Key Result**: NFT contract for new selection generated with frontend created\n\n   1. **Results**: [Bug doc](https://docs.google.com/document/d/19ScnxapspsDmZsrrPx2h0LLrPqX-UcDZXhNCDDclvX8/edit) tracks many of those who identified problems and those who corrected problems.\n\n   2. **Learnings**: \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions**\n\n**Colin:** Assisted with the development of the nft contract and created the initial frontend\\\n**Daniel:** I created the backend with MongoDB and Next API. While it ended up working out in the end, I should have coordinated more with the other devs when connecting the backend to the frontend. My lack of communication led to more post-development work for me and other devs. Specifically, some tokens didn’t end up in the database and it caused a hassle that I could've avoided.\\\n**Larrotiz:** Developed the majority of the contract with support from Colin. Iterated through several versions as design changes were made up to the start of the sweepstakes. Created unit tests and opened them up for others to submit their tests. Deployed mumbai testnet and polygon mainnet contracts for team members to test the contract. Found and fixed several issues with the contract before the start of the sweepstakes. Assisted with the creation of the frontend and tested the minting flow extensively. Fixed several frontend bugs that were listed on the bug doc.\\\n**Pablo:** The contract itself was primarily written by Larrotiz, the frontend was primarily created by Daniel, Colin and Larrotiz. I supported by giving the original specification of requirements for the contract, coordinating closely with Larrotiz on each design feature of the onchain contract, and then in deeply testing the minting across different wallet types, fixing bugs and copy, and adding functionality like ETH minting and other copy and disclaimers to the minting page and modals when minting.\\\n**Ryan:** Testing on frontend, adding bugs to database, suggesting copy and style changes to frontend.&#x20;\n\n5. **Key Result**: New sweepstakes rules created\n\n   1. **Results**: [Rules](https://publish.obsidian.md/moondao/MoonDAO/docs/Ticket+to+Space+NFT/Ticket+to+Space+Sweepstakes+Rules)\n\n   2. **Learnings**: Working with lawyers is always a pain, but we were able to gather together a set of coherent rules. Must be careful using Obsidian too because there was an issue where some of the info like dates got synced to a previous version.\n\n   3. **Maintenance**: n/a\n\n   4. **Team’s Self-Reported Score**: 0.9\n\n   5. **Team Contributions**\\\n      **Mitchie:** Published the new rules to our official docs\\\n      **Pablo:** I was the primary point of contact with the lawyers and worked closely with them to draft the first draft of the sweepstakes rules and provided feedback over 130 emails back and forth from initial spec, negotiating price, handling the payment, and then asking questions and iterating on the sweepstakes. I also then transferred the new documents into our documentation, there was a brief issue with Obsidian reverting back to an old version of the rules. I also created the PO box to receive the AMOE entries, which was more complicated than we had imagined, and had 5 trips to the post office to correct certain issues around it.\n\n**Ryan:** Multiple rounds of initial edits, read throughs, and comments, working with Pablo to coordinate the details, find errors, mistakes, etc. [See original doc comment history for full details](https://docs.google.com/document/d/1eq0EdQ9a5hvRKsESdwmA7dlSAiZOKg54/edit?pli=1).****\n\n6. **Key Result**: Unified marketing and communications, translated to other languages\n\n   1. **Results**: Unified marketing and comms across newsletter, website, social media including X, IG, [TikTok](https://www.tiktok.com/@moondao_official) (newly created). Translation was not prioritized or performed within this project, but some elements may have been translated by other projects such as CN translation or PT-BR.\n\n   2. **Learnings**: Launching around the holiday season is not advisable. Statistically across all fronts we had a huge lull in engagement, traffic, and interest, particularly between Christmas and New Years despite regularly posting updates, so the general buzz we slowly built from mid November to public launch on Dec 15 was quickly lost and needed to be built back up after the New Year for final two weeks.\n\n   3. **Maintenance**: n/a\n\n   4. **Team’s Self-Reported Score**: 0.75\n\n   5. **Team Contributions**\n\n**Colin:**  Created a [promo video](https://www.instagram.com/p/C1vIWbsN6-c/)\\\n**Daniel:** I made some posts on [reddit](https://www.reddit.com/r/BlueOrigin/comments/18j4i6c/comment/kdhxwn3/) and publicized on twitter.\\\n**Mitchie:** Assisted through blog post publication ([post1](https://www.moondao.com/post/ticket-to-space-sweepstakes) and [post2](https://www.moondao.com/post/ticket-to-space-nft-sweepstakes)), [meme creation](https://discord.com/channels/914720248140279868/914969673785823312/1173711870897696849)\\\n**Pablo:** (Repeated from minting result because I think these are very intertwined): On the promotion end: I hosted [7 AMAs](https://x.com/OfficialMoonDAO/status/1746819572014190679?s=20) for promotion of the sweepstakes reaching 1,500+ views on twitter and will provide content for MoonDAO going forward on YouTube that we can repurpose as shorts etc... Personally did giveaways on my own [Twitter](https://x.com/pablo_moncada_/status/1739307620454862874?s=20) reaching 6,600+ people. Played a big role in drafting and recruiting support for our biggest reach announcement for the sweepstakes and new onboarding flow that got [41k views.](https://x.com/OfficialMoonDAO/status/1732433977728778485?s=20) Did a [livestream countdown](https://x.com/OfficialMoonDAO/status/1746002722963517795?s=20) and engaged with people in the final moments to get more mints, where we got nearly 1,000 mints in the last few hours. Personally used my entries to mint for various influencers and speakers at MoonDAO, most notably Grimes.\\\n**Ryan:** Created and posted the vast majority of all comms (Pablo helped with X during last week) across our many channels, as well as the creation of texts and threads, numerous image and video supporting graphics (some created by Elijah), [image memes](https://discord.com/channels/914720248140279868/914969673785823312/1189370860797181963), [video memes](https://discord.com/channels/914720248140279868/914969673785823312/1192211874582909098) (many of which were posted and can still be seen/verified on socials, some creation help from Anna and Colin), wrote majority of X posts (excluding some coordination on the two major announcement threads with Pablo and Elijah for app launch and sweepstakes announcements). MoonDAO X posts generated nearly +400,000 impressions on that platform alone with improved reach and engagement compared to previous levels.\n\n![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfJAxiFnucmwMito0UH82q-CXUew1Z85ssgn-dPyn5nAymB1fny5Es9f61yrkHjiBYceY2xMvDuQ31Ahii-WAReL_5Zwq0115lPvYgvnn8oLW_gE7XJXiCcSXyhHbepJ9OGB_BfJgcF3QTf5mgbnusQVKgH?key=iO5tUpn0e0c43KfdoqewdA)\n\n![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfPzNo3tgiT1-_PimgKAGBNnPBury2NzSAxkuJF6rHBruIJreO9kAFAah-OYhLf2qSyrKwNGZ5FrymYU4cYbQklYt4Krit3QRdOsjIST4_ac4-gzVc98_aYnrMvjYYPRLFnx9Dpct5WMfHh2nR4ODkryC0C?key=iO5tUpn0e0c43KfdoqewdA)\n\nAlso posted on IG with 100+ stories, reels and posts, with increases in engagement, reach, and followers.\n\n![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXcRrxRA_Mlf8TlCAxFGfSHh4V1LrxXkNPWOoJKRheQkfRYvdtDm34oJEzQTjRknigKFWr0FZNTPbzt6-x-nblJWjuRpZQ5eaXEkbc8Rk2OjSh93VwxSP-A0rolcqr6yNv_JkHjmLajSQXuBUd5l_4eeXL9r?key=iO5tUpn0e0c43KfdoqewdA)\n\nWrote [this blog post announcement](https://www.moondao.com/post/ticket-to-space-nft-sweepstakes), a few hype/trailer video creations in Premiere Pro [such as this](https://youtu.be/ib4khUXCxB0), wrote all of the mentions in our [Mooney Monday email updates (archive can be seen here)](https://moondao.ck.page/profile) and most of the email sequences for sweepstakes which was a 5x email autoresponder ([here’s draft of primary follow up email](https://docs.google.com/document/d/1ZHxK1q6MWtHXW0Ep7XqvKszHRgbHLmecb3t9CfiOSUY/edit?usp=sharing) written by me, but full sequence not publicly viewable although most project members should have received all five emails themselves, with some elements drafted by Elijah), as well as regular snippet promotions in all sequences and broadcast emails from \\~Oct to Jan. All comms and marketing at top of the funnel was leading people back to the MoonDAO website (incl. Mission Control analytics was something I pushed as a mus-add within onboarding project), which saw a massive increase in traffic with 15k users over that three month period:\n\n![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXens7XaFXERCqSgsFEkfN2snphkx_Er-Wdd9lIcAoONKhsr_zunUtJmnjT0ssBCIWoUaw74PKk5w_Ta_swMmEmAyX_vF0lA-EqYFKIvG9SJY7d65sKIneh3lfrCgHXjWbZCPaxQreqg2YW_4SnIbGsBvES7?key=iO5tUpn0e0c43KfdoqewdA)\n\n_(shows daily visitors, along with weekly and monthly on rolling averages)_\n\nHere you can see traffic sources for moondao.com, and further insights:\n\n![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXezfbYuQdlp7Y6YdLLxecpwf27MujLxkjtkCSbycxcIqihT0p9NGyl9_Fu63G8c9T62dyHqjY91KNQNTNdsSdS1Q2BYWH4QP0YUjl0Ec4lP5lT2y-vO5ExFifS1VD1GJztq-TpXrUgbp6E-F0Ejnhuz3iIl?key=iO5tUpn0e0c43KfdoqewdA)\n\nAfter direct traffic, YouTube was our top referral (mostly still Dude Perfect traffic), followed by the ConvertKit email list, Google organic search, Twitter (t.co), and then Instagram (which surprisingly generated 64% of Twitter’s total clicks with only 5% of the follower count). Direct, ConvertKit and Google Organic are our highest average engagement time (a good sign, vs quickly bouncing).\n\nHandled outreach, booking, and coordination for MoonDAO Live AMA guests and was responsible for booking at least five of the [7 guests](https://x.com/OfficialMoonDAO/status/1746819572014190679?s=20), including three of the biggest name guests which had higher listenership (Zubrin, Metzger, and Hague), with some booked by Pablo (Rick Tumlinson, Michael from Blue) all of which provide interesting content to repurpose for YouTube (and sometimes get more more traction there than on X, [such as Zubrin interview](https://www.youtube.com/watch?v=_706XEfrWIo)) and prepping the bios, talking points, questions and other pertinent info in docs for all guests for Pablo’s use during the call ([example from Zubrin call](https://docs.google.com/document/d/1gtQyf1kOw7hlvUbEk-CRyXmHWsZ1HJ3h2joc0vX7LPI/edit?usp=sharing)), lots of copy and flow suggestions and edits for both landing page and app in multiple iterations, coordinating with Sara at Blue Origin regarding comms approvals for blog posts and announcements. \n\nOutreach to web3 investors (with Anna’s help), space influencers, although response rate was low, we did have some [hits with videos like this](https://www.instagram.com/reel/CzmwghpthjD/?igsh=ZjYzZmltbTQ5c3oz), but in the end there was really no compelling incentive to share the sweepstakes, in fact people were disincentivized to share if they hoped to win because their odds are better by keeping it secret and ensuring a lower participation rate (we had numerous influencers participating, but very few willing to share it, or sharing the bare minimum), something we were not able to overcome due to the structure of the campaign and decisions made at other levels of the project. Coordinated the implementation and promotion of the waitlist and referral program (setting up the systems inside of SparkLoop, such as the [Referral Hub](https://referralhub.page/94268bcbe2) and internal functions and references in ConvertKit): with over 2,300 new people joining the waitlist with 858 coming from referrals (36%) despite us neutering the referral program just before launch, but we still had some unaffiliated people helping us market and spread the word about MoonDAO, plus we retain those referred people on our list too, who are hopefully very value aligned and space interested.\n\n![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXdFOypY-2aXS42i6nhwOCYcPdw3h5gCbvvPJIugWVxrQviknr1iNiwaIUj1U0uuXaewpnJM03p-3d8iPqTZIhSYDmPUjutva69cH3g_veZS5h7jgIN22kblV_SC6YgaEtCC28WY5vVfYbKIHpP42TUFLraX?key=iO5tUpn0e0c43KfdoqewdA)![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXesG-82RTBOVWenHhWxllC2FowXwpx2EMDZFe-ucz-CVj6S4a_mirSRZmUq7K5ki6JFvW_2kRyo_ejBpZfS3eLOwQuQSAuvS5yDViCBsgybwWDtJemaQSzHoRQLKMLfSRIUteJ5Gtzy2XFhd_LowEEcT2Vd?key=iO5tUpn0e0c43KfdoqewdA) \n\nIdea for final day livestream countdown to help create fomo, helping Pablo create and manage the space within Streamyard, adding content like ticker text, text overlay, graphic countdown, two short video uploads for use, troubleshooting, and engaging with users until about 11pm local time on final night including IG and Discord when we saw the largest volume of ticket sales.****\n\n7. **Key Result**: Smooth onboarding through a web application created\n\n   1. **Results**: [Bug doc](https://docs.google.com/document/d/19ScnxapspsDmZsrrPx2h0LLrPqX-UcDZXhNCDDclvX8/edit) tracks many of those who identified problems and those who corrected problems.\n\n   2. **Learnings**: \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions**\n\n**Colin:** Tested the app, fixed bugs and added features.\\\n**Daniel:** I fixed bugs and added features\\\n**Larrotiz:** Fixed several bugs in the onboarding flow. Overhauled the design of the welcome page with Pablo.\\\n**Pablo:** These results are mostly tracked in the onboarding project. I was heavily involved in this process of easing onboarding and it was a massive contributing factor to the ability for people to enter the sweepstakes.\\\n**Ryan:** Provided high level feedback about the overall sweepstakes entry flow particularly for non-web3 users, and did deep dives for bugs, typos, and correcting other errors or issues. Left my contributions in the onboarding app report.****\n\n8. **Key Result**: ~~Onboarding operator online twice per day to verify members on a call~~\n\n   1. **Results**: This key result was omitted in response to developments that rendered it redundant****\n\n9. **Key Result**: ~~One valid member is ultimately selected to fly with Blue Origin~~\n\n   1. **Results**: Selection happening January 25th. This result will be rolled into the sweepstakes extension project.\n\n\n## Coordinape Results\n\n[**Link to the Coordinape**](https://app.coordinape.com/circles/30110/give#)\n\n|                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| Pablo           | 20.6                   | None                |\n| Ryan            | 15.4                   | None                |\n| Mitchie         | 13.4                   | None                |\n| Colin           | 17                     | None                |\n| Larrotiz        | 14.8                   | 9,000 DAI           |\n| Elijah          | 2                      | 9,000 DAI           |\n| Daniel          | 15.2                   | 9,000 DAI           |\n| Gavin           | 1.4                    | 7,291.45718 DAI     |\n| Coordinape      | 0.2                    | None                |\n\n\n## Treasury Transparency\n\nLink to Treasury with unused funds returned to the main DAO Treasury.\n\n<https://app.safe.global/home?safe=eth:0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba>\n\n|               |                                                                                                                                                             |                               |                                                                   |                                                                                                                                                                                                                                          |                                                                                                                                                                                                                    |\n| ------------- | ----------------------------------------------------------------------------------------------------------------------------------------------------------- | ----------------------------- | ----------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------ |\n| **Txn Title** | **Reason**                                                                                                                                                  | **Amount**                    | **Recipient**                                                     | **Etherscan Link or Gnosis Link**                                                                                                                                                                                                        | **Deliverable**                                                                                                                                                                                                    |\n| Safe creation | Safe creation                                                                                                                                               | N/A                           | N/A                                                               | [Safe creation](https://etherscan.io/tx/0xcb98ece6b34fa236856bbcfdb81bfb816c4d420d88c2850a8b710c5b45818c86)                                                                                                                              | Multisig created                                                                                                                                                                                                   |\n| 0             | Swap to DAI for stability                                                                                                                                   | 60,871.675622462390721499 DAI | N/A                                                               | [Swap to DAI](https://app.safe.global/transactions/tx?safe=eth:0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba\\&id=multisig_0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba_0x8f86bdff4de1806b20b494be2064ae1964f6ad6e029ecc738940e98dd69215e1)    | Swapped tokens to stables for security                                                                                                                                                                             |\n| 1             | Sent payment Pablo to cover legal fees in fiat currency                                                                                                     | 10,000 DAI                    | Lawyers via Pablo                                                 | [Pay to lawyers](https://etherscan.io/address/0x679d87D8640e66778c3419D164998E720D7495f6)                                                                                                                                                | Handling of all legal oversight                                                                                                                                                                                    |\n| 2             | Sent additional fund to cover oversight in previous payment                                                                                                 | 826 DAI                       | Lawyers via Pablo                                                 | [Pay to lawyers](https://app.safe.global/transactions/tx?safe=eth:0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba\\&id=multisig_0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba_0x52e634a5151e4dd5c791e0ecc976c514bf665f4fce50785adadfefd3df24ff94) | Handling of all legal oversight                                                                                                                                                                                    |\n| 3             | Rejection                                                                                                                                                   | N/A                           | N/A                                                               | [Rejection](https://etherscan.io/tx/0x7b99ccf04029f3b0f95acee68eb000a7ad1f9a673bf4797c1c06f6e9c94b2560)                                                                                                                                  | N/A                                                                                                                                                                                                                |\n| 4             | Rejection                                                                                                                                                   | N/A                           | N/A                                                               | [Rejection](https://etherscan.io/tx/0xc6f0bcd419f59d2b82c87b72a8745745d9939a426da7990375097cef7a8babaf)                                                                                                                                  | N/A                                                                                                                                                                                                                |\n| 5             | Streaming payments set up for team members, including some members of the onboarding improvement project as a result of inter-project budgetary adjustments | 47,291.46 DAI                 | In order of batch sequence: Gavin Elijah AnnaLarrotiz DanielEliot | [Team Payments](https://app.safe.global/transactions/tx?safe=eth:0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba\\&id=multisig_0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba_0x04f6e352123c36b4b0991ff95516dd3e76999e0cfd46bc08a12e7e9ac47d3491)  | All team members paid with [one stream being turned off preemptively](https://etherscan.io/address/0x33591DE6A57086f5997188955A0026Efb44118A5) due to absence                                                      |\n| 6             | Stream rug pull                                                                                                                                             | N/A                           | N/A                                                               | [Stream Rug Pull](https://etherscan.io/tx/0x912af508c2b880e1929c48b34f7ee3f8f2e46313117c068fd7f7777a945f322b)                                                                                                                            | Stopped stream for member due to project abandonment                                                                                                                                                               |\n| 7             | Adjustment to team payments with additional stream                                                                                                          | 5,000 DAI                     | Daniel                                                            | [Team Payment](https://app.safe.global/transactions/tx?safe=eth:0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba\\&id=multisig_0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba_0xa03779a126fe1447ce0b3d57c85b38b04c562af3090055f4790dc4c96b5ad964)   | Additional stream setup to adjust for initial oversight                                                                                                                                                            |\n| 8             | Payment made for 1 full year of [Privy developer tier](https://www.privy.io/pricing)                                                                        | 1,188 DAI                     | Mitchie                                                           | [Reimbursement](https://app.safe.global/transactions/tx?safe=eth:0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba\\&id=multisig_0x59Ae8A0a6f20C918d2558B5624e25BABbD659Bba_0xab86db49b21b6b961555eb9834365e0e521496039eb737d52583964473e0682c)  | Reimbursement to Mitchie who handled the payment in USDC on polygon to reduce gas fees (see the [transaction hash](https://polygonscan.com/tx/0xb61fc22ca9b3e46c83e13bde664def21f541cd687bc6888e3b4b0c6b2d117be3)) |\n| 9             | Gas fee reimbursement                                                                                                                                       | 449.784031612 DAI             | In order of batch sequence: Mitchie Ariel Colin Pablo             | [Gas fee reimbursement](https://etherscan.io/tx/0x7828eb8d7db00e9a3f0ac4d56ca57013e2201e94bf7a771966e4dee22a945066)                                                                                                                      | Reimbursement                                                                                                                                                                                                      |\n| 10            | Reimbursement                                                                                                                                               | 1,116.434414924464795574 DAI  | Main Treasury                                                     | [Main Treasury Reimbursement](https://etherscan.io/tx/0xab14f88ffe843e5b350c4a481d92bd8f31ee77e20c0cf2d7e43e5f2ab173b95c)                                                                                                                | Reimbursement                                                                                                                                                                                                      |\n",
  "contributors": "[{\"Contributor\":\"Mitchie\",\"Payout Address\":\"0x3d1F623BEedc1bdAaeA4E7F968B44e6262eaCcAd\",\"Voting Address\":\"0x3d1F623BEedc1bdAaeA4E7F968B44e6262eaCcAd\",\"Eth\":0.638,\"Mooney\":318882,\"Dai\":0},{\"Contributor\":\"Coordinape\",\"Payout Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Voting Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Eth\":0.010,\"Mooney\":4759,\"Dai\":0},{\"Contributor\":\"Ryan\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Eth\":0.681,\"Mooney\":353497,\"Dai\":0},{\"Contributor\":\"Pablo\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Eth\":0.848,\"Mooney\":456899,\"Dai\":0},{\"Contributor\":\"Colin\",\"Payout Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Voting Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Eth\":0.000,\"Mooney\":375066,\"Dai\":0},{\"Contributor\":\"Larrotiz\",\"Payout Address\":\"0x5640Ddc028f2436B5C0BA0305D2199556C1b5a95\",\"Voting Address\":\"0x5640Ddc028f2436B5C0BA0305D2199556C1b5a95\",\"Eth\":3.862,\"Mooney\":352076,\"Dai\":0},{\"Contributor\":\"Elijah\",\"Payout Address\":\"0x66CD14267fb5a1609496CdC37eB55E6FE3f59C75\",\"Voting Address\":\"0x66CD14267fb5a1609496CdC37eB55E6FE3f59C75\",\"Eth\":3.862,\"Mooney\":47594,\"Dai\":0},{\"Contributor\":\"Gavin\",\"Payout Address\":\"0xeEA7d0FFc09997B8b0cC59C9BBC93cdEd33c14e4\",\"Voting Address\":\"0xeEA7d0FFc09997B8b0cC59C9BBC93cdEd33c14e4\",\"Eth\":3.129,\"Mooney\":0,\"Dai\":0},{\"Contributor\":\"Luffy\",\"Payout Address\":\"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\",\"Voting Address\":\"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\",\"Eth\":0.097,\"Mooney\":48379,\"Dai\":0},{\"Contributor\":\"Phil\",\"Payout Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Voting Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Eth\":0.048,\"Mooney\":24190,\"Dai\":0},{\"Contributor\":\"Daniel\",\"Payout Address\":\"0x1B7D7d183Bd233af690DDB33cE818f41995118a9\",\"Voting Address\":\"0x1B7D7d183Bd233af690DDB33cE818f41995118a9\",\"Eth\":0.000,\"Mooney\":361717,\"Dai\":0}]"
}
