{
  "body": "# **Microblog Project Summary**\n\n**Summary**\n\nThe core objective, to implement a dynamically integrated micro-blog framework, was achieved successfully (and stylishly!), however the anticipated impact on the motivating factors of growth and engagement have yet to be fully realized. Initial attempts to develop blog content struggled to define its real purpose and audience, and delays in development meant that the blog went live just as Ryan’s newsletter project ended, meaning the content it was originally inspired to facilitate was no longer in production.\\\n\\\nDespite these initial challenges, the blog has found purpose in highlighting the key milestones of the ZeroG project. While the blog isn’t directly profitable, it’s anticipated that it will serve well as a promotional asset for the profitable partnerships and projects that will arise from the MoonDAO B2B initiative. It’s also expected that, as we trend towards more automated content development, the blog will serve a more pivotal role in community awareness and engagement.\\\n[MoonDAO Proposal: MDP-75: MoonDAO Micro Blog****](https://snapshot.org/#/tomoondao.eth/proposal/0x8bd57a9055ecd04829e4daf3849d74131afbcbbe1c263450ef62b74bf0ab94ca)**Results**1) **Objective**: Design and implement blog infrastructure on the website\n\n   1. **Key Result**: Blog exists and is tested, operational, and functions as described\n\n      1. **Member(s)**: Mitchie\n\n      2. **Results**:\\\n         <https://moondao.com/> (Scroll near bottom of the page)\\\n         So far the blog has served to highlight key milestones in the ZeroG project and has high potential to promote other campaigns as well. [This post](https://www.moondao.com/post/meet-our-zerog-winners) highlighting the contest winners is a great demonstration of the value of the dynamic structure that was implemented, allowing for individual profiling of each winner with links to their socials. \n\n      3. **Learnings:** Content development, even while using ChatGPT as a tool, can still have high time overhead costs associated with manual handling of prompt injection, research, editing, and publishing. The challenges faced by this project motivated deep research and development into API implementation of LLMs and automated systems design for content development. The products of these developments, as originally disclaimed, will be considered in a separate proposal.\n\n      4. **Maintenance**:\\\n         Overview of the dynamically integrated framework for reference:[MoonDAO Blog Architecture Outline.pdf](https://drive.google.com/open?id=1WE1cesB5aDCDsBbOhTOldsW6_29Ac5aE)\n\n      5. **Team’s Self-reported Score: .8**\n-------------------------------------------\n\n# **Team Member Contributions**\n\n### **Mitchie @mitchie\\_mitch**\n\n## 1. **Objective: Design and implement blog infrastructure on the website**\n\n   1. **Key Result**: Blog exists and is tested, operational, and functions as described.\n\n      1. **Specific Contribution**: Design (UX and UI) and implementation\n\n      2. **Impact:** The blog is live and operational\n\n      3. **Complexity:** Implementation required an advanced understanding of Webflow’s builder, CMS, and the use of custom javascript.****\n\n   2. **Key Result**: Keep the aesthetics on-brand\n\n      1. **Specific Contribution**: Graphic/web design \n\n      2. **Impact:** The blog styling meshes nicely with the overall aesthetic. \n\n      3. **Complexity:** 8+ years of full-time graphic/web design experience****\n\n   3. **Key Result**: Integrate posts feed into the MoonDAO homepage\n\n      1. **Specific Contribution**: Integrated MoonDAO News feed \n\n      2. **Impact:** The most important on-goings at MoonDAO can now be highlighted on the homepage, increasing visibility for our projects.\n\n      3. **Complexity:** Advanced understanding of post types (aka.collections) garnered from years of experience with wordpress and webflow.****\n\n   4. **Key Result**: Make sure the design is mobile-responsive and accessible\n\n      1. **Specific Contribution**: Mobile accessibility\n\n      2. **Impact:** The content is accessible and responsive across all device sizes and all the spaces inbetween.\n\n      3. **Complexity:** Appropriating design elements to behave responsively in while maintaining the aesthetic quality and accessibility of content often requires high-level planning and creative solutioning.\n\n### **Ryan @ryand2d**\n\n## Disclaimer: Ryan’s OKRs remained unaddressed, as the microblog project failed to successfully integrate with the newsletter content due to delays in development.2) **Objective**: **Post content on a weekly basis**\n\n   1. **Key Result**: Post senate meeting minutes, town hall notes, and Mooney Monday content on a regular basis\n\n      1. **Specific Contribution**: \n\n      2. **Impact:** \n\n      3. **Complexity:**\n\n   2. **Key Result**: Run SEO audits to ensure things are optimized for search and organic reach\n\n      1. **Specific Contribution**: \n\n      2. **Impact:** \n\n      3. **Complexity:**\n\n   3. **Key Result**: Coordinating posts/pages for other initiatives such as ZeroG and Lifeship\n\n      1. **Specific Contribution**: \n\n      2. **Impact:** \n\n      3. **Complexity:** \n\n# **Coordinape Results**\n\n## |                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| @mitchie#0272   | 100                    | 0 DAI, 0 MOONEY     |\n| @ryand2d#0103   | 0                      | 0 DAI, 0 MOONEY     |**Project Wrap Up Checklist*** [ ] Added Project Final Report onto the Website Dashboard",
  "contributors": "[{\"Contributor\": \"Mitchie\", \"Payout Address\": \"0x886002B1F355344feFd7df5F9e566E9402C2cF8c\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"554,711\", \"Dai\": \"1,151.06\"}]"
}
