{
  "body": "# **Project Final Report: MoonDAO Donation for Gitcoin Grants V2**\n\n# **Summary**\n\n# [Proposal](https://docs.google.com/document/d/1plVlUEf_L2T4cvSMnlChrq0CjKvVy6d97YhRQblAbMo/edit)With MoonDAO we spearheaded the way for the Decentralized Science Round to happen after Gitcoins community voted against DeSci as a Core Round. This was the very first community-driven Featured Round with a focus on Decentralized Science. An unprecedented case. We supported 65 DeSci projects with 85.000 USD in total matching pool from previous DeSci Sponsors, GreenPill China and MoonDAO. We positioned MoonDAO as an emerging leader in DeSci and the Decentralized Space ecosystem while being one of the early adopters of Grants Stack and Allo Protocol. With funding public goods in science we’re the first research-focused DAO with an tangible impact on the Space industry. With first touchpoints to web3 foundations we spread the word about MoonDAO and our mission. We had a multi round impact with representations in Climate Round, Open Source Software and Metacrisis. We engaged with companies like [@SpaceChain](https://twitter.com/SpaceChain),[ @CopernicSpace](https://twitter.com/CopernicSpace),[ @lunargistics](https://twitter.com/lunargistics), and[ @DeSciWorld](https://twitter.com/DeSciWorld). Finally, web3 companies like [Binance](https://twitter.com/OfficialMoonDAO/status/1639487272042020864?s=20) and [Messari](https://twitter.com/OfficialMoonDAO/status/1633560496531185665?s=20) recognized MoonDAO as one of the leaders in Decentralized Science. We secured a unique positioning with the success of this project. We now have direct access to the Decentralized Science Ecosystem while utilizing proven frameworks and tools enabling MoonDAO to engage with traditional academic communities.\n\n# **Results**\n\n#\n\n## **Objective**: **Gitcoin Community (DeSci Grantees + Shoutouts + Partnerships)**\n\n# 1.**Key Result**: _make the investigation for DeSci and DeSpace Grants opportunities_1. **Member(s)**: Manuel\n\n2. **Results**:-[Blockchain Grants](https://docs.google.com/spreadsheets/d/1gYakBVAjnzFprojmto-Lg-NbSM59GhaCylRaNwCXXoc/edit#gid=429797019)3. **Learnings:** First campaign started to get in touch with Web3 Foundations via standard emails. No results. Next time focus on decision makers while redefining the value proposition.\n\n4. **Maintenance**: Follow-up with MoonDAO B2B\n\n5. **Team’s Self-Reported Score: 0.3****Key Result**: _Find and finalize a fit Donation Round for MoonDAO._1. **Member(s)**: Manuel, Ballack, Lucas\n\n2. **Results**: -[DeSci Round](https://explorer.gitcoin.co/#/round/1/0x6e8dc2e623204d61b0e59e668702654ae336c9f7)_-_[_MoonDAO DeSci Project Safe_](https://etherscan.io/address/0xb78C2C6ba3541E96447A27e0C7889d6798a6Be4C)_-_[_DeSci Stewards Safe_](https://etherscan.io/address/0x1385754798D1F2C3a5eaa45c32999E57317D6BFD)3. **Learnings:** Really good coordination while transferring the funds from MoonDAO treasury to our project multisig, then swapping ETH for DAI. Then we transferred the funds from project multisig to DeSci Round operators multisig.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 1****Key Result**: _Confirm and sign the contract with Gitcoin_1. **Member(s)**: Manuel\n\n2. **Results**:[-Gitcoin X MoonDAO Proposal](https://docs.google.com/document/d/1DuEgNO_F5PegFnnFLpMcg68PlmcBZD-7P9rHcFa81ps/edit)3. **Learnings:** No contract signed. Partnership/ Proposal flow is needed. Boris (DeSci lead at Gitcoin) suggested to approach Gitcoin again after this DeSci Round for official partnership discussions.\n\n4. **Maintenance**: none\n\n5. **Team’s Self-Reported Score: 0****Key Result**: _Follow-up with Grantees_1. **Member(s)**: Manuel, Rod\n\n2. **Results**:_-_[_Follow-Up_](https://docs.google.com/spreadsheets/d/15HbT433GOUJ6-z7zdwOjhz340BkYfUkquI-tatw6deo/edit?usp=sharing)3. **Learnings:** MoonDAO Value proposition and a straightforward partnership framework would significantly help. Rod was engaged in different Gitcoin Rounds marketing Lunco and MoonDAO while spreading the word of DeSpace and getting in touch with projects. Manuel designed and executed twitter campaigns to follow up with grantees, get them into interviews and explore opportunities for collaboration and feedback. The progress is tracked in the sheet. The different stages are described as follows: Awareness-Initial Outreach, Evaluation-First discovery call, Engagement-Follow-Up, Closing-ready for Partnership Proposal.4. **Maintenance**: Still Ongoing\n\n5. **Team’s Self-reported Score:****0.6 by Rod****0.9 by Manu**\n\n## **Objective**: **_Co-marketing with Gitcoin_**\n\n# 2.**Key Result**: _Announcement and AMA with Gitcoin_1. **Member(s)**: Lucas, Ryan, Rod, Ballack, Pablo, Manu\n\n2. **Results**:[-DeSci Anouncement with Gitcoin](https://twitter.com/OfficialMoonDAO/status/1646690371991396352?s=20)3. **Learnings:** PR/ Communication and Social media management and moderation is essential for AMA announcements execution. Lucas, Ryan and Pablo managed hosting for events on Twitter while Manu supported with moderation. Ballack created more awareness around these events through talks with GreenPill China. Rod asked questions and engaged the audiences.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0.8****Key Result**: _Gitcoin may have Podcast with partners_1. **Member(s)**: Rod, Lucas, Ryan, Ballack, Pablo, Manu\n\n2. **Results**: [-Owocki, Gitcoin Co-founder AMA](https://twitter.com/OfficialMoonDAO/status/1649779149329006592?s=20)3. **Learnings:** Rod and Manu were in touch with Kevin Owocki. Manu pitched this opportunity in Denver while Rod made the introduction into MoonDAO and finalized the AMA. Pablo hosted the event and did moderation while asking questions.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0.8****Key Result**: _Marketing Plan_1. **Member(s)**: Rod, Lucas, Ryan, Ballack, Pablo, Manu\n\n2. **Results**:[_-Co-Marketing Overview & Social Media planning_](https://docs.google.com/spreadsheets/d/1fpoj5ONBy6KVAJSIlJnMo_7Q8tL97gWXcuoWJwz52Mw/edit#gid=0)-[Friday’s TW spaces, Gitcoin made a post, Shoutouts during the event](https://moondso.notion.site/Event-Overview-34cedff5b2e1458193cc43574ec1c8dd)_-_[_Gitcoin Radio_](https://docs.google.com/spreadsheets/d/1je5IyEJ9zLzdnW6P9FdX7nXGciCV_tT83N-y2zCyBnk/edit#gid=0)[_-Space Sustainability events with Cosmos4Humanity & Deepventure_](https://docs.google.com/spreadsheets/d/13HalOrcP3BrQVK0c2ivSOh0II-jaEE4JU_ZAk-Ckqxs/edit#gid=213035062)_-Professional Network Activation (182 experts in Web3, VC, ReFi, DeSci, DeSpace)_3. **Learnings:** We designed a social media strategy all together. Lucas and Ballack mainly handled the posting. Rod and Manu engaged in different ecosystems and Rounds with organizing events. Rod and Manu were involved in Solarpunk Guild’s Gitcoin Radio and a bunch of Gitcoin Beta Twitter Spaces to schill our projects and represent MoonDAO. Additionally, we organized DeSpace Fridays side-events with different partners like Cosmos4Humanity. The main cornerstone event were with DeSci.World with a focus on mentoring grantees and feedback sessions. The DeSpace cornerstone event highlights were guests from Copernic Space, Lunargistics, SpaceRoxDAO and SpaceChain and many more. Manu activated his personal network in DeSci, ReFi and DeSpace for co-marketing purposes with announcements on Telegram channels.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0.8****Key Result**: _Social Media Strategy_1. **Member(s)**: Rod, Lucas, Ballack, Pablo, Manu\n\n2. **Results**: [_-Social Media Strategy_](https://docs.google.com/document/d/1HIxrpx2yk0v3I7VEvQbGnh7ScM1AkcKzIqjaC4tEEXg/edit)3. **Learnings:** This was our basic social media strategy. We could have more preparation beforehand and considered that the MoonDAO followers are not highly engaged right now. Threads engaging with grantees and Spaces with high enjagement accounts work well.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0.5****Key Result**: _Referral Campaign_1. **Member(s)**: Lucas\n\n2. **Results**: 18 people on zealy, 3 winners, a lot of low quality submissions._-_[_Zealy Campaign_](https://zealy.io/c/moondaogitcoin/invite/8kVXA90nScAFHOuElV9Gh)3. **Learnings:** Its really hard to configure zealy in a way that it keeps the bad actors away, people in general submit really low quality entries and dont even touch the more complex/interesting quests. With more preparation time it would problably have a better outcome, even pumpung the numbers a little, it's low quality engagement most of the time. We also had problems to configure the platform.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0,8**\n\n## **Objective**: **Partnerships (Sponsors, Round Managers)**\n\n# 3.**Key Result**: _Partnerships Agreement_1. **Member(s)**: Manuel\n\n2. **Results**: [-Potential Partnerships](https://docs.google.com/spreadsheets/d/1hvotVWshGkSsqoCg41PcXlJUDubkVAihPQ7WdgRQGK8/edit#gid=511102654)3. **Learnings:** Manu designed and executed Twitter campaigns to get folks from the DeSci, ReFi and DeSpace ecosystems into interviews. The progress is tracked in the sheets. The different stages are described as follows: Awareness-Initial Outreach, Evaluation-First discovery call, Engagement-Follow-Up, Closing-ready for Partnership Proposal.\n\n4. **Maintenance**: Ongoing\n\n5. **Team’s Self-Reported Score: 0.6****Key Result**: _Connect with Gitcoin Operations Team_1. **Member(s)**: Manuel, Rod\n\n2. **Results**:Manu joined GR-OG : Grant Round Operators Guild.Rod connected with Gitcoin Operation Leads via Twitter Spaces and built relations.3. **Learnings:** Manu joined GR-OG : Grant Round Operators Guild on Telegram for further Gitcoin community leader communications and engagement.\n\n4. **Maintenance**: Ongoing\n\n5. **Team’s Self-Reported Score: 0.7****Key Result**: _Gitcoin ask for partners_1. **Member(s)**: Manuel\n\n2. **Results**:[-Past Gitcoin Partners](https://docs.google.com/spreadsheets/d/1qIgCcqEg23rHZEM5iQK5v7kbuFPUw9w7wEWy5jDLh6Y/edit#gid=0)3. **Learnings:** Sadly, we still need to get introductions to previous Gitcoin sponsor. We requested warm intros several times without success. So, we can continue with this after official Gitcoin partnership proposal passed. The positive thing is we secured 50.000 USD additional matching pool funding from previous Gitcoin DeSci sponsors.\n\n4. **Maintenance**: Ongoing\n\n5. **Team’s Self-Reported Score: 0.2****Key Result**: _GitcoinDAO Engagement_1. **Member(s)**: Manuel, Rod, Lucasart\n\n2. **Results**: Posts and threads tagging Gitcoin, 50+ interactions with the Gitcoin socials through the MoonDAO account. We also engaged with different Gitcoin DAO members on Twitter Spaces.Gitcoin DAO is also talking about creating a DeSci sub-DAO as a result of this Featured Round because mainly Boris (Gitcoin’s DeSci lead) and Manu brought the topic of a research guild up.3) **Learnings:** The twitter spaces brought some interesting results, but Gitcoin was more focused on the main rounds, next time can be good to plan and set expectation ahead of time.\n\n4) **Maintenance**: None\n\n5) **Team’s Self-reported Score: 0.6**4. **Objective**: **Positioning MoonDAO as a global leader in DeSci & DeSpace****Key Result**: _Next steps for DeSpace Grant Stack_1. **Member(s)**: Manu, Lucasart, Rod\n\n2. **Results**: [-DeSpace Allo Protocol](https://docs.google.com/document/d/1wbr1v0AKFKVWyp10FM_HQgv7IFqgJ8j1iG_-DzMYhJI/edit#)-Interview with CNN BR about MoonDAO and the DeSci round.3. **Learnings:** Find enough sponsors and have some grants runway for DeSci Grant Rounds. Cooperate with other DAOs for raising funds. Use Grants Stack for a Decentralized Space Exploration Grants Round on Gitcoin. Enabling community members to do the same.\n\n4. **Maintenance:** None\n\n5. **Team’s Self-Reported Score: 0.8****Key Result**: _DeSci Activation_1. **Member(s)**: Lucasart, Rod, Manu\n\n2. **Results**:[-ReFi & DeSci Twitter Engagement](https://docs.google.com/spreadsheets/d/17MeggndhQjToYEm2J6inoB16sbyd5BJU3fOCqKSKLZg/edit#gid=1297676448)-[TV Interview](https://drive.google.com/file/d/1bQARpU20dHURkeVoK9A1YZ4H/view?usp=sharing)-See Marketing Plan3. **Learnings:** MoonDAO representatives at various DeSci Twitter Spaces 500+ social media interactions and 1 TV interview. Some media convert better than others. We started engagement campaigns via Twitter to create more awareness for our Twitter Spaces. Also, we created a mentoring hub for new and more mature Decentralized Science projects together with DeSci World and our joint Cornerstone events. We also activated DeSci partners for co-promotion and exploring ways to integrate DeSci tool providers into our network.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0,9****Key Result**: _Activate DeSpace Round_6. **Member(s)**: Manuel\n\n7. **Results**: None\n\n8. **Learnings:** Too few sponsors wanted to support this and the time period was too short.\n\n9. **Maintenance**: None\n\n10. **Team’s Self-Reported Score: 0****Key Result**: _DeSpace Grant Round Preparation_1. **Member(s)**: Manuel\n\n2. **Results**:[-DeSpace Grants LOI](https://docs.google.com/document/d/17BG5lxchCa08BNfBJmwZeXEp0tw51UWFXOUQrChzBq0/edit)3. **Learnings:** Created and distributed a standard LOI to DeSpace stakeholders ([See DeSpace leadlists](https://docs.google.com/spreadsheets/d/1hvotVWshGkSsqoCg41PcXlJUDubkVAihPQ7WdgRQGK8/edit#gid=511102654)) that we engaged in Twitter Spaces - few responses. Too early for our ecosystem to raise funds, less funds available in the bear market. Filecoin is open to continue the conversation by end of this year.\n\n4. **Maintenance**: None\n\n5. **Team’s Self-Reported Score: 0.1****Key Result**: _Further contact and cooperate with Grantees_1. **Member(s)**: Rod, Manuel\n\n2. **Results**: We started to get past grantees into interviews. Manu focused on DeSci and DeSpace grantees. Rod on Climate Round and others. See Key Result: [Follow-Up with grantees](https://docs.google.com/spreadsheets/u/0/d/15HbT433GOUJ6-z7zdwOjhz340BkYfUkquI-tatw6deo/edit)\n\n3. **Learnings:** Access to Journalists/ Bloggers/ Influencers/ PR firms/ co-marketing networks are essential. We have great connections to DeSci tool providers. Most of the MoonDAO followers are not really active, or engaged, so its hard to leverage that in partnerships, we had a lot of great responses from the DeSci community though. The results will depend on the outcome of the follow-up.\n\n4. **Maintenance**: Ongoing\n\n5. **Team’s Self-reported Score: 0.6**\n\n# **Team Member Contributions**\n\n### **@Rod**\n\n# **Objective #3: Partnerships (Sponsors, Round Managers)****Key Results for Objective #**_-Partnerships Agreement__-Connect with Gitcoin Operations Team__-Gitcoin asks for partners__-GitcoinDAO Engagement_**Key Result**: _Partnerships Agreement_1. **Specific Contribution:**\n\n   1. Attended Jimi’s Tregen max impact Spaces, shilled lunar exploration\n\n   2. [Solarpunk for Space Tech Space](https://twitter.com/LunCoSim/status/1645739479381192709)s \n\n   3. [Bioregenerative Life Support Systems Spaces](https://twitter.com/i/spaces/1OwxWwWnkMexQ?s=20)\n\n   4. Got in touch with David Chaum/Astrocool though shilling on spaces\n\n   5. Project SwitchSmng introduced to the world of decentralized physical infrastructure, which is highly relevant to MoonDAO\n\n   6. Got in touch with Peaq founder, trying to get him to our AMA2. **Impact:** Got a lot of attention from specific project, planted the seeds, take a while to grow3) **Complexity of the Work:**  Takes a lot of attention and coordination**Key Result**: _Connect with Gitcoin Operations Team_4. **Specific Contribution:**\n\n   1. Created DeSci round project on giveth\n\n   2. Created a results analysis doc\n\n   3. Created a group with Boris and guys who helps to find Sybil attack\n\n   4. Nominated Manuel to be a DeSci round Stewards\n\n   5. Nominated DeSci round stewards for the gitcoin citizen round\n\n   6. Actively pushed Twitter spaces strategy on Discord5. **Impact:** Community around DeSci/Gitcoin public goods is aware of space exploration/lunar exploration6) **Complexity of the Work:** it’s a hard-to-predict job, you do not know when a new opportunity arises**Key Result**: _Gitcoin asks for partners_7. **Specific Contribution:** idk what this Key result means8. **Impact:**9) **Complexity of the Work:****Key Result**: _GitcoinDAO Engagement_10. **Specific Contribution:**\n\n    1. Spend a lot of time on twitter spaces, around 60 hours according to my estimation, including shilling on most DeSci related events, and Gitcoin events (shilled LunCo & Lunar Exploration, lot of people on radio said that after I explain why it’s important for humanity, they started to think about it)\n\n    2. Holded Gitcoin Radio 12 days each day for an hour at 0400 UTC11. **Impact:** Gitcoin Radio drained a lot of attention12) **Complexity of the Work:** Holding spaces with big organizations seems to be very efficientHolding spaces with big organizations seems to be very efficient, Twitter Spaces should be discussed and arranged long before the round (2 weeks), Twitter Spaces activity was high in the beginning, but became lower to the end, DeSci round is a community round, and all the stewards has no incentive to finalize it. \n\n### @Ryan\n\n# - **Objective**: Social Media Support\n\n  - Key Result: Graphic design image announcement for DeSci and Twitter Spaces, shared on Twitter to announce the Space and cross posted to Instagram in both Stories and [Post](https://www.instagram.com/p/CrWwq8aJoHv/).\n\n  - Key Result: Opening and hosting a few Twitter Spaces to support the weekly DeSci Friday events.\n\n- **Impact:** Minor supporting role, graphics helped to announce events and build a bit of buzz.\n\n- **Complexity of Work:** Not super complex to create the different graphics for events or speakers, not complex to open/host the handful of townhalls.\n\n### **@Pablo** \n\n# **Key Result**: _Announcement and AMA with Gitcoin_6) **Specific Contribution**: AMA with Boris during the announcement process. [DeSci Anouncement with Gitcoin](https://twitter.com/OfficialMoonDAO/status/1646690371991396352?s=20)\n\n7) **Impact:** I think we were the first AMA once the round was live, this kickoff was important to get the word out and develop a relationship with the Gitcoin and DeSci grants team.\n\n8) **Complexity:** AMAs can be stressful since they’re live and keeping the flow of conversation going and make it entertaining can be tricky while moderating and getting to know someone. **Key Result**: _Gitcoin may have Podcast with partners_6) **Specific Contribution**: AMA with Owocki\n\n7) **Impact:** This was a great opportunity to connect with the Gitcoin audience and we were able to have a relatively large audience in this AMA.\n\n8) **Complexity:** Same as above: AMAs can be stressful since they’re live and keeping the flow of conversation going and make it entertaining can be tricky while moderating and getting to know someone. \n\n### **@Lucas**\n\n# **Key Result**: _find and finalize a fit Donation Round for MoonDAO._**Specific Contribution**: run multi-sig transactions, interaction with projects, **Impact: 0,65****Complexity: 0,7****Objective**: **_Co-marketing with Gitcoin_****Key Result**: _Announcement and AMA with Gitcoin_**Specific Contribution**: tagged Gitcoin on twitter posts and threads creating dedicated content, moderated Twitter spaces**Impact: 0,6**9) **Complexity: 0,75****Key Result**: _Marketing Plan_6) **Specific Contribution**:Scheduled twitter posts and spaces, prepared post strategy and copy\n\n7) **Impact: 0,65**\n\n8) **Complexity: 0,6****Key Result**: _Referral Campaign_**Specific Contribution**: ran the whole campaign.**Impact: 0,55**6) **Complexity: 0,9 Key Result**: _GitcoinDAO Engagement_**Specific Contribution**: rPrepared copy, ran all the twitter interations.**Impact: 0,85**6) **Complexity: 0,85****Objective**: **Positioning MoonDAO as a global leader in DeSci & DeSpace****Specific Contribution**: was interviwed and got MoonDAO at major TV media vehicles.**Impact: 0,85**6) **Complexity: 0,9****Key Result**: _DeSci Activation_11) **Specific Contribution**: Made 90% of all the active twitter 500+ interactions, gave a TV interview.\n\n12) **Impact: 0,8**\n\n13) **Complexity: 0,9****.Key Result**: _further contact and cooperate with Grantees_7) **Specific Contribution**:Prepared posts tagging grantees and interacted with them on social\n\n8) **Impact: 0,75**\n\n9) **Complexity: 0,7**\n\n### **@Ballack**\n\n# **Results:**1. **Key Result**: _find and finalize a fit Gitcoin Donation Round for MoonDAO._\n\n   1. **Specific Contribution**: Had several meetings (some with Manuel together) with Gitcoin for discussion of a suitable Donation Round for MoonDAO.\n\n   2. **Impact:__** _finalize a fit Gitcoin Donation Round for MoonDAO._\n\n   3. **Complexity:** Gitcoin changed the new protocol, and needs to follow the new one.2. **Key Result**: Operating the marketing plan: [_-Co-Marketing Overview & Social Media planning_](https://docs.google.com/spreadsheets/d/1fpoj5ONBy6KVAJSIlJnMo_7Q8tL97gWXcuoWJwz52Mw/edit#gid=0)\n\n   1. **Specific Contribution**: create the marketing plan for hole Gitcoin Grants time.\n\n   2. **Impact:__** _more pp knew MoonDAO through our marketing channels._\n\n   3. **Complexity:** short time to coordinate different marketing channels3. **Key Result**: Find a partner (Greenpill CN) to co- sponsor the Desci round with MoonDAO. \n\n   1. **Specific Contribution**: successfully find Greenpill CN to co-sponsor for Desci round with MoonDAO.\n\n   2. **Impact:__** _10K more funds for DeSci round._\n\n   3. **Complexity:** Greenpill CN was hesitant to make the donation due to short time.4. **Key Result**: Comarketing with Boris to announce the cooperation.\n\n   1. **Specific Contribution**: planed the comarketing with Boris from Gitcoin for announcing the cooperation between MoonDAO and Gitcoin.\n\n   2. **Impact:__** _let pp know that MoonDAO had a cooperation with Gitcoin_ \n\n   3. **Complexity:** Gitcoin has own announcement process5) **Key Result**:Marketing push from MoonDAO CN Twitter\n\n   1. **Specific Contribution**: used MoonDAO CN Twitter for marketing push\n\n   2. **Impact:__** _let more cn pp know that MoonDAO attend the Gitcoin Grants_\n\n   3. **Complexity:** Twitter banned some accounts due to change different VPN.\n\n### **@Manuel**\n\n# 1. **Objective**: **Gitcoin Community (DeSci Grantees + Shoutouts + Partnerships)****Key Result**: _Make the investigation for DeSci and DeSpace Grants opportunities_13. **Specific Contribution:**Conducted investigation for DeSci and DeSpace Grants opportunities, initiating the first campaign to contact Web3 Foundations. Maintained follow-up with MoonDAO B2B.14. **Impact:**Identified potential grants and partnerships within the blockchain space. Learning from initial campaign and refining approach for better results. Contributed to the growth and development of MoonDAO's DeSci and DeSpace influence.15. **Complexity of the Work:**Required ongoing coordination with MoonDAO and persistence in follow-ups.**Key Result**: _Find and finalize a fit Donation Round for MoonDAO._1. **Specific Contribution:**Successfully facilitated the transfer of funds from MoonDAO treasury to the project multisig, converting ETH to DAI. Ensured smooth transfer of funds from project multisig to DeSci Round operators multisig. I was the first one who donated lol.2. **Impact:**Enabled MoonDAO to sponsor in the DeSci Round and ensured the safety of funds in the MoonDAO DeSci Project Safe and DeSci Stewards Safe.3. **Complexity of the Work:**Required effective coordination among team members and multiple stakeholders to facilitate the secure transfer of funds. Involved navigating technical intricacies of handling cryptocurrency transactions and ensuring compliance. High Gas fees hindered many donors to donate.**Key Result**: _Confirm and sign the contract with Gitcoin_1. **_Specific Contribution:_**_Led the effort to create the Gitcoin X MoonDAO Proposal, aiming to establish a partnership. Actively engaged with Gitcoin's DeSci lead, Boris, to initiate discussions and explore collaboration opportunities around the DeSci Round and Gitcoin._2. **_Impact:_**_Although a contract was not signed, the proposal laid the foundation for future partnership discussions with Gitcoin. Demonstrated proactive engagement and willingness to collaborate with Gitcoin for the benefit of both MoonDAO and the DeSci ecosystem._3. **_Complexity of the Work:_**_Navigated the process of proposing a partnership, requiring clear communication and alignment of objectives between MoonDAO and Gitcoin. Identified the need for a partnership flow to streamline future negotiations._**Key Result**: _Follow ups with Grantees_1. **_Specific Contribution:_**_Followed up with grantees, ensuring continued engagement and identifying collaboration opportunities. Designed and executed Twitter campaigns to maintain communication, facilitate interviews, and explore potential partnerships. Actively tracked progress._**_Impact:_**2. _Contributed to the ongoing engagement and relationship-building with grantees. Leveraged Twitter campaigns and interviews to create awareness, gather feedback, and identify collaboration opportunities. Demonstrated dedication to nurturing partnerships and maximizing the impact of the project._\n\n3. **_Complexity of the Work:_**_Required proactive communication and coordination with grantees, ensuring a straightforward and effective partnership framework._2. **Objective**: **_Co-marketing with Gitcoin_****Key Result**: _Announcement and AMA with Gitcoin_1. **_Specific Contribution:_**_Assisted with some moderation during the events, ensuring smooth execution and promotion via Twitter._2. **_Impact:_**_Successfully executed the DeSci announcement with Gitcoin, generating awareness and engagement._3. **_Complexity of the Work:_**_Required coordination among team members to handle various aspects of the announcement and AMA._**Key Result**: _Gitcoin may have Podcast with partners_1. **_Specific Contribution:_**_Took the initiative to pitch the opportunity to Kevin Owocki at ETHDenver._2. **_Impact:_**_Successfully established a connection with Kevin Owocki and created an opportunity for knowledge sharing and engagement between Gitcoin, GreenPill and MoonDAO communities. Through this connections I joined ReFiDAO/ RegensUnite/ GreenPill for Gitcoin Beta grantee onboarding in Berlin._3. **_Complexity of the Work:_**_Coordinated efforts among team members to secure the AMA opportunity._**Key Result**: _Marketing Plan_1. **_Specific Contribution:_**_Designed a comprehensive marketing plan. Engaged in organizing events and activities across different ecosystems, including Solarpunk Guild's Gitcoin Radio and Gitcoin Beta Twitter Spaces. Activated my personal network in DeSci, ReFi, and DeSpace for co-marketing purposes and made announcements on diverse internal and external Telegram marketing channels._2. **_Impact:_**_Implemented a cohesive social media strategy to enhance visibility and engagement for MoonDAO. Leveraged Linkedin, Twitter, Gitcoin Radio, and Space Sustainability events to promote grantee projects and represent MoonDAO. Organized cornerstone events, such as DeSpace Fridays, with partners to facilitate mentoring, feedback sessions, and collaboration opportunities. Activated personal network for wider reach and exposure._3. **_Complexity of the Work:_**_Required close collaboration among team members to design an effective marketing plan. Coordinated efforts in organizing events, and engaging with different ecosystems. Leveraged personal networks for co-marketing purposes and utilized various channels for announcements._**Key Result**: _Social Media Strategy_1. **Specific Contribution:**Collaborated with Rod, Lucas, Ballack, and Pablo to develop a social media strategy. Contributed to the formulation of the strategy.2. **Impact:**Implemented the social media strategy, providing a foundation for MoonDAO's online presence and engagement during Gitcoin Beta.. Utilized effective tactics, such as engaging with grantees via Twitter and leveraging high-engagement accounts.3. **Complexity of the Work:**Involved coordinating efforts among team members to design the social media strategy. Required understanding the audience and adapting tactics accordingly.3. **Objective**: **Partnerships (Sponsors, Round Managers)****Key Result**: _Partnerships Agreement_1. **Specific Contribution:**Led the effort to establish partnerships by designing and executing Twitter campaigns. Engaged with stakeholders from the DeSci, ReFi, and DeSpace ecosystems, conducting interviews and progressing through different stages: awareness, evaluation, engagement, and closing for partnership proposals.2. **Impact:**Created opportunities for collaboration and partnership by actively reaching out to stakeholders in relevant ecosystems. Tracked progress and engaged in meaningful conversations to explore potential partnerships. Contributed to expanding the network and fostering strategic alliances for the project.**Complexity of the Work:**3. Required strategic planning and execution of Twitter campaigns to attract and engage potential partners. Involved navigating various ecosystems and conducting interviews to assess compatibility and alignment.**Key Result**: _Connect with Gitcoin Operations Team_1. **Specific Contribution:**I joined GR-OG (Grant Round Operators Guild) on Telegram, facilitating further communication and engagement with Gitcoin's community leaders.2. **Impact:**Engagement with the Grant Round Operators Guild and Gitcoin Operation Leads enhanced collaboration and communication channels. Strengthened connections with Gitcoin's community leaders, fostering a relationships.3. **Complexity of the Work:**Required active participation and engagement in GR-OG and networking through Twitter Spaces. Navigated different communication platforms to establish connections and maintain ongoing engagement.**Key Result**: _Gitcoin ask for partners_1. **Specific Contribution:**Led the efforts to establish partnerships with past Gitcoin sponsors. Requested warm introductions multiple times, although without success.2. **Impact:**Demonstrated proactive engagement and persistence in seeking partnerships with past Gitcoin sponsors.3. **Complexity of the Work:**Navigated challenges in obtaining warm introductions to previous Gitcoin sponsors. Required ongoing communication and follow-up to establish connections and explore partnership opportunities.**Key Result**: _GitcoinDAO Engagement_1. **_Specific Contribution:_**_Engaged with various Gitcoin DAO members through Twitter Spaces. Initiated discussions on creating a DeSci sub-DAO, heavily influenced with the efforts of Boris (Gitcoin's DeSci lead) and myself in promoting the concept of launching a Grants Round._2. **_Impact:_**_Fostered connections and conversations with Gitcoin DAO members, contributing to a more collaborative and integrated community._3. **_Complexity of the Work:_**_Involved planning and setting expectations for Twitter Spaces to maximize impact._1. **Objective**: **Positioning MoonDAO as a global leader in DeSci & DeSpace****Key Result**: _Next steps for DeSpace Grant Stack_1. **Specific Contribution:**Discussed the implementation of the Allo Protocol for DeSpace projects.2. **Impact:**Laid the foundation for future implementation.3. **Complexity of the Work:**Emphasized the importance of securing sufficient sponsors and grants runway for DeSpace and DeSci Grant Rounds, as well as fostering collaboration with other DAOs.**Key Result**: _DeSci Activation_1. **Specific Contribution:**Implemented strategies outlined in the marketing plan.2. **Impact:**Generated significant engagement and awareness within the DeSci community through active participation in Twitter spaces and social media interactions Established a mentoring hub for decentralized science projects in collaboration with DeSci World, facilitating knowledge sharing and support. Leveraged connections to DeSci tool providers to pitch integration into MoonDAO's community.3. **Complexity of the Work:**Required close coordination to effectively engage in DeSci Twitter spaces and maximize impact. Ensuring alignment with project objectives.**Key Result**: _Activate DeSpace Round_1. **Specific Contribution:**Led the effort to activate the DeSpace Round, but encountered challenges due to limited sponsor interest and a short time period.2. **Impact:**Despite no tangible results, the initiative shed light on the need for additional sponsorship and a longer planning timeline to successfully activate the DeSpace Round.3. **Complexity of the Work:**Navigating the complexities of attracting sponsors and coordinating timelines for the DeSpace Round posed challenges. The project required proactive outreach and strategic planning, which ultimately highlighted the need for further support and time allocation.**Key Result**: _DeSpace Grant Round Preparation_1. **Specific Contribution:**Took the lead in preparing for the DeSpace Grant Round by creating and distributing a Letter of Intent (LOI) to engage with DeSpace stakeholders. Engaged in Twitter Spaces to promote the initiative but received limited responses.2. **Impact:**The creation and distribution of the LOI established initial communication with DeSpace stakeholders, although the response rate was low. The bear market conditions and limited availability of funds posed challenges in raising funds. Had a chat with Filecoin who expressed interest in continuing discussions by the end of the year.3. **Complexity of the Work:**Preparing for the DeSpace Grant Round involved developing a standard LOI, identifying, engaging and receiving feedback from DeSpace stakeholders.**Key Result**: _Further contact and cooperate with Grantees_1. **Specific Contribution:**Initiated interviews with past grantees, focusing on DeSci and DeSpace grantees.2. **Impact:**Initiating interviews with past grantees has enabled deeper engagement and facilitated valuable connections. There have been positive responses from the DeSci community. The overall impact will depend on the outcomes of the ongoing follow-up and partnership onboarding.3. **Complexity of the Work:**Coordinating interviews with past grantees required effective communication and relationship-building skills. Leveraging connections to DeSci tool providers and engaging with various stakeholders involved managing multiple relationships. Ongoing maintenance is required to follow up with grantees and explore partnership opportunities.\n\n# **Coordinape Results**\n\n# [Link to the Coordinape](https://app.coordinape.com/circles/9644): Make the Astronauts the admin.|                 |            |             |         |          |           |           |\n| --------------- | ---------- | ----------- | ------- | -------- | --------- | --------- |\n| **Member Name** | **Manuel** | **Ballack** | **Rod** | **Ryan** | **Pablo** | **Lucas** |\n| @Manuel         | 0          | 27          | 36      | 5        | 14        | 18        |\n| @Ballack        | 35         | 0           | 20      | 10       | 10        | 25        |\n| @Rod            | 40         | 25          | 0       | 10       | 10        | 15        |\n| @Ryan           | 35         | 17          | 28      | 0        | 7         | 13        |\n| @Pablo          | 34         | 19          | 24      | 9        | 0         | 14        |\n| @Lucasart       | 35         | 10          | 30      | 7        | 18        | 0         ||                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| @Manuel         | 29,83%                 | 500 DAI 300K MOONEY |\n| @Ballack        | 16,33%                 | 500 DAI 200K MOONEY |\n| @Rod            | 23%                    | 0                   |\n| @Ryan           | 6,83%                  | 0                   |\n| @Pablo          | 9,83%                  | 0                   |\n| @Lucasart       | 14,17%                 | 0                   |\n\n# **Treasury Transparency**\n\nLink to [Treasury](https://etherscan.io/address/0xb78C2C6ba3541E96447A27e0C7889d6798a6Be4C#tokentxns) with unused funds returned to the main DAO Treasury.\\\n|                                                                    |                                      |                                                                                             |                                                                                                                                                                                                                                          |                                                                                                        |                 |\n| ------------------------------------------------------------------ | ------------------------------------ | ------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------------------------------------ | --------------- |\n| **Txn Title**                                                      | **Reason**                           | **Amount**                                                                                  | **Recipient**                                                                                                                                                                                                                            | **Etherscan Link or Gnosis Link**                                                                      | **Deliverable** |\n| 0x675c21a73a54d33fba5918200df5e54585e459a75fc21e50f0d1e647db118a38 | Safe Account created                 |                                                                                             |                                                                                                                                                                                                                                          | [Link](https://etherscan.io/tx/0x675c21a73a54d33fba5918200df5e54585e459a75fc21e50f0d1e647db118a38)     |                 |\n| 0x0499068efbae038dd2539ffeca1a21db3871ed4475ea90ddea8697daff330465 |                                      | 14,51 ETH                                                                                   | eth:0xb78C2C6ba3541E96447A27e0C7889d6798a6Be4C                                                                                                                                                                                           | [**Link**](https://etherscan.io/tx/0x0499068efbae038dd2539ffeca1a21db3871ed4475ea90ddea8697daff330465) |                 |\n| 0xbe3fac0e50d67345e4563e34702effead2f27324cdb614a648d4d04eb185458a |                                      | 700.000 MOONEY                                                                              | eth:0xb78C2C6ba3541E96447A27e0C7889d6798a6Be4C                                                                                                                                                                                           | [Link](https://etherscan.io/tx/0xbe3fac0e50d67345e4563e34702effead2f27324cdb614a648d4d04eb185458a)     |                 |\n| 0x4a9c8357e4bbbb204369c994fcd2b1c7ef46578cd02aadcdcda1b4ee23a033d1 | Swap ETH to DAI                      |                                                                                             | eth:0xb78C2C6ba3541E96447A27e0C7889d6798a6Be4C                                                                                                                                                                                           | [Link](https://etherscan.io/tx/0x4a9c8357e4bbbb204369c994fcd2b1c7ef46578cd02aadcdcda1b4ee23a033d1)     |                 |\n| 0x002d94d0f609530a463344482f37bc16c6bdfcc0c8278f5dce78363342358dd6 | 25.000 DAI to DeSci Steward Multisig | 25.000 DAI                                                                                  | 0x1385754798D1F2C3a5eaa45c32999E57317D6BFD                                                                                                                                                                                               | [Link](https://etherscan.io/tx/0x002d94d0f609530a463344482f37bc16c6bdfcc0c8278f5dce78363342358dd6)     |                 |\n| 0x26669031b29a74241ab430d31d01b238168b0c228c48fe6057d40235ac610f38 | Mooney Test                          | 0.000000000000025+0.000000000000015+0.00000000000001+0.0000000000003+0.0000000000002 MOONEY | \\*eth:0x78176eAAbCB3255E898079dC67428e15149cdc99eth:0x878573aC033971dE478fb5cA599576f843C6D962eth:0x33e337d928Fb1aEe71b64E8a02ACDE936791d21Beth:0xE862E2C1ca94eAcfEDe3c95a217c15EF0086a29Deth:0x20d4DB1946859E2Adb0e5ACC2eac58047aD41395 | [Link](https://etherscan.io/tx/0x26669031b29a74241ab430d31d01b238168b0c228c48fe6057d40235ac610f38)     |                 |\n| 0x972dcf5acbe5d60e33c0b74f537ef8d42cdb327b0dec0174508d6c9a8ed59023 | Non Mooney                           | 0.27+0.27 ETH                                                                               | eth:0xE862E2C1ca94eAcfEDe3c95a217c15EF0086a29Deth:0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0                                                                                                                                             | [Link](https://etherscan.io/address/0x40A2aCCbd92BCA938b02010E17A5b8929b49130D)                        |                 |\n| 0x972dcf5acbe5d60e33c0b74f537ef8d42cdb327b0dec0174508d6c9a8ed59023 | Mooney 1                             | 25+15+10+300+200 MOONEY                                                                     | \\*                                                                                                                                                                                                                                       | [Link](https://etherscan.io/tx/0x972dcf5acbe5d60e33c0b74f537ef8d42cdb327b0dec0174508d6c9a8ed59023)     |                 |\n| 0xd282e38ef8e66c3e1a12fc1b4400e23c6d89728aa7ae1b3b20c79b692b242d44 | Mooney 2                             | 24975\\*14985+9990+299700+199800 MOONEY                                                      | \\*                                                                                                                                                                                                                                       | [Link](https://etherscan.io/tx/0xd282e38ef8e66c3e1a12fc1b4400e23c6d89728aa7ae1b3b20c79b692b242d44)     |                 |\n| 0xdf680be692f6e9251d2bf550d1e200c66527d4ab82040c6a908d93385f88c8a7 | Gas Fee Reimbursement to Ballack     | **0,03327 ETH**                                                                             | **eth:**0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0                                                                                                                                                                                       | [Link](https://etherscan.io/tx/0xdf680be692f6e9251d2bf550d1e200c66527d4ab82040c6a908d93385f88c8a7)     |                 |\n| 0x82493556e905f5d135e4f99b4896605434ea78e9ca39184653786f70998fa9b1 | Return ETH                           | **0,71065 ETH**                                                                             | **eth:**0xce4a1E86a5c47CD677338f53DA22A91d85cab2c9                                                                                                                                                                                       | [Link](https://etherscan.io/tx/0x82493556e905f5d135e4f99b4896605434ea78e9ca39184653786f70998fa9b1)     |                 |\n| 0xa630b5eb8bac1fbc434a8c739fb4df9e39fb77a9ab12bd2b59d29fac38b29fa8 | Return DAI                           | 100 DAI                                                                                     | **eth:**0xce4a1E86a5c47CD677338f53DA22A91d85cab2c9                                                                                                                                                                                       | [Link](https://etherscan.io/tx/0xa630b5eb8bac1fbc434a8c739fb4df9e39fb77a9ab12bd2b59d29fac38b29fa8)     |                 |\n| 0xa630b5eb8bac1fbc434a8c739fb4df9e39fb77a9ab12bd2b59d29fac38b29fa8 | Return Mooney                        | 150.000 MOONEY                                                                              | **eth:**0xce4a1E86a5c47CD677338f53DA22A91d85cab2c9                                                                                                                                                                                       | [Link](https://etherscan.io/tx/0xa630b5eb8bac1fbc434a8c739fb4df9e39fb77a9ab12bd2b59d29fac38b29fa8)     |                 |",
  "contributors": "[{\"Contributor\":\"pmoncada\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"172,873\",\"Dai\":\"667.48\"},{\"Contributor\":\"LucasArt\",\"Payout Address\":\"0xD5629b8bF9D81720b9A87E01BFbB5D3fc507fe4F\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"192,552\",\"Dai\":\"977.44\"},{\"Contributor\":\"ryand2d\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"53,904\",\"Dai\":\"0.00\"},{\"Contributor\":\"Rod\",\"Payout Address\":\"0xA64f2228cceC96076c82abb903021C33859082F8\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"404,484\",\"Dai\":\"1,752.63\"},{\"Contributor\":\"Ballack\",\"Payout Address\":\"0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"378,597\",\"Dai\":\"1,472.90\"},{\"Contributor\":\"Manuel\",\"Payout Address\":\"0xE862E2C1ca94eAcfEDe3c95a217c15EF0086a29D\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"524,599\",\"Dai\":\"2,273.09\"}]"
}
