{
  "body": "# **Project Final Report Template****Summary**\n\n[Github repo\\\n\\\nFigma Design](https://github.com/Official-MoonDao/MoonDAO-Digital-Asset-Marketplace)[Demo](https://main--moondao-marketplace-test.netlify.app/)\n===============================================================================================================================================\n\n# **Results**\n\n1) **Objective: Development**\n\n   1. **Key Result**: **Deploy Mooney and vMooney on Sepolia ✅**\n\n      1. **Member(s)**: (name.get)\n\n      2. **Results**: Deployed [Mooney](https://sepolia.etherscan.io/address/0x85A3C597F43B0cCE657793Cf31b05DF6969FbD2C) and [vMooney](https://sepolia.etherscan.io/address/0xA4F6A4B135b9AF7909442A7a3bF7797b61e609b1) contracts on Sepolia.  Goerli is being deprecated and the gas fee was costly at the start of this project. However, the thirdweb nft api doesn’t currently support Sepolia, you can enter the contract address manually but this takes more time. When the Goerli gas fees were reduced to a reasonable price I switched back to Goerli.\n\n      3. **Learnings:** The thirdweb nft api isn’t always supported by all of the testnets you can deploy to using the dashboard.\n\n      4. **Maintenance**: If a dev would like to use the test contracts they will need to be sent test MOONEY on sepolia.\n\n      5. **Team’s Self-Reported Score: 0.8**\n\n   2. **Deploy Marketplace on Sepolia ✅**\n\n      1. **Members:** (name.get)\n\n      2. **Results:** I deployed the marketplace contract on Sepolia, and shortly after I deployed another one on Goerli. [Marketplace (Sepolia)\\\n         Marketplace (Goerli)](https://sepolia.etherscan.io/address/0x58b9ad08E8967228b121519484cf88D940E581FD)\n\n      3. **Learnings: T**he thirdweb nft api isn’t always supported by all of the testnets you can deploy to using the dashboard.\n\n      4. **Maintenance:** Collection addresses need to be added manually\n\n      5. **Team’s Self-Reported Score: 0.8**\n\n   3. **Create a front-end ✅**\n\n      1. **Members:** (name.get)\n\n      2. **Results:** Forked the [marketplacev3 example](https://github.com/thirdweb-example/marketplace-v3) from Thirdweb’s github and re-configured it to support multiple collections.  Every page was adjusted and customized to allow users to buy/sell from accepted collections, and view their profile w/ current listings.\n\n      3. **Learnings:** Forking from the example and having a base project to work from was a huge benefit.  While it was a good place to start many things had to be changed and it wasn’t as easy as I initially thought.\n\n      4. **Maintenance:** Certain components could benefit from refactoring & optimization.\n\n      5. **Team’s Self-Reported Score:0.7**\n\n   4. **Create an exclusive section ✅**\n\n      1. **Members:** (name.get)\n\n      2. **Results:** I added a component that allows users to generate skyboxes using the Blockade labs skybox generator. The skyboxes save to the user’s local storage. This works pretty well however since the start of this project Blockade labs started charging to use their api.  We may have to come back to this feature in the future, but the code is there.\n\n      3. **Learnings:** Having a higher discretionary budget set aside may have allowed us to pay for the Blockade labs api.\n\n      4. **Maintenance:** None\n\n      5. **Score: 0.5**2. **Objective: Design**\n\n   1. **Key Result**: **Create UI/UX design ✅**\n\n      1. **Member(s)**: (fiyin)\n\n      2. **Results**: created wireframes and did research to design the UI/UX of the marketplace. I also created the product components to achieve consistency across all MoonDAO products.\n\n      3. **Learnings: design systems should be designed firstly before proceeding to the actual UI/UX design and the goal is to achieve consistency just in case another product will be needing design in the future.**\n\n      4. **Maintenance**:None\n\n      5. **Team’s Self-Reported Score: 0.7**\n\n   2. **Key Result**: **Review Designs ✅**\n\n      1. **Member(s)**: (name.get, pmoncada, cryptoariel, mitchie)\n\n      2. **Results**: Several comments were made which led to redesigning the button borders and NFT collection designs. I finally redesigned the UI/UX to fit into what users will be able to navigate when using the product.\n\n      3. **Learnings: design  feedback is actually important to create more iterations and the goal is to reach the best result.**\n\n      4. **Maintenance**:None\n\n      5. **Team’s Self-Reported Score:0.7**\n\n   3. **Key Result**: **Design and create MoonDAO featured collection**\n\n      1. **Member(s)**: (name.get, fiyin)\n\n      2. **Results**: Used [Control Net V-1.1](https://huggingface.co/spaces/hysts/ControlNet-v1-1) to create a featured collection from the MoonDAO logo. Lucasart and I also deployed a collection from the L2 multisig, assigning 100% of the revenue to the MoonDAO L2 treasury.\n\n      3. **Learnings:** More planning should go into listings to ensure the success of the project. While this collection works well for starting out, future collections should be given more thought.\n\n      4. **Maintenance**: Manage collection as needed (adjust description/image)\n\n      5. **Team’s Self-Reported Score:0.7**\n\n3. **Objective: Implement Design**\n\n   1. **Key Result**: \n\n      1. **Member(s)**: (cryptoariel)\n\n      2. **Results**: Implemented Fiyin’s designs on the frontend using React and Tailwind CSS.\n\n      3. **Learnings: It absolutely never pays to have two CSS design philosophies mixed on the same project, so if a repository is forked and it already has traditional CSS, one must convert that CSS to Tailwind or stick to the traditional stylesheets for the totality of the project.**\n\n      4. **Maintenance**: N/A.\n\n      5. **Team’s Self-Reported Score: 0.7**\n\n4. **Objective: Testing**\n\n   1. **Key Result**: **Test all aspects of the front-end and ensure that all transactions are correct ✅**\n\n      1. **Member(s)**: (name.get, cryptoariel)\n\n      2. **Results**: Tested all aspects of the marketplace and ensured that all transactions are correct. Found several minor front-end issues.\n\n      3. **Learnings:** A few days before testing name.get mined 0.32 Goerli eth through a POW faucet. While testing, Goerli gas fees increased and the mined Goerli ensured that the team could keep testing. Having more test coins than you need (before testing) is always a good thing. \n\n      4. **Maintenance**: N/A\n\n      5. **Team’s Self-Reported Score:** \n\n   2. **Key Result**: **Revise marketplace front-end if necessary ✅**\n\n      1. **Member(s)**: (name.get, cryptoariel)\n\n      2. **Results**: Made frontend and backend adjustments when problems came up or it was possible to improve performance.\n\n      3. **Learnings:** \n\n      4. **Maintenance**: (cryptoariel) There’s always a possibility of new previously undetected bugs on the Frontend of a marketplace that has many moving parts. I’m ready to fix any UI/UX problems that appear moving forward.\n\n      5. **Team’s Self-Reported Score:** \n\n5. **Objective: Deploy**\n\n   1. **Key Result**: **Create a “go-to-market” strategy and marketing materials**\n\n      1. **Member(s)**: (pmoncada, lucasart, fiyin)\n\n      2. **Results**: [MoonDAO Digital Asset Marketplace](https://docs.google.com/document/d/1ueMzgAaYyThyEAo5Lff3vKdZezT4IUvdblLE_z2D53s/edit#heading=h.v82q5emxwmpf)\n\n      3. **Learnings:** What I learned in boating school is... We haven’t put the strategy into action yet so there aren’t too many learnings yet.\n\n      4. **Maintenance**: This one is a little weird because although the marketplace will be implemented by the end of the quarter, we will not have deployed the first use cases so a lot of this will work will happen after the project submission. The strategy itself might change as roll everything out, but the plan is all there.\n\n      5. **Team’s Self-Reported Score: 0.7 (as in the strategy itself has been created, just not implemented. 0.7 because there’s likely aspects of the strategy that we haven’t thoughtthough of yet that we’ll realize as we get closer.)**\n\n   2. **Key Result**: **Deploy marketplace contract on mainnet** \n\n      1. **Member(s)**: (name.get)\n\n      2. **Results**: Deployed the marketplace on L2.\n\n      3. **Learnings: Deploying the marketplace on L2 allows for cheaper transactions.**\n\n      4. **Maintenance**: Maintaining the marketplace contract (adding and removing approved collections)\n\n      5. **Team’s Self-Reported Score: 0.8**\n\n   3. **Key Result**: **Clean up code (refactor & add notes)** \n\n      1. **Member(s)**: (name.get, cryptoariel)\n\n      2. **Results**: Refactored front-end and backend code. Updated thirdweb dependencies.\n\n      3. **Learnings:** Abstracting components and converting the css to tailwind gave us more freedom to build and customize the project \n\n      4. **Maintenance**: Improving the quality of the code will be an ongoing process for as long as we keep working on the marketplace.\n\n      5. **Team’s Self-Reported Score:** \n\n   4. **Key Result**: **Create a README file ✅**\n\n      1. **Member(s)**: name.get\n\n      2. **Results**: Created documentation for the marketplace\n\n      3. **Learnings:** Pointing to a readme file is easier than explaining the repo. \n\n      4. **Maintenance**: Update the documentation as updates are made\n\n      5. **Team’s Self-Reported Score: 0.9**\n\n   5. **Key Result**: **Create a subdomain**\n\n      1. **Member(s)**: (pmoncada)\n\n      2. **Results**: https\\://market.moondao.com\n\n      3. **Learnings:** This one is straightforward. CNAME 3600 \\<netlify link>.\n\n      4. **Maintenance**: May have to update if we deploy to a different server. Using netlify.\n\n      5. **Team’s Self-Reported Score:** 1.0\n\n   6. **Key Result**: **Deploy site on Netlify**\n\n      1. **Member(s)**: (name.get)\n\n      2. **Results**: I transferred the repo to the MoonDAO org. Added it to netlify and configured the domain as well as env variables\n\n      3. **Learnings:** Starting the project in the MoonDAO org on github is probably a better solution. \n\n      4. **Maintenance**: Manage hosting and env variables on Netlify.\n\n      5. **Team’s Self-Reported Score: 0.9**\n\n   7. **Key Result**: **Add link to MoonDAO App**\n\n      1. **Member(s)**: (name.get)\n\n      2. **Results**: \n\n      3. **Learnings:** \n\n      4. **Maintenance**:\n\n      5. **Team’s Self-Reported Score:** \n\n   8. **Key Result**: **List MoonDAO featured collection**\n\n      1. **Member(s)**: (name.get)\n\n      2. **Results**:  Created Featured Collection, and minted NFTs to the L2 project multisig.  They will be listed July 1st or 2nd. 1 will be listed everyday for 29 days (not auction, direct listing with no exp). \n\n      3. **Learnings:** L2 transactions are cheap!  Using chatgpt to assist with writing the metadata for the collection really helped.\n\n      4. **Maintenance**:Manage collection via L2 project multisig\n\n      5. **Team’s Self-Reported Score: 0.6**\n============================================\n\n# **Team Member Contributions**\n\n### **@Name.get**\n\n1. **Objective**: **Development**\n\n   1. **Key Result**: **Deploy Mooney and vMooney on sepolia**\n\n      1. **Specific Contribution**: Deployed MOONEY and vMOONEY test contracts on Sepolia\n\n      2. **Impact:__** These contracts helped when gas on Goerli was high.\n\n      3. **Complexity:** Deploying these contracts is pretty simple, just requires a little know-how.****\n\n   2. **Key Result**: **Deploy marketplace contract on sepolia**\n\n      1. **Specific Contribution:** Deployed thirdweb marketplace test contracts on Sepolia, Goerli and Mumbai\n\n      2. **Impact:** Allowed us to test all aspects of the front-end and simulate the marketplace on different testnets.\n\n      3. **Complexity:** Deploying the contract using the thirdweb dashboard is very easy.  I spent some time configuring the permissions through the dashboard to find the best way to set-up the frontend.\n\n   3. **Key Result**: **Create a front-end**\n\n      1. **Specific Contribution:** Created a front-end for the thirdweb Marketplace v3 contract\n\n      2. **Impact:** Allow users to interact with the marketplace v3 contract and list assets from any approved collection for MOONEY\n\n      3. **Complexity: F**orked the [marketplacev3 example](https://github.com/thirdweb-example/marketplace-v3) from Thirdweb’s github and re-configured it to support multiple collections.  Every page was adjusted and customized to allow users to buy/sell from accepted collections, and view their profile w/ current listings.\n\n   4. **Key Result: Create an exclusive section**\n\n      1. **Specific Contribution:** I added a component that allows users to generate skyboxes using the Blockade labs skybox generator. The skyboxes save to the user’s local storage.\n\n      2. **Impact:** While developing the exclusive page blockade labs started charging a fee for their api. Funds for the api were not outlined in the initial proposal so this will have to be implemented at a later time. The idea works, it could use some styling adjustments. \n\n      3. **Complexity:** Used Threejs and the blockade labs api to create a skybox generator component. Completed in a few hours.\n\n   5. **Key Result**: **Subgraph**\n\n      1. **Specific Contribution:** Created a subgraph for the Marketplace v3 contract\n\n      2. **Impact:**The subgraph is an integral part of the marketplace as it allows us to create functions to filter through historical events emitted by the marketplacev3 contract. (ex: trending listings)\n\n      3. **Complexity:** I created a subgraph using graph protocol’s cli from the abi of the marketplace v3 contract. Several adjustments were made to the generated schema and assembly script.****\n\n   6. **(extra) Key Result**: **Fee Distributor & Split** \n\n      1. **Specific Contribution:** Deployed Fee Distributor and Split contracts on Goerli and connected them to the test marketplace v3 contract and test vMooney contract\n\n      2. **Impact:** After further consideration, the team decided to create a system for fee distribution to vMooney holders. The platform fee would be sent to a split contract distributed 50/50 between the MoonDAO treasury and the FeeDistributor. The fee distributor works with the Voting Escrow contract to give vMooney holders a portion of the platform fee based on the amount of vMooney they hold.\\\n         Learn more => [Curve Finance Fee Distributor****](https://curve.readthedocs.io/dao-fees.html)The FeeDistributor idea was later replaced with burning Mooney. \n\n      3. **Complexity:** Required a couple of days of R\\&D and testing the contracts.****\n\n   7. **(extra) Key Result**: **Multicall**\n\n      1. **Specific Contribution:** Created multicall functions for marketplace contract and started creating a front-end\n\n      2. **Impact:**This would allow users to call multiple functions on the marketplace at once (create listings, cancel, claim payout).  The transaction itself is failing and I’m working with the Thirdweb support team to figure out the right way to pass in the encoded function data.\n\n      3. **Complexity:** R\\&D on thirdweb marketplace multicall\n\n   8. **(extra) Key Result: Configure for L2**\n\n      1. **Specific Contribution:** Deployed a marketplace contract on mumbai and created test collections.\n\n      2. **Impact:** Allowed us to simulate L2 and test the marketplace\n\n      3. **Complexity:** Created contracts, minted test nfts and created test listings.\n\n2. **Objective 2: Design**\n\n   1. **Key Result: Reviewed designs**\n\n      1. **Specific Contribution:** Reviewed designs created by fiyin, gave feedback, and delegated tasks \n\n      2. **Impact:** Gave feedback on the design and gave fiyin a todo list every week w/ design additions and adjustments\n\n      3. **Complexity:** Most of this was handled during the weekly meetings.\n\n   2. **Key Result: MoonDAO Featured Collection**\n\n      1. **Specific Contribution:**\n\n      2. **Impact:**\n\n      3. **Complexity:**\n\n3. **Objective 4: Testing**\n\n   1. **Key Result: Test all aspects of the front-end**\n\n      1. **Specific Contribution:** Tested all aspects of the front-end on desktop and mobile\n\n      2. **Impact:** Ensured that the site runs smoothly and without bugs or errors\n\n      3. **Complexity:** Tested the front-end over a week\n\n   2. **Key Result: Revise front-end if necessary**\n\n      1. **Specific Contribution:** Made several adjustments to the front-end after testing (including several styling additions)\n\n      2. **Impact:** Improved the performance and user experience overall.\n\n      3. **Complexity:** Made several adjustments and additions to the front-end (getFloorPrice, useUserAssets, useFilter, TokenId Page, connect wallet button, mobile nav modal,trending showcase, …and more)\n\n4. **Objective 5: Deploy**\n\n   1. **Key Result: Deploy marketplace contract on polygon**\n\n      1. **Specific Contribution:** The original plan was to deploy on mainnet however Lucasart set-up Mooney on Polygon allowing the marketplace to launch on L2. \n\n      2. **Impact:**\n\n      3. **Complexity:**\n\n5. **Key Result**: **Clean up code (refactor & add notes)** \n\n   1. **Specific Contribution:** Refactored code base and added notes\n\n   2. **Impact**:The new sdk update allowed me to optimize the site and improve performance.\n\n   3. **Complexity:** Spent time going through each file\n\n6. **Key Result**: **Create a README file ✅**\n\n   1. **Specific Contribution**: Created a README file \n\n   2. **Impact:** Documentation helps devs and members understand the project. Its a lot easier to point to that than to explain it. \n\n   3. **Complexity**: Added to documentation throughout project\n\n   4. **Team’s Self-Reported Score: 0.9**\n\n7. **Key Result**: **Deploy site on Netlify**\n\n   1. **Specific Contribution:** Deployed site\n\n   2. **Impact:** Transferred Repo to MoonDAO and Deployed the site on netlify (mumbai).\n\n   3. **Complexity:** Configured Env variables and domain\n\n8. **Key Result**: **Add link to MoonDAO App**\n\n   1. **Member(s)**: (name.get)\n\n   2. **Results**: \n\n   3. **Learnings:** \n\n   4. **Maintenance**:\n\n   5. **Team’s Self-Reported Score:** \n\n9. **Key Result**: **List MoonDAO featured collection**\n\n   1. **Member(s)**: (name.get)\n\n   2. **Specific Contribution**: Created Featured Collection, and minted NFTs to the L2 project multisig.  They will be listed July 1st or 2nd. 1 will be listed everyday for 29 days (not auction, direct listing with no exp). \n\n   3. **Impact:** The marketplace will be able to launch with a collection.\n\n   4. **Complexity:** Deployed contract, created images, created metadata**@cryptolucas**10. **Objective 2**: Design\n\n    1. **Key Result**: **Review Designs**\n\n       1. **Specific Contribution**: Reviewed Fiyin’s designs.\n\n       2. **Impact: _Made some minor suggestions._**\n\n       3. **Complexity: Discussions about design were mostly limited to the Dev Guild meetings and the weekly Marketplace meeting.**\n\n11. **Objective 3: Implement Design**\n\n    1. **Key Result:**\n\n       1. **Specific Contribution: Implemented Fiyin’s design using React and TailwindCSS.**\n\n       2. **Impact: The Frontend was implemented following the design closely. Some things that weren’t covered in the design files (such as how the Marketplace should look on a Tablet or certain sections related to buying or selling assets) were built while following the aesthetic that Fiyin conveyed in the design.**\n\n       3. **Complexity: Replacing the HTML/JSX and the CSS from the original repository while preserving the functionality.** \n\n12. **Objective 5: Deploy**\n\n    1. **Key Result: Clean up code**\n\n       1. **Specific Contribution: Refactored some of the components to increase the code quality and added simple comments pointing out what each section of the HTML/JSX corresponds to in the Frontend. This is still a work in progress.**\n\n       2. **Impact: The Frontend part of the code (HTML/JSX/TAILWIND) is clear enough for us to be able to understand it easily and work on it further.**\n\n       3. **Complexity: Noticing where a section of the HTML/JSX gets repeated and being able to abstract it in a separate file while passing the related props correctly (in a typescript-compatible manner) is the main difficulty related to this process.****@fiyin**13. **Objective 2**: **Design**\n\n    1. **Key Result**: Created the  UI/UX of the MoonDAO NFT marketplace featuring NFT collections.\n\n       1. **Specific Contribution**: Designed the marketplace components, designed the wireframes and design systems. I designed the marketplace landing page, user profile, featured collections, sign up flow plus the landing page mobile view\n\n       2. **Impact: _The UI/UX Design is to help Lucas Ariel and Name.get when writing the codes to make it easier and faster to build the marketplace._**\n\n       3. **Complexity: There were really no complexities just can be a little bit hard when designing components.****@lucasart**14. **Objective**: **Deploy**\n\n    1. **Key Result**: Deploy marketplace on polygon\n\n       1. **Specific Contribution**: Created a multisig for MDP-85 on polygon and assisted with transactions\n\n       2. **Impact:__** \n\n       3. **Complexity:****@pmoncada**15. **Objective 2**: Design \n\n    1. **Key Result**: Review design\n\n       1. **Specific Contribution**: Will be doing a more thorough review of all the pages and flows once I’m off of plane wifi ;)\n\n       2. **Impact:__** \n\n       3. **Complexity:**\n\n16. **Objective 5: Deploy**\n\n    1. **Key Result:** Create a ‘go-to-market’ strategy\n\n       1. **Specific Contribution**: [MoonDAO Digital Asset Marketplace](https://docs.google.com/document/d/1ueMzgAaYyThyEAo5Lff3vKdZezT4IUvdblLE_z2D53s/edit#heading=h.v82q5emxwmpf)\n\n       2. **Impact:__** A man without a plan cannot build a canal in Panama (dumb joke, please ignore). This document gives us something to reference as we start to dip our toes into the marketplace and try to get people accustomed to it and understand how they can use it to their advantage. It’s just words though, the follow through is the important part.\n\n       3. **Complexity:** I got a lot of help in the meetings bouncing potential ideas off of others (especially Colin, LucasAriel, LucasArt). The document itself is just capturing some of the ideas we threw around in those meetings. There was a good amount of time in meetings or messages with Don Davis DAO and some other potential partners to start seeding interest. Mostly positive results, especially with Don David DAO. I think through our partnerships process we can get a few good co-marketing opportunities too when a partner might have an offering for the MoonDAO community.\n\n    2. **Key Result:** Create a subdomain\n\n       1. **Specific Contribution**: https\\://market.moondao.com\n\n       2. **Impact:__** We’ve got a domain.\n\n       3. **Complexity:** Straightforward! But I’m the only one that can create domains at the moment since I run the Google Domains we use for moondao.com!**@mitchie\\_mitch**1. **Objective 2**: Design \n\n   1. **(extra) Key Result:** Design suggestions ****\n\n      1. **Specific Contribution**: Consultation\n\n      2. **Impact:__** A heightened sense of thematic cohesion in design elements, creating a sense of familiarity and comfort. ****\n\n      3. **Complexity:** Advice backed by 8+ years of full-time graphic/web design experience\n=============================================================================================\n\n# **Coordinape Results**\n\n<https://app.coordinape.com/circles/12663/epochs>_\\*please assign give to new epoch\\*_**500 give total (100 per team member) :**\\\n\\\nPmoncada: 15 (name.get) + 5 (cryptoariel) + 20 (fiyin) + 5 (Lucasart)  = 45Cryptoariel: 30 (pmoncada) + 40 (name.get) + 30(fiyin) 30 (Lucasart)  = 130Fiyin: 15 (pmoncada) + 20 (name.get) + 20 (cryptoariel) 20(Lucasart) = 75Lucasart: 5 (pmoncada) + 14 (name.get) + 5 (cryptoariel) + 5(fiyin) = 29Name.get: 45 (pmoncada) + 65 (cryptoariel) + 35 (fiyin) 40 (Lucasart) = 185Mitchie: 5 (pmoncada) + 10 (name.get) + 5 (cryptoariel) + 10 (fiyin) +5 (Lucasart) = 35Coordinape: 1 (name.get)|                          |                        |                     |\n| ------------------------ | ---------------------- | ------------------- |\n| **Member Name**          | **% of total rewards** | **Upfront Payment** |\n| Pmoncada : pmoncada      | 9%                     |                     |\n| Cryptoariel : LucasAriel | 26%                    | 1.1 eth             |\n| Fiyin : 0xFiyin          | 15%                    |                     |\n| Lucasart : Lucasart      | 5.8%                   |                     |\n| Name.get : name.get      | 37%                    | 2 eth               |\n| Mitchie\\_mitch : Mitchie | 7%                     |                     |\n| Coordinape               | 0.2%                   |                     |\n===========================================================================\n\n# **Treasury Transparency**\n\nLink to Treasury with unused funds returned to the main DAO Treasury.\\\n|               |            |            |               |                                   |                 |\n| ------------- | ---------- | ---------- | ------------- | --------------------------------- | --------------- |\n| **Txn Title** | **Reason** | **Amount** | **Recipient** | **Etherscan Link or Gnosis Link** | **Deliverable** |\n|               |            |            |               |                                   |                 |\n|               |            |            |               |                                   |                 |**Roll-over Discretionary Funds:** 0.27 ETH and 86 MATIC will be kept in the multisig for the Marketplace Expansion #1 proposal to be used as discretionary funds.  Any ETH that is not used will be sent to the treasury, any MATIC that is not used will be sent to the L2 treasury or bridged and swapped for ETH, then sent back to the L1 treasury.",
  "contributors": "[{\"Contributor\":\"pmoncada\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"156,797\",\"Dai\":\"605.41\"},{\"Contributor\":\"Mitchie\",\"Payout Address\":\"0x886002B1F355344feFd7df5F9e566E9402C2cF8c\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"112,093\",\"Dai\":\"232.60\"},{\"Contributor\":\"LucasArt\",\"Payout Address\":\"0xD5629b8bF9D81720b9A87E01BFbB5D3fc507fe4F\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"78,078\",\"Dai\":\"396.34\"},{\"Contributor\":\"Name.get\",\"Payout Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"644,612\",\"Dai\":\"3,866.38\"},{\"Contributor\":\"CryptoAriel\",\"Payout Address\":\"0x407F28ECd4e3EBC4288F5824e8De4fc0aF5463ED\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"452,970\",\"Dai\":\"2,695.24\"},{\"Contributor\":\"Fiyin\",\"Payout Address\":\"0x2753c791bCA3667f10800262FCB0168269e12DC5\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"261,329\",\"Dai\":\"1,132.34\"},{\"Contributor\":\"Coordinape\",\"Payout Address\":\"coordinape.eth\",\"Voting Address\":\"\",\"Eth\":\"0\",\"Mooney\":\"3,484\",\"Dai\":\"15.10\"}]"
}
