{
  "body": "# **Skyline Digital Fiat On-Ramp: Final Report**\n\n\n# **Original Proposal**\n\n**Link to Original Proposal:** \n\n[MDP-143: Skyline Digital Fiat On-Ramp](https://docs.google.com/document/d/1MkK-76xI1Fo7WhICRxhZfuSc2HHlIUoIFNdtf36UlfY/edit?usp=sharing)\\\n\\\n**Original Abstract:** \n\nThis proposal would onboard MoonDAO to [Skyline Digital](https://www.skylinedigital.xyz/), a non-custodial solution opening the doors of tradfi for web3 businesses based in Switzerland, via our MoonDAO DAO LLC legal entity based in the Marshall Islands. Skyline digital provides “rails” to on or off-ramp between crypto and fiat. \n\n\n# **Results**\n\n1. **Objective:** Create account with Skyline Digital\n\n   1. **Key Result**: Created a 2/3 multi sig with Pablo, Ryan, Mitchie to act as an intermediary point between Skyline Digital and the MoonDAO Treasury (since not all members of the treasury were willing to perform KYC.\n\n      1. **Results**: Pablo and Ryan were heavily involved in the initial conversations with multiple entities to find the best fit, ultimately settling on Skyline. Ryan moved the process forward in terms of drafting the proposal, clearing it with Skyline, and keeping things on track while Pablo was traveling. Mitchie created the multi-sig for the intermediary account. All three had to go through the KYC verification process with photo ID, proof of address, and performing verified signatures on each wallet to prove ownership. All three had to create an account in Skyline to get access to the dashboard; Pablo has write access, and Mitchie and Ryan have view access.\n\n      2. **Learnings**: We had conversations with numerous services, and decided that Skyline would be the best. Originally we planned to directly link the treasury to Skyline but found that all multi-sig signers would need to perform KYC and some were unwilling to do so. An alternative would have been to assign and trust one member to act as intermediary between the accounts and perform KYC, but goes against the trustless nature of a DAO, so the compromise was to create a new 2/3 multi-sig which will eventually be composed solely of elected astronauts.  \n\n      3. **Maintenance**: Replacing members of the multi-sig would require performing the KYC and wallet verification processes again with Skyline, otherwise there is no ongoing maintenance in regards to the setup. Additional view access can be granted to current members of the multi-sig.\n\n2. **Objective:** Receive first fiat reimbursement to MoonDAO by wire\n\n   1. **Key Result**: As an initial test transaction, Space for a Better World transferred $1,000 USD via international wire to this Swiss account.\n\n      1. **Results**: Funds received successfully to intermediary wallet: [Etherscan link](https://etherscan.io/tx/0xd8a6d24ca309fb8d34127bdad115e4311c2c51a7a91dce73d5e95c95423e2393). And then transferred back to the main MoonDAO Treasury: [Etherscan link](https://etherscan.io/tx/0x86a09c751b8f54af35369cbb770aed0e4f3e14c1d725978df8cba11cbd80c0cd). The final amount of $950 USDC received is minus the transaction fees (including some unexpected ones).\n\n      2. **Learnings**: While we were aware of the 1% + $10 fee going into this, we were not aware that there was a minimum $100 fee (so 1% + $10 or $100, whichever is greater). Meaning a fairly large hit on a small transaction like this test transaction. Skyline did reduce the fee by half for this first transaction. There is the possibility to do future transactions on Polygon which has a minimum fee of $30, but Skyline will basically only be useful for large transactions i.e. $10,000 or more on mainnet, or $3,000 or more on Polygon. \n\n      3. **Maintenance**: Create a mirror multi-sig on Polygon, otherwise no maintenance besides signing transactions and moving funds.\n\n<!--StartFragment-->\n\n**Grade:**  Meets Expectations\n\n\n# **Member Contributions**\n\n**@pmoncada:** Heavily involved in the initial conversations with multiple entities to find the best fit, ultimately settling on Skyline. Performed the KYC verification process with photo ID, proof of address, and performing verified signatures on each wallet to prove ownership. Created an account in Skyline to get access to the dashboard. Met with Christina to initiate the first test transaction.\n\n**@ryand2d:** Heavily involved in the initial conversations with multiple entities to find the best fit, ultimately settling on Skyline. Moved the process forward in terms of drafting the proposal, clearing it with Skyline, and keeping things on track while Pablo was traveling. Performed the KYC verification process with photo ID, proof of address, and performing verified signatures on each wallet to prove ownership. Created an account in Skyline to get access to the dashboard.**@mitchie\\_mitch:** Created the multi-sig for the intermediary account. Performed the KYC verification process with photo ID, proof of address, and performing verified signatures on each wallet to prove ownership. Created an account in Skyline to get access to the dashboard.\n\n\n# **Reward Distribution**\n\n|                 |                        |                     |                                            |                                            |\n| --------------- | ---------------------- | ------------------- | ------------------------------------------ | ------------------------------------------ |\n| **Member Name** | **% of total rewards** | **Upfront Payment** | **Wallet to receive ETH**                  | **Wallet to receive MOONEY**               |\n| _@pmoncada_     | _40%_                  | _None_              | _pmoncada.eth_                             | _pmoncada.eth_                             |\n| @ryand2d        | 40%                    | None                | 0x78176eaabcb3255e898079dc67428e15149cdc99 | 0x78176eaabcb3255e898079dc67428e15149cdc99 |\n| @mitchie\\_mitch | 20%                    | None                | 0xb1d4c1B9c8DA3191Fdb515Fa7AdeC3D41D014F4f | 0x9fDf876a50EA8f95017dCFC7709356887025B5BB |",
  "contributors": "[{\"Contributor\":\"pmoncada\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Eth\":0.8742,\"Mooney\":531362,\"Dai\":0},{\"Contributor\":\"ryand2d\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0xB2d3900807094D4Fe47405871B0C8AdB58E10D42\",\"Eth\":0.8742,\"Mooney\":531362,\"Dai\":0},{\"Contributor\":\"mitchie_mitch\",\"Payout Address\":\"0xb1d4c1B9c8DA3191Fdb515Fa7AdeC3D41D014F4f\",\"Voting Address\":\"0x9fDf876a50EA8f95017dCFC7709356887025B5BB\",\"Eth\":0.4371,\"Mooney\":265681,\"Dai\":0}]"
}
