{
  "body": "# **MoonDAO-App Expansion: Final Report****Summary**\n\nThe project successfully met key objectives aimed at enhancing user experience and streamlining web functionalities. Major accomplishments include the automation of Mooney locking transactions, the consolidation of the app and dashboard into a unified platform, and a significant front-end code refactor. While some objectives, such as improving user satisfaction by 15% and increasing organic search traffic, are pending post-launch evaluation, the team has made substantial progress.\n\n\n# **Results**\n\nLink to the current app: <https://main--moondao-app-expansion-test.netlify.app/> \n\n\n## **Objective:** Improve User Experience\n\n1. **Key Result**: Increase user satisfaction score by 15% based on post-implementation survey feedback\n\n   1. **Results**: [Pre-implementation user survey](https://circles.spect.network/r/3eccd2f2-e67c-45ce-9c7a-2e197e02cc73)\n\n   2. **Learnings**: Low submission count might have been mitigated by introducing a simple reward like a POAP. Only a pre-implementation survey was conducted\n\n   3. **Maintenance**: none\n\n   4. **Team’s Self-Reported Score**: .3\n\n2. **Team Contributions**\n\n   1. **Mitchie**: Developed and promoted the survey resulting in 6 submissions.\n\n3. **Key Result**: Reduce number of clicks to stake Mooney\n\n   1. **Results**: The transaction for locking is automated. After successfully approving mooney the user is asked to approve the transaction for locking their mooney.\n\n   2. **Learnings:** Automating transactions improves the user experience\n\n   3. **Maintenance**:None\n\n   4. **Team’s Self-Reported Score:** \n\n   5. **Team Contributions\\\n      Colin:** Created a web3 button for approving and locking mooney****\n\n4. **Key Result**: Reduce the combined number of pages (app & dashboard) by 50%\n\n   1. **Results**: Reduced from 10 pages to 6\n\n   2. **Learnings:** Some pages weren’t necessary, less is more\n\n   3. **Maintenance**:None\n\n   4. **Team’s Self-Reported Score:** \n\n   5. **Team Contributions\\\n      Colin:** Removed & consolidated pages and components**Ariel:**  Adjusted the site’s frontend to the new changes, re-working the UI to make it all fit as needed.\n\n**Pablo:** I helped remove some pages that were nice but ultimately redundant. Made the homepage go down from 9 links to 3, removed announcements, deleted subtitles and other things that should be intuitive. In general just helped clean up the app a lot through recommendations and a few PRs I put in.****\n\n2. **Objective:** Consolidate Websites and Enhance Accessibility\n\n   1. **Key Result**: Consolidate websites into a single, all-in-one website\n\n      1. **Results**: Merged the app and dashboard, redirected dashboard site & old links to the app.\n\n      2. **Learnings:** \n\n      3. **Maintenance**:\n\n      4. **Team’s Self-Reported Score:**\n\n      5. **Team Contributions\\\n         Colin:\\\n         Ariel:** Ported many of the original Dashboard’s code to the new App, changed the CSS of the original app pages (Home, Lock Mooney, Lifeship, Zero-g pages) to fit the new app.**Fiyin:**\n\n**Pablo:** Made a lot of judgement calls on what needed to be added and should stay in the consolidated site. All the credit on this should go to the rest of the team though on the implementation.****\n\n2. **Key Result**: Implement a clear and easily accessible “Buy Mooney” button on the landing page\n\n   1. **Results**: Added a ‘buy mooney’ card to the home page\n\n   2. **Learnings:** \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score:** \n\n   5. **Team Contributions\\\n      Colin:\\\n      Ariel:** Created the cards.****\n\n3. **Key Result**: Increase organic search traffic to the new all-in-one website by 15% within three months of implementation\n\n   1. **Results**: This result will only be visible after we launch the site, haven’t done that yet.\n\n   2. **Learnings:** \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score:** \n\n   5. **Team Contributions\\\n      Colin:\\\n      Ariel:** -****\n\n3) **Objective:** Front-end\n\n   1. **Key Result**: Refactor the Dashboard's (Mission Control) frontend logic so it can be fully integrated with the MoonDAO App, unifying them completely. This refactor mostly encompasses turning the Dashboard's plain React code into Next.js with Typescript code.\n\n      1. **Results**: \n\n      2. **Learnings:** \n\n      3. **Maintenance**:\n\n      4. **Team’s Self-Reported Score:** \n\n      5. **Team Contributions\\\n         Colin:\\\n         Ariel:** Worked on the styling (CSS) of the Dashboard and the original app so they could be integrated seamlessly.**Fiyin:** Designed the Frontend UX for the app.\n\n**Pablo:** Gave a lot of feedback on the UX for the app, making sure that all the links were working and the copy made sense. Made some adjustments there personally to ensure the quality of the unified frontend.\n\n**Team Member Contributions**\n\n**@Fiyin**\\\n**1**. **Objective : UX Wireframe Designs**\n\n1. **Key Result:** Design new wireframes for the User Experience designs for the App\n\n**i. Specific Contribution:** I made a valuable contribution by creating a clean and well-structured wireframe design for the MoonDAO App. This wireframe serves as the foundation for the app's development, ensuring a clear and organized layout that will streamline the design and development process.\n\n**ii. Impact:** The creation of this wireframe design had a substantial impact on the MoonDAO App project. It provided a visual roadmap that clarifies the app's structure and functionality, fostering better communication among team members and stakeholders. This, in turn, accelerates the development process, resulting in a more efficient and effective project timeline.\n\n**iii.**  **Complexity:** Creating new wireframes can be a bit tricky; it just needs careful research.\n\n**2. Objective: Low-Fi Designs**\n\n2. **Key result:** Convert the designed wireframes to low-fi designs \n\n**i.**  **Specific Contribution:** I helped turn basic wireframe sketches into simpler, user-friendly low-fi designs. This made it easier for everyone to see how the app would look and function.\\\n**ii.**  **Impact:** The low-fi designs provided a clear visual representation of the app's structure and functionality, which improved communication among team members and stakeholders. This clarity ensured that everyone was on the same page, resulting in a more streamlined and efficient design and development process.\n\n**iii.** **Complexity:** Converting the wireframes designs into low-fi designs was quite easy, I needed to spend more time to convert the designs.\n\n**3. Objective : Final UX Designs**\n\n3. **Key result:** Convert the low-fi designs to high-fi designs (final designs)\n\n**i. Specific Contribution:** I created the final designs with the low-fi designs and this provided a clear visual representation of the app's structure and functionality, which improved the overall user interface and experience of the existing app.\n\n**ii. Impact:** The development process was significantly influenced by the completion of the final designs. These finalized designs are now poised for seamless implementation, marking a crucial step towards the project's completion.\n\n**iii. Complexity:** Creating the final designs for development only required more time and collaboration with the stakeholders.\n\n**4. Objective : Prototype**\n\n4. **Key Result:** Prototype the final designs to make it functional\n\n**i. Specific Contribution:** Having the high-fidelity designs in place, I created prototypes for the final designs to simplify the development process for the developers.\n\n**ii. Impact:** The prototype served as guide for the app user journey and functionalities\n\n**iii. Complexities:** Creating the prototype required understanding user journey and the functionalities of the app. \n\nHere is the full prototype of the final app designs: <https://www.figma.com/proto/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?page-id=1850%3A3816&type=design&node-id=1850-3873&viewport=890%2C3153%2C0.39&t=vb5OW59Wx2OCTDrs-1&scaling=scale-down-width&starting-point-node-id=1870%3A7095&mode=design>\n\n**@name.get**\n\n**1. Objective : Improve User Experience**\n\n**Key result:** Reduce number of clicks to lock mooney\n\n**i. Specific Contribution:** Automated the lock transaction to fire after a user approves their mooney.\n\n**ii. Impact:** One less click \n\n**iii. Complexity:** Adjusted the web3 button for locking\n\n**Key result:** L2 Toggle\n\n**i. Specific Contribution:** Added a toggle for L2 to allow users to lock L2 mooney\n\n**ii. Impact:** Users can lock mooney on L1 or L2\n\n**iii. Complexity:** Created the L2 toggle component and hook, Created a selected chain context to allow for a dynamic active chain using the thirdweb provider.\n\n**2. Objective : Consolidate websites**\n\n**Key result:** Merged code from the the dashboard to the app-expansion project\n\n**i. Specific Contribution:** Added and refactored components and hooks from the dashboard to the app-expansion project. \n\n**ii. Impact:** Made the dashboard components and hooks easily accessible and refactored several hooks, components and functions.\n\n**iii. Complexity:** Merging and refactoring react components and hooks\n\n**3**. **Objective : Web3 & Backend**\n\n**Key Result:** Replace wagmi with thirdweb sdk\n\n**i. Specific Contribution:** Replaced all wagmi functions and contract interactions with thirdweb. The app now uses the thirdweb sdk to interact with contracts.  Thirdweb provides a robust sdk allowing devs to easily read/write blockchain data. \n\n**ii. Impact:** Devs will have an easier time adding features to the app, This is also a great foundation to integrate smart wallets, the marketplace, and future updates.\n\n**iii.**  **Complexity:** Addd the thirdweb provider and replaced all of the wagmi functions with the thirdweb equivalent. \n\n**4. Objective: Frontend & Styling**\n\n**Key result:** Added and adjusted frontend components and styling\n\n**i.**  **Specific Contribution:** Adjusted the calendar (components and hooks) to only display scheduled discord events. I also made several adjustments to the TailwindCSS throughout the project.\n\n**ii.**  **Impact:** Simplified the calendar, small improvements to styling\n\n**iii.** **Complexity:** Adjusted components, hooks and TailwindCSS\n\n**5. Objective : Security & Testing**\n\n**Key Result:** Security audit and testing\n\n**i. Specific Contribution:** Audited the dependencies and connected SYNK.io for monitoring. Also wrote an e2e test and integration testing using cypress.\n\n**ii. Impact:** Current versions of dependencies have zero critical / high vulnerabilities.  Dependencies are being monitored by SYNK.  Code is being tested anytime there is a push/pull request on the main branch using a github workflow.\n\n**iii. Complexities:** Created a[ document ](https://docs.google.com/document/d/1bebGtqkfef-sBVY8Imv2ZxsA_DcezKvEcTcDMsL2SpM/edit)for security audit & testing .  Added a github workflow, e2e & integration testing.\n\n**@Ariel**\n\n**1. Objective: Frontend & Styling**\n\n**Key result:** Added and adjusted frontend components and styling\n\n**i. Specific Contribution:** Worked on the Styling/CSS to consolidate the websites.. \n\n**ii. Impact:** Imported some pages and components from the Mission Control dashboard, re-styled the Lock Page, Lifeship and Zero-G pages.\n\n**iii. Complexity:** Styling different pages so they would be compatible with each other and look like a single coherent App required many adjustments to the original code.\n\n\n# **Coordinape Results**\n\n[Link to the Coordinape](https://app.coordinape.com/circles/17652/)\n\n|                 |                        |                     |\n| --------------- | ---------------------: | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| Colin           |                  40.25 |                     |\n| Ariel           |                  22.25 |                     |\n| Mitchie         |                    7.5 |                     |\n| Fiyin           |                   18.5 |                     |\n| Pablo           |                     11 |                     |\n| Coordinape      |                    0.5 | 0                   |\n",
  "contributors": "[{\"Contributor\": \"Lucas\", \"Payout Address\": \"0xD5629b8bF9D81720b9A87E01BFbB5D3fc507fe4F\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"50,092\", \"Dai\": \"172.03\"}, {\"Contributor\": \"Pablo\", \"Payout Address\": \"0x679d87D8640e66778c3419D164998E720D7495f6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"286,778\", \"Dai\": \"260.84\"}, {\"Contributor\": \"Colin\", \"Payout Address\": \"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"957,701\", \"Dai\": \"4,144.49\"}, {\"Contributor\": \"Ryan\", \"Payout Address\": \"0x78176eaabcb3255e898079dc67428e15149cdc99\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"25,046\", \"Dai\": \"86.01\"}, {\"Contributor\": \"Ariel\", \"Payout Address\": \"0x407F28ECd4e3EBC4288F5824e8De4fc0aF5463ED\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"529,412\", \"Dai\": \"1,818.14\"}, {\"Contributor\": \"Ballack\", \"Payout Address\": \"0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"15,939\", \"Dai\": \"86.01\"}, {\"Contributor\": \"Fiyin\", \"Payout Address\": \"0x2753c791bCA3667f10800262FCB0168269e12DC5\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"440,186\", \"Dai\": \"1,511.71\"}, {\"Contributor\": \"Mitchie\", \"Payout Address\": \"0x3d1F623BEedc1bdAaeA4E7F968B44e6262eaCcAd\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"178,454\", \"Dai\": \"612.86\"}, {\"Contributor\": \"Coordinape\", \"Payout Address\": \"0x15B513F658f7390D8720dCE321f50974B28672EF\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"11,897\", \"Dai\": \"40.86\"}]"
}
