{
  "body": "# **ZeroG Charter: Final Report**\n\n\n# **Original Proposal**\n\n**Link to Original Proposal:**[MDP-66: ZeroG Charter Event](https://docs.google.com/document/d/1c6QVQosvDZZrlCXC06Voiuc9z4BL3uYrk75FCGNQoWw/edit?usp=sharing)**Original Abstract:**MoonDAO is organizing a charter flight and JSC tour in association with other events in the Houston, Texas area on June 9th, in partnership with Space for a Better World. The main event is a ZeroG charter flight with two astronauts in attendance. The flight has 28 seats, which will be sold to the public and of which a portion will be VIP tickets, a portion will also be reserved for raffles, various partners, and causes. In addition to the flight, MoonDAO is hosting a private tour of the Johnson Space Center. We will also be submitting a proposal for a Gala in association with Space for a Better World. The Gala is being submitted as a separate proposal to allow for targeted focus on the different portions of this event. \n\n\n# **Results**\n\nMoonDAO chartered an entire ZeroG flight (30 seats) alongside Space for a Better World. The flight was twice delayed by ZeroG (completely out of our control). 18 seats were sold for a total revenue of $198,392. Six seats were reserved for S4BW (including for three astronauts). 3 seats were given away by the MoonDAO community, two to social media influencers decided by Snapshot vote, and one via an random NFT drawing (Ticket to ZeroG). The 3 remaining seats were awarded to MoonDAO contributors in order of their average retroactive contributions over the past few quarters. The flight was full.\n\n<!--StartFragment-->\n\nThe base cost of the flight was $173,580 plus $30,000 for the three astronaut fees, for a total of $203,580. The flight was basically revenue neutral in USD not including things like travel expenses for staff and astronauts, dinner, photographer, etc. In total, the project cost $228,000, for a net negative of -$30,000. Although the relationships built over the course of a year between astronauts, NASA, S4BW, ZeroG, influencers, publicity, generated media such as videos and AMAs, etc, all compensate for the shortfall, even if the project didn’t generate a net inflow to MoonDAO. The relationship between MoonDAO and Intuitive Machines, for example, was a direct result of this project and the CEO’s connection with astronaut Nicole Stott. \n\n1. **Objective:** Charter a ZeroG flight in partnership with Space for a Better World\n\n   1. **Key Result**:  Partner with Space for a Better World to reserve a ZeroG charter flight\n\n      1. **Results**: We chartered a flight that flew on February 23rd out of Kennedy Space Center. The flight was delayed twice due to issues out of our control.\n\n      2. **Learnings**:  The delays were problematic. Unfortunately, engaging in projects where things are out of your hands to resolve can be a real challenge. When possible, it makes sense to limit these types of dependencies, although that is not feasible with a project like this.\n\n2) **Key Result**: Organize the inclusion of astronauts on the flight\n\n   1. **Results**: THREE astronauts included in the flight; Charlie Duke, Nicole Stott, and Doug Hurley, thanks to Christina.\n\n   2. **Learnings**:****\n\n3) **Key Result**: Secure exclusive tour of Johnson Space Center\n\n   1. **Results**: Nicole Stott arranged for an amazing private tour of JSC.\n\n   2. **Learnings**: There were minor issues with foreign nationals and being able to get them clearance before the deadline.\n\n**Grade:** _Met expectations_****\n\n2. **Objective:** Collaborate with Space for a Better World for a marketing campaign for the ZeroG flight and any additional associated events.\n\n   1. **Key Result**: Collaborate with the Space for a Better World on marketing and event planning for the ZeroG charter flight\n\n      1. **Results**: Marketing was performed both independently and repurposing and resharing content by S4BW and MoonDAO. Things like the astronaut AMAs with Nicole Stott, Doug Hurley, and the in-person video interview with Charlie Duke were all collaborations thanks to S4BW. Recruiting influencers to help marketing was also helpful, Ellie in Space sold five seats for us.\n\n      2. **Learnings**: Marketing for something like this isn’t necessarily effective through social media, the real challenge is just ensuring that the right people are aware of this opportunity and then the flight naturally sells itself, but it can be hard to reach them. Ultimately, most of the seats were sold by Christina’s 1:1 outreach and Ellie’s audience.\n\n2) **Key Result**: Set up payment portal and advise partners on payments and ticketing for the charter flight and associated events\n\n   1. **Results**: Payments were handled through ZeroG or S4BW, MoonDAO did not handle any payments directly and none were made in crypto.\n\n   2. **Learnings**: Being able to accept fiat payments or have a payment portal should be a priority for MoonDAO, although it would not have necessarily impacted this project since we were able to facilitate through other entities.\n\n**Grade:** _Met expectations_****\n\n3. **Objective:** Plan and coordinate a tour of Johnson Space Center\n\n   1. **Key Result**: We will Coordinate a tour of JSC specific to our flyers giving them a look at space operations\n\n      1. **Results**: Nicole Stott arranged for this using her personal contacts at JSC.\n\n      2. **Learnings**: N/A\n\n2) **Key Result**: Through S4BW we will organize a behind-the-scenes tour of JSC guided by current and/or former astronauts\n\n   1. **Results**: Christina & Nicole Stott arranged for this using her personal contacts at JSC.\n\n   2. **Learnings**: N/A\n\n******Grade:** _Met expectations_****\n\n4. **Objective:** Travel to Houston/Florida and act as an onsite coordinator for the event (2 people total)\n\n   1. **Key Result**: Serve as an onsite representative for MoonDAO\n\n      1. **Results**: Pablo and Ryan from MoonDAO were on the ground for both TX and FL, as well as Christina.\n\n      2. **Learnings**: The original delay meant double travel expenses for everyone including MoonDAO, S4BW, and the astronauts. While the delays were unavoidable, double travel definitely ate into the margins for this project.\n\n      3. **Maintenance**: N/A\n\n2) **Key Result**: Provide support for any questions and needs from event attendees\n\n   1. **Results**: Christina and Ryan were primary points of contact with guests before and during the event(s) which meant answering questions by email for any and all guests, communication and coordination on the ground for things like the JSC tour, hotel dinner, the flight cancellation in TX, and then the informal meet up and actual flight in FL.\n\n   2. **Learnings**: None.\n\n**Grade:** _Met expectations_****\n\n5. **Objective:** Conduct a drawing for the distribution of a ZeroG ticket to a MoonDAO member\n\n   1. **Key Result**: Implement a system for vMooney holders to enter into the drawing\n\n      1. **Results**: Colin led the smart contract and NFT development for the Ticket to ZeroG contest, which resulted in one-person from the MoonDAO community being selected to join for free. \n\n      2. **Learnings**: \n\n2) **Key Result**: Publicly utilize a random number generator for the selection of ticket winners\n\n   1. **Results**: \n\n   2. **Learnings**:****\n\n3) **Key Result**: Provide support for any questions and issues\n\n   1. **Results**: \n\n   2. **Learnings**:\n\n**Grade:**\n\n6. **Objective:** Design and execute a marketing plan for the sale of ZeroG flight tickets\n\n   1. **Key Result**: Utilize MoonDAO’s network of social media accounts and contacts to promote awareness of this event\n\n      1. **Results**: Regular promotion of the flight was done via MoonDAO, S4BW, and occasionally boosted by Doug Hurley or Nicole Stott. These did lead to more wider knowledge about the event, although it can be hard to associate a sale to these methods directly. We did capitalize on our relationship with Ellie in Space to use social media to promote the flight and sell tickets. \n\n      2. **Learnings**: The uncertainty about dates and the delays impeded our ability to promote the flight at times… When we weren’t 100% sure if it would happen on X date, it prevented us from leveraging our contacts and asking them to share or promote further when it may or may not be delayed. \n\n2) **Key Result**: Promote this flight through MoonDAO representation at events\n\n   1. **Results**: There were a handful of in-person events like DAODenver, New Worlds, and Davos (WEF).\n\n   2. **Learnings**: No sales were generated through in-person events, but simply sharing that this is something we are working on provides a bit of a credibility boost when making new connections in the space sector.\n\n3) **Key Result**: Utilize paid marketing for targeted advertising\n\n   1. **Results**: Not utilized. \n\n   2. **Learnings**: PPC marketing for a product that costs $10k+ was deemed not practical.****\n\n4) **Key Result**: Create custom promotional media including videos and digital and physical media\n\n   1. **Results**: Videos, memes, images, etc were created and shared.\n\n   2. **Learnings**:\n\n**Grade: Met expectations**\n\n\n# **Member Contributions**\n\n**@super.jellie:** Initiated project and secured relationship with Space For A Better World\n\n**@aribruce:**  Initiated project and secured relationship with Space For A Better World\n\n**@ryand2d:** Did most of the marketing work from MoonDAO’s side, such as orchestrating the social influencer giveaway, personally recruiting nearly half the entrants including both of our winners (Ellie and Anastasia), generated content to share on socials including video and images for all stages (contests, ticket sales, after the fact), coordinated behind the scenes for things like the MoonDAO live AMAs. Sold one ticket directly (maybe two, depending on how you count). Coordinating one on one with many of our guests for logistical things regarding the plan for both events to things like gathering the shirt size for swag with t-shirts and the Luna Replica jackets. Handled the fulfillment of MoonDAO swag by uploading MoonDAO shirts to Amazon Merch, ordering and distributing them at the event. Got a sponsorship from Starbase Brewing for our Houston event, they supplied 4 cases of beer, picked up in Austin and brought to Houston.\\\n\\\n**@pmoncada:** Initially I was going to only support the project strategically from the background, but when Stellie (super.jellie) stepped down from leading the project shortly after it was initiated, I became the project leader and picked the project up so we can continue to do it. I took charge of creating our execution plan for selling the seats, organizing the sweepstakes, and influencer giveaway. Some tasks I personally handled include creating the contract between ourselves and Space for a Better World, leading the weekly meetings and putting together a tasklist for the week, and accounting for the costs for the project. In the beginning my focus was mostly designing how we’d give away the seats and helping put the plan together for executing this within the app, and putting together plans for a commission program for seat sales. I also did the interviews for many MoonDAO AMAs and generally supported the marketing efforts that were led by Ryan. I helped make a lot of strategic decisions for the project alongside Christina and Ryan, for example adding Charlie Duke to the flight, figuring out where we’d reschedule to, dealing with any unexpected complications with the flight, dealing with special cases about sales, decisions about seat giveaways, and generally helping to navigate the project’s uncertainty and unforeseen circumstances.\\\n\\\n**@name.get:** Created the zero-g sweepstakes contract, nft and page within the app.\n\n**@mitchie:** Designed and implemented a [promotional landing page](https://www.moondao.com/zero-g-x), [graphics](https://drive.google.com/drive/folders/1x11oomEgFNlu9VSxHW3M6XPvB-ltIgeW?usp=sharing), and blog posts (now archived), alongside temporary updates to the main landing page and a promotional [meme](https://media.discordapp.net/attachments/914969673785823312/1102092652633145465/skeleton.png?ex=66122444\\&is=65ffaf44\\&hm=42160a02cef5f9515994330eafd940c688e2113f6fe741ba57d3898383c7e0a3&=\\&format=webp\\&quality=lossless\\&width=750\\&height=1014).\\\n**@christina:** As the person who manages astronauts and had previously done 4 Zero Gravity flights all by myself, I led the strategy, marketing, sales, operations, and coordination of the flight. I initially worked with Ari and some of the others to begin marketing and messaging about the flight but Ari had family and other duties that pulled him away. Soon the project was taken over on the MoonDAO side by Pablo and then Ryan jumped in and those two were my main partners on the project. Besides dealing with all operations, logistics and planning for the flight I was able to get MoonDAO a $57,000 discount for the charter because of my existing relationship with Zero G and through my non-profit rate and was able to have 30 seats on the plane as opposed to Zero G’s new policy of 28 seats. I was responsible for securing the NASA astronauts who are my partners through SPACE for a Better World. I dealt with all negotiations and travel planning for the astronauts, initially just two astronauts - Nicole Stott and Doug Hurley. When the date of the first flight was postponed by Zero G to October we discussed adding Apollo16 Moonwalker Charlie Duke to make the flight even more special and because of his willingness and availability. I handled travel and coordination for the astronauts in Houston, secured a photographer to cover the private dinner and worked closely with Nicole Stott to arrange the VVIP tour of Johnson Space Center with the astronauts. Then Zero G postponed the flight again and we eventually decided to move the flight to Kennedy Space Center on February 23. I worked diligently to promote the flight to my network and on the SpaceFabworld social media as well as my own social media and we ended up selling the remaining spots on the flight. I sold 8 of the 20 spots sold on the flight. I also convinced Charlie Duke to do an on camera interview with Pablo for MoonDAO which is quite challenging as he normally charges $10k just for that. He was willing to do it as a favor to me. This flight was one of the most challenging of all the flights I’ve worked on but even though we struggled to sell the spots for the original price I think the benefit to the MoonDAO community and for Pablo and Ryan and the others to get this experience and benefit from the Non-Profit discount SpaceFabWorld made it very successful as MoonDAO’s first zero gravity flight.\n\n**Reward Distribution**\n\n[Link to the Coordinape](https://app.coordinape.com/circles/17564/give)\n\n|                 |                        |                        |                                            |                                            |\n| --------------- | ---------------------- | ---------------------- | ------------------------------------------ | ------------------------------------------ |\n| **Member Name** | **% of total rewards** | **Upfront Payment**    | **Wallet to receive ETH**                  | **Wallet to receive MOONEY**               |\n| @super.jellie   | 4.04                   | NONE                   | 0x8C1Bf43198c5E7cAB13439e0C53A8650033d03ef | 0x8C1Bf43198c5E7cAB13439e0C53A8650033d03ef |\n| @aribruce       | 2.63                   | 1,000                  | 0x2c485a4DaD1c1a6a031A6DB08D5212b74A4A50e7 | 0x2c485a4DaD1c1a6a031A6DB08D5212b74A4A50e7 |\n| @xtina\\_korp    | 19.60                  | 1,000 + 100,000 mooney | 0x3ea48DFA0F7a57D08e3Dd093C78D1e300616B57d | 0x3ea48DFA0F7a57D08e3Dd093C78D1e300616B57d |\n| @ryand2d        | 26.26                  | 2,000 + 200,000 mooney | 0x78176eaabcb3255e898079dc67428e15149cdc99 | 0x78176eaabcb3255e898079dc67428e15149cdc99 |\n| @pmoncada       | 26.26                  | 2,000 + 200,000 mooney | 0x679d87D8640e66778c3419D164998E720D7495f6 | 0x679d87D8640e66778c3419D164998E720D7495f6 |\n| @name.get       | 8.48                   | 1,000                  | 0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6 | 0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6 |\n| @mitchie\\_mitch | 12.12                  | NONE                   | 0xb1d4c1B9c8DA3191Fdb515Fa7AdeC3D41D014F4f | 0x9fDf876a50EA8f95017dCFC7709356887025B5BB |\n| @ballack6780    | 0.40                   | NONE                   | 0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0 | 0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0 |\n| Coordinape      | 0.20                   | NONE                   | 0x15B513F658f7390D8720dCE321f50974B28672EF | 0x15B513F658f7390D8720dCE321f50974B28672EF |\n\n\n# **Treasury Transparency**\n\n[Link to Treasury](https://app.safe.global/transactions/history?safe=eth:0xa3a2A9AFeE83221AAf79f0Fdfe948FDab3ddC730) ****\n\n|                     |             |                |                   |                                                                                               |                                             |\n| ------------------- | ----------- | -------------- | ----------------- | --------------------------------------------------------------------------------------------- | ------------------------------------------- |\n| **Txn Title**       | **Reason**  | **Amount**     | **Recipient**     | **Etherscan Link or Gnosis Link**                                                             | **Deliverable**                             |\n| Nonce 9             | Sent        | 21.2481 ETH    | tomoondao.eth     | <https://etherscan.io/tx/0xf7b107abb8015f7a32ed68ec17d5ac607d0ec758a52f1e6edd3efcf525bd5377>  | Treasury Reimbursement                      |\n| Nonce 8             | multiSend   | 0.04617 ETH    | Team              | <https://etherscan.io/tx/0x859950672e26c0f6e07bbdb007fb2527865f809574b8bd77d25fa48d001f29dd>  | Gas Reimbursement                           |\n| Nonce 7             | multiSend   | 1.6586 ETH     | Team              | <https://etherscan.io/tx/0x3272e5f373acc958c643c5c81fa8b963e0f4dc4ca559bbce2e29289e2b872fb6>  | Expense reimbursement                       |\n| Nonce 6             | Sent        | 500,000 MOONEY | Bridging Wallet   | <https://etherscan.io/tx/0x89144fafb04a6f73dd660452dcc4d1d3e9856e93c9c0dcf78f535446bef9b585>  | For delegation as vMOONEY                   |\n| Nonce 5             | multiSend   | 2.08859 ETH    | Team              | <https://etherscan.io/tx/0x3aee0359e5e90587595e55744d8408b56960d218f7d60353e6dc9ddc79d19b67>  | Team MVP payouts                            |\n| Nonce 4             | Swap Owner  |                |                   | <https://etherscan.com/tx/0xb4e6169313a151e1d90337bc6bd3be942cfcee3e783d70a3789e1089843b4740> | Swapped Luffy for Mitchie                   |\n| Funding Transaction | Received    | 0.58971 ETH    | ZeroG MultiSig    | <https://etherscan.io/tx/0x84b3852fe3cf85343c98b143b6a02768053866bd6da47cab25dd04aaee682897>  | Name.get returning funds to run sweepstakes |\n| Nonce 3             | Sent        | 1 ETH          | Colin             | <https://etherscan.com/tx/0x87e8840e81d9ef1119ed3159fdc565f8fd8e676de98f3e6a90efa4e793d3f235> | Sent funds to name.get to run sweepstakes   |\n| Nonce 2             | Sent        | 0.054 ETH      | NeekoArt          | <https://etherscan.io/tx/0x8ad3d7d1f313f002801d579f64d7ff6498eafc8e72e21f59c75eabef79074c95>  | Bounty for NFT design                       |\n| Nonce 1             | Sent        | 0.11425 ETH    | Colin             | <https://etherscan.com/tx/0x8ad3d7d1f313f002801d579f64d7ff6498eafc8e72e21f59c75eabef79074c95> | Deploy sweepstakes contract                 |\n| Nonce 0             | Sent        | 97.72 ETH      | ZeroG Corporation | <https://etherscan.com/tx/0xa0f1926c3f4832cab01421c0f1b100bc0afa1ebbf697d927239042db933ded02> | Paying for the charter flight               |\n| Funding Transaction | Received    | 123.34 ETH     |                   | <https://etherscan.io/tx/0x65fdf0c002f494b6f932ab56805ed6b4d66b0f0f0a9339c12c5a7233833a3852>  |                                             |\n| Funding Transaction | Received    | 500,000 MOONEY |                   | <https://etherscan.io/tx/0x65fdf0c002f494b6f932ab56805ed6b4d66b0f0f0a9339c12c5a7233833a3852>  |                                             |\n| Safe Creation       | Created     |                |                   | <https://etherscan.io/tx/0xc58906c59d9b308aefa2b1336699c25f7cf70fc6153ffa939863b7c8c0324ae3>  |                                             |",
  "contributors": "[{\"Contributor\":\"Stellie\",\"Payout Address\":\"0x8C1Bf43198c5E7cAB13439e0C53A8650033d03ef\",\"Voting Address\":\"0x8C1Bf43198c5E7cAB13439e0C53A8650033d03ef\",\"Eth\":0.200,\"Mooney\":102889,\"Dai\":0},{\"Contributor\":\"Ari\",\"Payout Address\":\"0x2c485a4DaD1c1a6a031A6DB08D5212b74A4A50e7\",\"Voting Address\":\"0x2c485a4DaD1c1a6a031A6DB08D5212b74A4A50e7\",\"Eth\":0.298,\"Mooney\":66980,\"Dai\":0},{\"Contributor\":\"Christina\",\"Payout Address\":\"0x3ea48DFA0F7a57D08e3Dd093C78D1e300616B57d\",\"Voting Address\":\"0x3ea48DFA0F7a57D08e3Dd093C78D1e300616B57d\",\"Eth\":0.968,\"Mooney\":499163,\"Dai\":0},{\"Contributor\":\"Ryan\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Eth\":1.297,\"Mooney\":668777,\"Dai\":0},{\"Contributor\":\"Pablo\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Eth\":1.297,\"Mooney\":668777,\"Dai\":0},{\"Contributor\":\"Colin\",\"Payout Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Voting Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Eth\":0.419,\"Mooney\":215965,\"Dai\":0},{\"Contributor\":\"Mitchie\",\"Payout Address\":\"0xb1d4c1B9c8DA3191Fdb515Fa7AdeC3D41D014F4f\",\"Voting Address\":\"0x9fDf876a50EA8f95017dCFC7709356887025B5BB\",\"Eth\":0.599,\"Mooney\":308666,\"Dai\":0},{\"Contributor\":\"Ballack\",\"Payout Address\":\"0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0\",\"Voting Address\":\"0x6Ae385654CA814C5cAb3fF6a6deb420b681fE7A0\",\"Eth\":0.020,\"Mooney\":10187,\"Dai\":0},{\"Contributor\":\"Coordinape\",\"Payout Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Voting Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Eth\":0.010,\"Mooney\":5094,\"Dai\":0},{\"Contributor\":\"Luffy\",\"Payout Address\":\"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\",\"Voting Address\":\"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\",\"Eth\":0.101,\"Mooney\":51969,\"Dai\":0}]"
}
