{
  "body": "# **MoonDAO Entities: Final Report**\n\n\n# **Original Proposal**\n\n**Link to Original Proposal:** \n\n[MDP-126: MoonDAO Entity Creation](https://docs.google.com/document/d/1WjfiuoejqPf1WSNeHq32UpYaqkWeOBY2wa2TP3685mk/edit?usp=sharing)\\\n**Original Abstract:** \n\nToday at MoonDAO we have a method for individuals to join MoonDAO and participate in projects, governance, and incentives. However, we don’t have a simple method of onboarding an existing entity and creating an account for them at MoonDAO to participate as a private entity.\n\n<!--StartFragment-->\n\nThis was one of the original goals of the Project system, where each Project would be treated as a private organization, however in practice the nature of Projects makes them much more tied to MoonDAO processes and governance, with many stipulations and understanding of lengthy documentation that needs to be comprehended before diving in as a project. Also, since Projects end and do not continue on indefinitely, there is no stable primitive to represent a group of people onchain. In contrast, entities can exist indefinitely, have no impact on governance or incentives, and can then opt-in to work on one (or many) projects and receive incentives for doing so.\n\nThis proposal aims to establish an onboarding flow for private entities to “build on MoonDAO,” such that they can create an onchain account with MoonDAO using Gnosis. Then, that account can participate as a private entity. The benefits of doing so would be clearly outlined and through a small registration fee will also be a source of income for the DAO. Entities could range from startups,  newly formed entities that do contract work for MoonDAO within Projects, nonprofits, existing companies that want to be competitors in Prizes, or create their own Projects.\n\nPreviously we tried to define a Partnership process to onboard entities using a more white-glove approach, however this still made it difficult for our partner entities to collaborate since often they don’t have an onchain way of interfacing with our governance or incentives in a simple way. So, even though we converted a few organizations, getting them to build on MoonDAO and follow through was difficult.\n\nSome potential first users of this system would be entities that we’ve onboarded as partners in the past like: Intuitive Machines, CryoDAO, DeSci Labs, Future Folklore, Lifeship, The Mars Society, Space For A Better World or other teams we are actively collaborating with and want to develop deeper relationships with like Nance, Juicebox, Gnosis, Hats Protocol, or startups that spin out of MoonDAO like Spacetime, or future “MoonDAO Labs” like entities that have their own container outside of governance.\n\nThis proposal aims to make a simple and straightforward flow for entities to build on MoonDAO without having governance requirements or complicated incentive systems built in, and instead they can opt into those systems through Projects or Prizes through their membership management portal.\n\n\n# **Results**\n\nAll results are live on <https://app.moondao.com>. What we’ve created can be split into two categories: Entity and Citizen creation.\n\nEntities can be created after completing a simple form, and designing an image that will represent them onchain. Then, in one transaction, they can mint their entity. From there, they can manage their entity using the management page, and view their entity in the Directory where all entities are listed. Under the hood entities come equipped with a Gnosis treasury and a Hats tree to easily manage their organization through our UI.\n\nCitizens, likewise, can be created using a similar flow to Entities, and have similar features to manage and explore citizens via the Citizen management page and Directory, respectively. Citizens don’t link to a Gnosiis or a Hats protocol.\n\nBoth NFTs are a custom subscription contract that renews yearly, bringing onchain revenue to the DAO in a recurring manner.\n\n1. **Objective: Create a new Entity onboarding flow**\n\n   1. **Key Result**: Form creation through the app\n\n      1. **Results**: Done through typefully we have a flow that can be submitted through the app.\n\n   2. **Key Result**: Sends for approval and invitation to move forward\n\n      1. **Results**: This is done permissionlessly at the moment, allowing anyone to build on moondao. We may modify this as we go, since there’s an onchain method to add a whitelist for approval.\n\n   3. **Key Result**: Creates a beautiful onchain Entity NFT and Gnosis for the entity\n\n      1. **Results**: We create a starry night from the location and time that you mint, and allow you to customize the NFT by uploading your logo and have that intermix with the generated art.\n\n   4. **Key Result**: Records information about the user within our backend\n\n      1. **Results**: We use typefully responses to store contact information privately for each Entity. The majority of the Entity information is written onchain.\n\n   5. **Learnings**: We had a tight timeline, but this helped us focus our efforts and get a lot done in a short amount of time. Task dependencies were a hurdle, causing some slowdowns and coordination failures. Ensuring people know when they are blocking others and holding them accountable to due-dates would help improve the speed.\n\n   6. **Maintenance**: A follow-on project is going to be created that onboards our first users of Entities at a discounted rate and supports the maintenance of the project over time.\n\n   7. **Grade:**  _Superb_****\n\n2. **Objective: Improve existing Citizen onboarding flows**\n\n   1. **Key Result**: Remove explorer role\n\n      1. **Results**: The entire current flow is being replaced with a Citizen NFT flow.\n\n   2. **Key Result**: Create a form through the app, records to our backend\n\n      1. **Results**: Done through typefully we have a flow that can be submitted through the app. We use typefully responses to store contact information privately for each Entity. The majority of the Entity information is written onchain.\n\n   3. **Key Result**: Create a beautiful Citizen NFT that represents their onchain identity at MoonDAO\n\n      1. **Results**: This deliverable is still outstanding at the moment. We are waiting on the NFT artist to send us the Citizen creation flow.\n\n   4. **Learnings**: Citizen creation was very similar to Entities, we spent 95% of the time focusing on the Entity flow, and then the Citizen flow was relatively quick to complete. However, there are still a couple of things left.\n\n   5. **Maintenance**: We’re going to roll out citizen NFTs at a large discount for existing Citizens, and use a follow-on project to maintain and improve the flow.\n\n   6. **Grade:**  Exceeds Expectations****\n\n3. **Objective: Create an Entity and Citizen management portal within the MoonDAO App**\n\n   1. **Key Result**: Make it simple to edit their bios, onchain signers etc\n\n      1. **Results**: This is done via an IPFS, allowing the admin of the entity to edit the entity metadata. For Citizens, the owner of the NFT can edit the metadata.\n\n   2. **Key Result**: Can purchase more MOONEY or Stake more MOONEY through the portal\n\n      1. **Results**: Completed.\n\n   3. **Key Result**: See onchain analytics for their entity (account balances etc.)\n\n      1. **Results**: Completed. You can see the amount of ETH (or native currency), MOONEY, members, bio, and a list of user actions.\n\n   4. **Key Result**: Get verified through gitcoin passports\n\n      1. **Results**: There’s a link to go create or renew your passport.\n\n   5. **Key Result**: Export their wallet\n\n      1. **Results**: This is still in the governance page, not sure if this will be needed since we don’t know for sure that people are using the \n\n   6. **Learnings**: We will continue to improve this page, so far we have some basics and we’ll see what gets the most usage and what features people ask for.\n\n   7. **Maintenance**: Something that’s a little tricky is that if you’re signed in with a wallet we’d like for your citizen profile to be the first thing you see, along with your entities. This can be done in a follow-on project.\n\n   8. **Grade:** Exceeds Expectations\\\n      ****\n\n4. **Objective: Create a MoonDAO Directory to view existing entities and citizens**\n\n   1. **Key Result**: View the NFTs, names, contact, and bios for each Citizen of MoonDAO\n\n      1. **Results**: Completed. However, we don’t show the contact information in the Directory page.\n\n   2. **Key Result**: Same for MoonDAO Entities\n\n      1. **Results**: Completed.\n\n   3. **Learnings**: N/A\n\n   4. **Maintenance**: We’ll continue to improve this in a follow-on project.\n\n   5. **Grade:** Superb\n\n\n# **Member Contributions**\n\n**@pmoncada:** Authored the original proposal outlining the work we’d do, hired the team, and led daily standups to organize the execution of the project. Reviewed everyone’s work throughout the project and tried to identify blockers and remove them so the team can move quickly.\n\n**@name.get:** Created the frontend for the new onboarding flow and citizen/entity management pages. I also assisted with creating the frontend for the directory page.__**@shelden:** Implemented the ERC5643 subscription NFT smart contracts allowing MoonDAO and registered entities/individuals to manage entity membership, entity metadata, entity active members, and permissions. Implemented EntityCreator smart contract to batch entity registry-related function signs to achieve a better user experience. Built the directory page to search and display entities/individuals. Helped **@name.get** with styling and component implementation for onboarding flow, and join page.\\\n\\\n**@Fiyin:** Created the wireframes and low level designs for the entities. I also designed the high level UI/UX flow for entities and citizens, management pages and entity directories.\n\n**@Santiago:** I've been developing a system for 2 interactive image generators for the citizen and entity roles in the Dapp. It works with html + svg + css + javascript, using several libraries and known algorithms, and also uses Astronomical data. The generators are web-based compositions. Each has a standalone version and a react implementation.\n\n\n# **Reward Distribution**\n\n[Link to the Coordinape](https://app.coordinape.com/circles/30549/members)\n\n|                 |                        |                                      |                                            |                                            |\n| --------------- | ---------------------- | ------------------------------------ | ------------------------------------------ | ------------------------------------------ |\n| **Member Name** | **% of total rewards** | **Upfront Payment**                  | **Wallet to receive ETH**                  | **Wallet to receive MOONEY**               |\n| _@_pmoncada     | 23                     | $4,500 + $1,150 Flex Bonus*** $5,650 | 0x679d87D8640e66778c3419D164998E720D7495f6 | 0x679d87D8640e66778c3419D164998E720D7495f6 |\n| @name.get       | 27.6                   | $4,500 + $1,380 Flex Bonus*** $5,880 | 0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6 | 0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6 |\n| @shelden        | 26.2                   | $4,500 + $1,310 Flex Bonus*** $5,810 | 0xc2BCF46CBC9F4CedA617cB41F2158BE525dD008b | 0xc2BCF46CBC9F4CedA617cB41F2158BE525dD008b |\n| @fiyin          | 16                     | $2,250 + $800 Flex Bonus***$3,050    | 0x2753c791bCA3667f10800262FCB0168269e12DC5 | 0x2753c791bCA3667f10800262FCB0168269e12DC5 |\n| @santiago       | 7                      | $1,500 + $350 Flex Bonus***$1,850    | 0xad43D363701Ed3EFC1263DC4b658745fA3E90e4B | 0xad43D363701Ed3EFC1263DC4b658745fA3E90e4B |\n| Coordinape      | 0.2                    | NONE + $10 Flex Bonus***$10          | 0x15B513F658f7390D8720dCE321f50974B28672EF | 0x15B513F658f7390D8720dCE321f50974B28672EF |\n\n\n# **Treasury Transparency**\n\n[Link to Treasury](https://app.safe.global/transactions/history?safe=eth:0x82B5614e2C3c9963C2d6645558f30e032003C699) \\\n\\\nThe final treasury reimbursement is outstanding, but will be executed prior to distribution pool calculations\n\n|                     |            |                  |               |                                                                                               |                        |\n| ------------------- | ---------- | ---------------- | ------------- | --------------------------------------------------------------------------------------------- | ---------------------- |\n| **Txn Title**       | **Reason** | **Amount**       | **Recipient** | **Etherscan Link or Gnosis Link**                                                             | **Deliverable**        |\n| Nonce 4             | Sent       | 2.57611 ETH      | tomoondao.eth | <https://etherscan.io/tx/0xb8f1f40b9c72c30acd21234eb3dd5943d49633f1107af92a773fe886faa243b9>  | Treasury Reimbursement |\n| Nonce 3             | Sent       | 0.02538755571ETH | Mitchie       | <https://etherscan.io/tx/0x55d26161aaec71415035a36c8d3a19c9bb3411950a7276d32e2e32bf2af2683f>  | Gas Reimbursement      |\n| Nonce 2             | multiSend  | 4.1392 ETH       | Team          | <https://etherscan.io/tx/0x425c32e5bb9b7a66337b763e6cca549927827a41fed4bf1a6533cb03912d2b36>  | Team Payment           |\n| Nonce 1             | Sent       | 0.21492 ETH      | Santiago      | <https://etherscan.com/tx/0xe0104f1b92b0c60f1af3ffe484c6c3c09799110f79a5abc2aa4e876da6bcae06> | NFT Commission         |\n| Nonce 0             | multiSend  | 2.421437053 ETH  | Team          | <https://etherscan.com/tx/0x7cbd1c86e6e592325a1a5e2844f734b12465c5ea87ea4f766024aef635a7c426> | Team Payment           |\n| Funding Transaction | Receive    | 9.37706 ETH      |               | <https://etherscan.com/tx/0x4a6fef8eda30f1f4bca0cafe025e4a9557b753ede1d2c1f864e6e85b9f9c585d> |                        |\n| Safe Creation       |            |                  |               | <https://etherscan.io/tx/0x938ae8c5fc12f8ed46ebdd526d1027af27890f6b405c43370b489cbad3062a3f>  |                        |\n",
  "contributors": "[{\"Contributor\":\"Pablo\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Eth\":1.725,\"Mooney\":443206,\"Dai\":0},{\"Contributor\":\"Shelden\",\"Payout Address\":\"0xc2BCF46CBC9F4CedA617cB41F2158BE525dD008b\",\"Voting Address\":\"0xc2BCF46CBC9F4CedA617cB41F2158BE525dD008b\",\"Eth\":1.773,\"Mooney\":504869,\"Dai\":0},{\"Contributor\":\"Fiyin\",\"Payout Address\":\"0x2753c791bCA3667f10800262FCB0168269e12DC5\",\"Voting Address\":\"0x2753c791bCA3667f10800262FCB0168269e12DC5\",\"Eth\":0.931,\"Mooney\":308317,\"Dai\":0},{\"Contributor\":\"Colin\",\"Payout Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Voting Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Eth\":1.795,\"Mooney\":531847,\"Dai\":0},{\"Contributor\":\"Santiago\",\"Payout Address\":\"0xad43D363701Ed3EFC1263DC4b658745fA3E90e4B\",\"Voting Address\":\"0xad43D363701Ed3EFC1263DC4b658745fA3E90e4B\",\"Eth\":0.931,\"Mooney\":134889,\"Dai\":0},{\"Contributor\":\"Coordinape\",\"Payout Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Voting Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Eth\":0.007,\"Mooney\":3854,\"Dai\":0},{\"Contributor\":\"JigglyJams\",\"Payout Address\":\"0x25910143C255828F623786f46fe9A8941B7983bB\",\"Voting Address\":\"0x25910143C255828F623786f46fe9A8941B7983bB\",\"Eth\":0.079,\"Mooney\":40568,\"Dai\":0},{\"Contributor\":\"Mitchie\",\"Payout Address\":\"0xb1d4c1B9c8DA3191Fdb515Fa7AdeC3D41D014F4f\",\"Voting Address\":\"0x9fDf876a50EA8f95017dCFC7709356887025B5BB\",\"Eth\":0.039,\"Mooney\":20284,\"Dai\":0},{\"Contributor\":\"Ryan\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Eth\":0.039,\"Mooney\":20284,\"Dai\":0},{\"Contributor\":\"Phil\",\"Payout Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Voting Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Eth\":0.039,\"Mooney\":20284,\"Dai\":0}]"
}
