{
  "body": "# **2nd Astronaut Support Q2: Final Report**\n\n\n# **Original Proposal**\n\n**Link to Original Proposal:**[**MDP-142: 2nd Astronaut Support Q2**](https://docs.google.com/document/d/13HaAKUfhFi10M7A6rdNipc6SjnnGhf52VGhW8PtGcRE/edit?usp=sharing)\\\n**Original Abstract:**This no-MVP proposal aims to orchestrate a small support team surrounding Dr. Eiman Jahangir's forthcoming launch as a representative of MoonDAO. This team will perform outreach for publicity and coverage via various media platforms, including podcasts, articles, and videos, to get the word out about the launch and Eiman, increase community involvement, and generate social media content. It will also lay the groundwork with tangible ideas for ways to engage the MoonDAO community and wider space enthusiast communities in a participatory manner, soliciting physical or digital contributions for inclusion in Eiman’s mission and organizing on the ground events to commemorate his journey. As well as identifying possible medical or scientific research that can be performed on his sub-orbital flight and contribute to human spaceflight knowledge. \n\n\n# **Results**\n\n<!--StartFragment-->\n\n1. **Objective:** Publicity and Coverage for Eiman's Forthcoming Launch\n\n   1. **Key Result**: Secure coverage on at least 5 podcasts, 3 articles in print or online publications, and 2 video interviews during Q2\n\n      1. **Results**: _Completed 11 media (podcasts or news interviews) with 9 published to as of 7/6/2024. More podcasts on the way. One interview for VUMC Reporter Published. One interview for a print article for “Florida Today” completed but not yet printed. One television piece on Nashville, TN WKRN News Channel 2 that has been picked up by News Nation, Yahoo, Google, and Doximity, both national reach networks. The TN State Legislature also passed a resolution honoring Eiman’s upcoming flight. The local NPR station (WPLN Nashville) had a 1 minute piece during the news hour about the flight._ \n\n      2. **Learnings**: _The team did a good job identifying potential interviewers. Things that went wrong included Eiman’s schedule including a planned vacation that delayed some interviews. Additionally, many agencies want to interview Eiman closer to the launch or after the launch. Also, a cadence of one or two interviews a week is the right pace for maintaining momentum and Eiman’s schedule._\n\n      3. **Maintenance**: _We have created an ongoing, frequently updated Google Sheets document for media outlets we have contacted and where we stand in the process of interviewing. We will reach out to other, non-space related media._\n\n2) **Key Result**: Reach a cumulative audience of at least 100,000 individuals across all media platforms by the end of Q2\n\n   1. **Results**: This is difficult to assess but I suspect we have come close, if not surpassed this. The WKRN News 2 piece played on local news networks in MIddle Tennessee and probably reached 100,000 individuals. Additionally, Doximity, yahoo, and google picking up the piece expanded this reach. Additionally, WPLN, the local NPR station, played a one minute news piece about the upcoming flight. MoonDAO regularly emails the news pieces forward and also increases viewing.\n\n   2. **Learnings**: Increasing Social Media presence is key to increasing the audience viewing these items. Additionally, doing local news media can lead to increased press as larger entities pick up the story. \n\n   3. **Maintenance**: We will continue to work on Eiman’s brand and increasing his social media account followings. The bigger question is how we can further engage the audience and have them come into MoonDAO’s larger mission and continue to follow both MoonDAO and Eiman. \n\n**Grade:**  _How well did you do on the original objective?_\n\nMeets Expectations = The project met all its original goals and sufficiently hit all the criteria. We have been able to reach out to media outlets and were only shy 1 article in print/on line and 1 video interview. We likely reached 100,000 people based on the feedback I have seen.  \n\n****\n\n2. **Objective:** Plan MoonDAO Community Engagement and Participation\n\n   1. **Key Result**: Plan an outreach campaign to receive physical or digital contributions (TBD) from at least 100 MoonDAO members for inclusion in the mission\n\n      1. **Results**: This is a work in progress. We have discussed both a patch design competition (decided against this) and requesting photos from individuals in the community for incorporation into physical or digital payload on the flight (decided against). For now we are leaning towards space flown patches and stickers that can be given to community members. \n\n      2. **Learnings**: We did reach out to professional designers to do a patch design competition but found the process to be complicated. Therefore, a community member, Andrew Parris, has taken the lead on this design. \n\n      3. **Maintenance**: Continue to discuss the program in our weekly meeting.\n\n2) **Key Result**: Identify how we will pay homage to Yan Kejun and the CN community during this launch\n\n   1. **Results**: We have not met this objective. We have yet to discuss this in detail but I would recommend offering Yan some space in the payload to send a photo of his family or some other keepsake to space. \n\n   2. **Learnings**: No new learnings. \n\n   3. **Maintenance**: We need to start including this in our weekly conversation going into Q3.****\n\n3) **Key Result**: Initial planning for an on-the-ground event surrounding the launch (date TBD), with attendance from MoonDAO members, as well as I24 and the wider space community\n\n   1. **Results**: Outside of MoonDAO, I24 has discussed an event around the launch, but solidifying plans has been delayed until we have a better sense of the launch date. We have discussed with Blue the capacity limits for event attendance on site along with potential overflow to a publicly accessible viewing site. We plan to do a similar model as the MoonDAO proposal for Coby Cotton’s launch, including a small travel stipend and a budget for on the ground activities.\n\n   2. **Learnings**: No new learnings.\n\n   3. **Maintenance**: We will approach this in the future once the crew is announced.****\n\n4) **Key Result**: Initial planning for a virtual launch day event or watch party for those who can’t be there in-person and to include the wider community\n\n   1. **Results**: We have not started planning this. Solidifying plans has been delayed until we have a better sense of the launch date. \n\n   2. **Learnings**:  No new learnings. \n\n   3. **Maintenance**: We will approach this in the future once the crew is announced.****\n\n5) **Key Result**: Maintain interest as we await launch by fostering discussions and interactions among the MoonDAO community and wider space enthusiast communities through at least one social media post per week about this launch or Eiman\n\n   1. **Results**: We continue to engage in Discord and in our weekly meetings. The MoonDAO newsletter continues to post about the launch. New press coverage is also shared on socials for each interview/podcast/video. \n\n   2. **Learnings**:  No new learnings. \n\n   3. **Maintenance**: I suspect interest will increase once we are closer to launch.****\n\n**Grade:**  Does not meet expectations. While we have discussed these items, we have not focused on them due to lack of launch date. I would say we have maintained interest in MoonDAO and the launch. We are having new members find us on Discord through various posts and podcasts.****\n\n3. **Objective:** Identify Opportunities for Medical or Scientific Research\n\n   1. **Key Result**: Compile a list of five to ten potential medical or scientific research projects that could be conducted during suborbital flights\n\n      1. **Results**: We have discussed with various groups potential research but need Blue Origin to sign off on any future research. Research ideas include wearing a telemonitoring vest to assess heart rate, respiratory rate, and temperature. \n\n      2. **Learnings**: Teaming up with other groups is likely the best way to accomplish this goal. \n\n      3. **Maintenance**: Eiman will discuss with the Blue Origin team again on his upcoming calls on how to get research approved.  \n\n2) **Key Result**: Begin a dialogue with at least 3 research institutions or organizations specializing in space-related research to identify priorities.\n\n   1. **Results**: We have talked to someone from UT Dallas (Ben Levine), SpaceX physician, IIAS, and AstroSkin. \n\n   2. **Learnings**: At this time, projects are on hold until we get an idea what Blue Origin will allow. Eiman has laid out what he is willing to do and not do on a short sub orbital flight. \n\n   3. **Maintenance**:  Continue talking with Blue Origin.****\n\n3) **Key Result**: By the end of quarter, identify 1-3 feasible and desirable passive medical or scientific research projects to be conducted during Eiman's mission, along with any associated costs, potentially across a set of different price ranges\n\n   1. **Results**: We have identified feasible medical projects but need formal approval to advance. \n\n   2. **Learnings**: Best to engage Blue Origin early in the process\n\n   3. **Maintenance**: We will continue talking with Blue Origin to see what they will approve. \n\n\n# **Member Contributions**\n\n**@ryand2d:** Contacted a handful of outlets including the published Space and Things podcast, Ellie in Space (pending for future), sharing and publishing all media, gathering intel from a handful of space medicine researchers to see what might be possible, meetings and coordination with Blue about logistics for the launch event, pull requests to add content to MoonDAO’s press coverage page linked below, and high level coordination with the team.\n\n**@dreimanj:** Eiman Jahangir has been actively involved in identifying and reaching out to news media partners and podcasts. He has completed 11 interviews to date with more planned. See below for links to published media as of 6/18/2024. \n\nHe also completed a photo shoot on 6/24 where he wore the MoonDAO t-shirt for further marketing needs. He is paying for most of this out of his own budget. He is also working on building a website and increasing social media awareness which will also increase awareness of MoonDAO’s mission.**@i24titan**: Andrew Parris researched and contacted over 25 Space/Science related outlets (TV stations, newspapers, websites, podcasters & YouTubers) to offer Eiman for interviews to talk about MoonDAO’s 2nd Astronaut program. A good portion showed interest, but some wanted to wait till closer to flight or to interview post-flight. Recently he broadened the types of outlets to include Medical/Cardiology and Iranian-American. Planning to explore additional outlets.\n\nAndrew is also working on a possible community Commemorative Patch Design contest with the winning design being flown aboard Eiman’s flight and given to the winning artist.\n\n**Published articles/podcasts to date**\n\nSee also [Press Coverage](https://docs.moondao.com/Press/Press-Coverage)\n\n|                                                                                                                                        |\n| -------------------------------------------------------------------------------------------------------------------------------------- |\n| <https://news.vumc.org/2024/04/24/eiman-jahangir-to-realize-lifelong-dream-to-fly-to-space/>                                           |\n| <https://astroben.libsyn.com>                                                                                                          |\n| <https://www.wkrn.com/news/local-news/nashville/vanderbilt-doctor-to-go-to-space-on-blue-origin-flight-fulfilling-decades-long-dream/> |\n| [https://www.newsnationnow.com](https://www.newsnationnow.com/)                                                                        |\n| <https://spaceandthingspodcast.com/>                                                                                                   |\n| <https://www.youtube.com/@AstroEliza>                                                                                                  |\n| [https://www.interplanetary.org.uk](https://www.interplanetary.org.uk/)                                                                |\n| <https://wpln.org>                                                                                                                     |\n| <https://www.youtube.com/watch?v=JRpbY3BMJy0&start=4>                                                                                  |\n\n\n# **Reward Distribution**\n\n|                 |                        |                     |                                            |                                            |\n| --------------- | ---------------------- | ------------------- | ------------------------------------------ | ------------------------------------------ |\n| **Member Name** | **% of total rewards** | **Upfront Payment** | **Wallet to receive ETH**                  | **Wallet to receive MOONEY**               |\n| _@ryan2d2_      | 30%                    | None                | 0x78176eaabcb3255e898079dc67428e15149cdc99 | 0x78176eaabcb3255e898079dc67428e15149cdc99 |\n| @dreimanj       | 30%                    | None                | 0xe2d3aC725E6FFE2b28a9ED83bedAaf6672f2C801 | 0xe2d3aC725E6FFE2b28a9ED83bedAaf6672f2C801 |\n| @i24Titan       | 40%                    | None                | 0x86c779b3741e83A36A2a236780d436E4EC673Af4 | 0x86c779b3741e83A36A2a236780d436E4EC673Af4 |\n\n\n# **Treasury Transparency**\n\n[_Link to Treasury_](https://app.safe.global/balances?safe=eth:0xFFe1bcF92156f50c78F0B6dE4B5fAa3fAA6AdB52) __\n\n|               |                        |            |                |                                                                                              |                                                                          |\n| ------------- | ---------------------- | ---------- | -------------- | -------------------------------------------------------------------------------------------- | ------------------------------------------------------------------------ |\n| **Txn Title** | **Reason**             | **Amount** | **Recipient**  | **Etherscan Link or Gnosis Link**                                                            | **Deliverable**                                                          |\n| Nonce 2       | Treasury Reimbursement | 0.1416 ETH | Main Treasury  | <https://etherscan.io/tx/0xd02d97a342309fa77e291e836a7d9fa711db724b5262b79d8949b915eadfe39b> | Reimbursement                                                            |\n| Nonce 1       | Gas Reimbursement      | 0.0055 ETH | Eiman Jahangir | <https://etherscan.io/address/0xe2d3aC725E6FFE2b28a9ED83bedAaf6672f2C801>                    |                                                                          |\n| Nonce 0       | Photoshoot             | 0.17 ETH   | Eiman Jahangir | <https://etherscan.io/tx/0x682c2f2361124b04fcbd6793ef4326df31b3678765a5b5c8cc9e1fbfcbc665c4> | Photos for MoonDAO to use. <https://photos.app.goo.gl/SgsNcn7WUBhtzMn56> |\n| Safe Creation |                        |            |                | <https://etherscan.io/tx/0x4acdcdd07a5daf4762488350f2acf4f4b1b92d1e32b7f67cdb332bd12feccc41> |                                                                          |\n\n",
  "contributors": "[{\"Contributor\":\"ryand2d\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0xB2d3900807094D4Fe47405871B0C8AdB58E10D42\",\"Eth\":1.1385,\"Mooney\":692042,\"Dai\":0},{\"Contributor\":\"dreimanj\",\"Payout Address\":\"0xe2d3aC725E6FFE2b28a9ED83bedAaf6672f2C801\",\"Voting Address\":\"0xe2d3aC725E6FFE2b28a9ED83bedAaf6672f2C801\",\"Eth\":1.1385,\"Mooney\":692042,\"Dai\":0},{\"Contributor\":\"i24titan\",\"Payout Address\":\"0x86c779b3741e83A36A2a236780d436E4EC673Af4\",\"Voting Address\":\"0x86c779b3741e83A36A2a236780d436E4EC673Af4\",\"Eth\":1.5181,\"Mooney\":922723,\"Dai\":0}]"
}
