{
  "body": "# **Onboarding Improvement: Final Report**\n\nReference:[MoonDAO Final Report Reference](https://docs.google.com/document/d/16F-_bcC0C4889YmuQl6WWChDKQObHhmfjasDna0wOmk/edit?usp=sharing)<- Please read before adding contributions!\n\nOriginal Proposal: [MDP-113: Onboarding Improvement](https://docs.google.com/document/d/1wIEwy850HpUg4EZoXvC_rykHohQpQdTFd7KjoEtf0HE/edit?usp=sharing)\n\n\n## Summary\n\nThe onboarding improvement project worked in tandem with the sweepstakes project, with the intent to ease the process and number of steps involved in obtaining MOONEY for the purpose of minting an entry.\n\n\n## Results\n\n1. **Objective: Create an all-in-one and streamlined onboarding experience before the sweepstakes is launched in November**\n\n   1. **Key Result**: Less than five minutes to go from no-wallet to fully onboarded member\n\n      1. **Results**: [Mission Control App](https://app.moondao.com/)\n\n      2. **Learnings**:\\\n         While we made significant progress in this regard by incorporating a direct fiat to MOONEY onramp, we uncovered some limitations such as bank restrictions and KYC processes that still take considerable time.\\\n         \\\n         A major development was the implementation of joining tiers, dramatically reducing the potential of analysis paralysis by reducing the number of decisions.\n\nThere is room for improvement in potentially batching transactions so the user only needs to sign once and then each of them gets completed under the hood. However due to time constraints adding that level of automation wasn’t within scope. MoonPay was another limiting factor for the process, signing up with a credit card sounds great in theory, but creating a MoonPay account is tedious and requires a lot of personal information including your SSN, furthermore MoonPay isn’t accepted by many banks, so many had to go through Coinbase to acquire MATIC. Creating a Coinbase account also takes a long time, and then you cannot withdraw for a number of days from that account.  \n\n3. **Maintenance**: Server maintenance to be handled under the scope of the Webmaster V2 proposal.\n\n4. **Team’s Self-Reported Score**: \n\n5. **Team Contributions**\n\n******Anna:** \n\n\\- I went through user experience of current onboarding creating a detailed document with all the flaws and issues to correct: [link](https://docs.google.com/document/d/12MYgW2JlaphNfSPFJ_xw2EMPqsjwPGPpaGIY5cCbJsI/edit?usp=sharing);\\\n\\- Gave detailed suggestions on how to improve MoonDAO onboarding app, including mocking alternative designs and sharing how to prioritize design changes: [link](https://www.figma.com/file/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?type=design\\&node-id=1850%3A3816\\&mode=design\\&t=Q6oLKDXFufLS7kaT-1);\\\n\\- Collected feedback on the UX from non-web3 users and shared with the team\\\n**Colin:** \n\n\\- Created initial join page with checkout and next steps\n\n\\- Reviewed and provided feedback on designs and pull requests**Eliot:** \n\n\\- Conducted a thorough evaluation of the entire design to assess the full user experience flow.\\\n\\- Implemented a component section facilitating the rendering of all steps in the order specified in the design.\\\n\\- Introduced a progress bar to enhance the user flow through various onboarding steps.\n\n**Fiyin:** \\\n\\- I did a thorough research before diving into the onboarding flow designs\\\n\\- I designed the UI/UX for the Onboarding Improvement\\\n\\- Worked with Pablo to add more features to the app. I also ensured there is a lot of consistency across the designs\\\n\\- Implemented UI/UX improvements suggested by Anna and Pablo\\\n\\- Implement a new color scheme and the some graphics/illustrations suggested by Mitchie\\\n**Larrotiz:** \n\n\\- Extensively tested the onboarding flow to find technical bugs and design improvements to record on the bug and features list.\n\n\\- Fixed many bugs and implemented suggestions from the bugs and features list.\\\n**Mitchie:**\n\n\\- Provided general feedback to help streamline process design, including recorded live sessions with a non-web3 user and feedback on team calls.\\\n**Pablo:** \n\n\\- Made contact with the Privy team to integrate them into our app. Reviewed various other options like ThirdWeb, other EIP4337 etc, and then made the call to move forward with Privy. Integrating Privy was probably the biggest difference in ease of onboarding new members to the App that previously did not have a wallet. Colin is mostly responsible for the implementation of Privy.\n\n\\- Given the state of crypto today, our onboarding for non-web3 users I think is the gold standard for apps. You can access MoonDAO via an email or phone number, but the onramping solutions are still very limited. In total I was involved in authouring, reviewing, or fixing / implementing over [100 bugs and features](https://docs.google.com/document/d/19ScnxapspsDmZsrrPx2h0LLrPqX-UcDZXhNCDDclvX8/edit) associated with the onboarding and sweepstakes minting process.\n\n**Ryan:**Thorough review of full process at both high level flow and experience to more of the minutiae, involved in 28 bugs and features. Ensured that we had GA4 analytics installed on the new app (installed by Colin) across all pages and testing to ensure that we are receiving data in dashboard to help measure overall activity on the full site (previously only had GA on landing page but zero knowledge of the Mission Control App usage).\n\n2. **Key Result**: Less than 3 user decisions for “quick-start” onboarding\n\n   1. **Results**: [Onboarding Flow Figma](https://www.figma.com/file/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?type=design\\&node-id=2149-4372\\&mode=design\\&t=2yFSyvTNsBgubkrs-0)\n\n   2. **Learnings**: Membership tiers provide the most intuitive way for members to get engaged without needing the full context of staking and vMOONEY, which create significant hurdles to action.\n\n   3. **Maintenance**: None\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions**\n\n**Anna:** \\\n\\- Identified next steps after the onboarding and designed a mock for the final screen of the onboarding app\\\n**Colin:** \n\n\\- Integrated uniswap and privy into the app\n\n\\- Created initial checkout components**Eliot:** \\\n-  Implemented the necessary steps for quick user onboarding.\n\n\\- Developed the checkout flow and the next steps flow.\\\n\\- Worked on integrating an in-app calendly pop-up, allowing users to easily schedule onboarding calls\\\n**Fiyin:** \n\n                 - Resigned the complete app UI/UX which includes: The homepage,\\\nGovermace, Marketplace, Join MoonDAO and External Links. I also implemented\\\nsome early sketches designed by Pablo into the design flow. I designed each of the\n\npage UI that links to other design pages of the app. I implemented the membership icons designed by Mitchie.\n\n\\- I designed the Membership tier UI/UX and implemented a lot of feedback from the Sweepstakes and Onboarding improvement team.\\\n**Mitchie:** Help design icons to represent the membership tiers\n\n**Pablo:** [Designed the early sketches](https://www.figma.com/file/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?type=design\\&node-id=1659-34\\&mode=design) (See Figma: Components > Home for the first pass, and then a more refined version Fiyin put together under it) for the onboarding flow with Fiyin to reduce the number of decisions required to join MoonDAO. Originally we had the user configure the lock page and choose the amount of MOONEY required, our breakthrough was to break things up into three separate tiers to resemble something closer to a web2 app sales flow. I designed each of the benefits of each tier, made decisions about the pricing and lock amounts, wrote the copy for each step of the onboarding process from welcome to next steps, helped design each of the pages for each step, and then primarily worked with Colin to automate the signing steps required afterwards. Received a ton of feedback and help from other members of the team to improve the process and gather bugs from new users to continually refine the experience.\n\n**Ryan:** Did a lot of high level feedback on the overall user flow and experience, pushing for a more web2 familiarity and things like the [three membership tiers](https://discord.com/channels/914720248140279868/1122978203741466705/1163926470247338106) (further ideated on with Pablo in-person in Houston), a total reorder of the flow and menu of the app (welcome page with video and why join first step instead of getting thrown into what is currently the governance page with full functionality, essentially hiding the buy mooney and lock mooney pages or burying that under the membership tier flow now ie custom membership, and so forth). [See my comparison of our app flow compared to other space entities](https://docs.google.com/document/d/1mwLU02WiQrncifKpM-zfQfrrk_YoS4_b1dCzBb4Xe9U/edit?usp=sharing). Trying to tackle things from a non-web3 users perspective especially, focusing on the number of clicks and steps to go from top of funnel (likely social media) to Moondao.com to the app, to join, to actually being able to enter. Helped determine benefits of each tier and wrote the copy. Also captured in our bug doc which is for both sweepstakes/onboarding projects.****\n\n3. **Key Result**: Create a protocol and hire onboarding specialists with multiple languages and worldwide coverage available to support and attest to “liveness” and uniqueness\n\n   1. **Results**: Changes to the rules, limitations, and means of entry, solved for these challenges and removed the requirement of verification calls.\n\n   2. **Learnings**: Soul-binding and inscribing encrypted identity details on minted tickets provide better means of protection against botting and manipulation.\n\n   3. **Maintenance**: None\n\n   4. **Team’s Self-Reported Score**: 0.1\n\n   5. **Team Contributions** \n\n******Anna:** \\\n\\- Worked on identifying onboarding action items for new community members: [link](https://www.figma.com/file/gNq8BNKk8uNori01LzTAY1/MoonDAO-Onboarding-Calls?type=whiteboard\\&node-id=0-1\\&t=zV1qapGm1TySr4Z4-0);\\\n\\- Developed an onboarding deck and presented it on welcome calls: [link](https://pitch.com/public/7d932cea-afe9-4253-8d31-a8748d3f212a);\\\n\\- Researched liveness verification providers and created recommendations: [link\\\n********](https://www.figma.com/file/vnEBbKwB72mIigzNjonwCX/Onboarding-design-to-prevent-bots---MoonDAO?type=whiteboard\\&node-id=0-1\\&t=AeR15Y7Fgmn6FMkL-0)**Pablo:** \n\nWorked closely with Anna on how we can solve this problem, ultimately we decided to just have a regular onboarding call, and not do the proof of liveness calls.****\n\n4. **Key Result**: Simple and easy to understand explanations for each step of the process\n\n   1. **Results**:  [Mission Control App](https://app.moondao.com/)\n\n   2. **Learnings**: Many of the more complex devices of MoonDAO’s governance have been abstracted away in the new flow, however there are some elements of web3, like bridging between networks, that are still difficult to mask. Integration with traditional web2 structures has seen progress, but it too has yet to become totally seamless.  \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions**\n\n**Anna:** \\\n-  I rewrote the copy for the app: [link](https://www.figma.com/file/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?type=design\\&node-id=1850-3816\\&mode=design\\&t=i1vZXcagjlzmD1ay-0);\\\n-  Made two explainer videos for the app and for the onboarding to sweepstakes: [link 1](https://www.youtube.com/watch?v=V9M-wTRfuZs\\&t=19s), [link 2](https://www.youtube.com/watch?v=VxU8dOrL0fE\\&t=15s);\\\n-  Gave feedback and wrote alternative copy for some parts of the Onboarding video: [link](https://docs.google.com/document/d/1D5m9yPvbGY5RCqfM7XJRX-oezrt7CdBvvLmuONOzDRc/edit);\\\n-  Wrote new copy for the landing page that is simpler and appeals to non-web3 audience:[ link](https://www.figma.com/file/udgMqQV5CKbkhhI9ZrkSed/MoonDAO-website-copy-update?type=design\\&node-id=0-1\\&mode=design\\&t=IRDjRdWGXExwORHg-0)\\\n**Colin:** \n\n\\- Adjusted text for the contribution levels and checkout steps as needed\\\n**Eliot:** \\\n\\- Worked on implementing new designs for easy flow.\\\n\\- Implemented feedback for a better user experience.\\\n**Fiyin:** \\\n\\- I implemented some feedback from the team to achieve a more simple and better User Experience.\\\n\\- Designed the mobile responsiveness so that the app can be accessed easily on mobile considering that a lot of people use mobile more.\\\n**Pablo:** Wrote the [original copy](https://www.figma.com/file/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?type=design\\&node-id=1-3\\&mode=design) (Figma > Components) for most of the steps in the process, but got invaluable feedback from many people and it changed a lot over time, especially Ryan and Anna who went deep on writing new copy which was often approved for incorporation into the app.\\\n**Ryan:** Did a lot of copy changes to the app, including multiple iterations. Wrote things like the copy for [membership tiers](https://docs.google.com/document/d/15orW7iUv2ZXDlREVd7jPTY3HJDx6SYPG6d536zL0jx4/edit?usp=sharing), [eth modal](https://docs.google.com/document/d/1DjaerWwCQGJhzeSI3TwR8S0p6kcoolepsTmjXmsBKgI/edit), [meta descriptions and titles](https://docs.google.com/document/d/17TVJWSEQOsjX9rZuML4160aJL4naMor1QgpTvRq-R0E/edit?usp=sharing), open graph images for sweepstakes page, [governance page in app](https://docs.google.com/document/d/17rEKCZ_rEQz0_mq8Cxl0fVtzdvOzT5DS4fAiuRX-SVA/edit?usp=sharing), [why join moondao on welcome page](https://docs.google.com/document/d/1kaz3S1-v_yNX8N_GgasH0Zlh7G06RJAnPU6HoNxHiYQ/edit?usp=sharing), etc. Tried to focus on reducing jargon and unimportant terminology (join vs onboarding, connect vs connect wallet, a friendly welcome page vs the app with buy/lock/bridge/etc front and center), and provide a more intuitive experience that people are already accustomed to elsewhere, such as a full reordering of the app flow (homepage became governance page, for example) the [three membership tiers](https://discord.com/channels/914720248140279868/1122978203741466705/1163926470247338106) idea, also later improved to dramatically reduce barrier to entry which was initially super expensive tiers of $100, $500, or $1,500 dollars vs $20, $100, and $500 to have more accessible pricing to make them more palatable to people considering joining and participating in a new and unknown organization like MoonDAO.****\n\n2. **Objective: Implement new designs for the MoonDAO app that were created in the MoonDAO App Expansion Project**\n\n   1. **Key Result**: Slick and intuitive redesign of the app with a new design palette that matches the current brand aesthetics of MoonDAO\n\n      1. **Results**:  [Mission Control App](https://app.moondao.com/)\n\n      2. **Learnings**: Questioning requirements and aiming for a minimum-viable approach pays dividends when it comes to interaction design; Oftentimes less is more.\n\n      3. **Maintenance**:\n\n      4. **Team’s Self-Reported Score**:\n\n      5. **Team Contributions**\n\n**Anna:** \\\n\\- Asked friends & family for app feedback;\\\n\\- Pointed out mobile design inconsistencies\\\n**Colin:** \n\n\\- Adjusted the styling of the contribution levels and checkout steps\n\n\\- Made styling adjustments throughout the app to ensure that the design meshes well**Eliot:** \\\n-  Meticulously incorporated new designs for a modern, seamless look.\\\n-  Streamlined navigation for a user-friendly experience.\\\n-  Implemented feedback-guided refinements for improved usability.\\\n-  Selected a palette harmonizing with MoonDAO's brand for visual consistency.\\\n-  Ensured consistent and enjoyable user experience across devices.\\\n-  Emphasized iterative feedback loops for design validation.\\\n-  Worked closely with Colin to ensure all bugs were accessed and fixed.\\\n**Fiyin:** \\\n\\- Redesigned the original App Expansion design by Lucas. Reskinned the color scheme to a fresh color designs\\\n\\- Did a lot of improvements. Started with the components, Hi Fi designs then the final designs.\\\n\\- Designed the pages to look more trendy and modern\\\n\\- Ensured consistent Design systems across all the pages/brands\\\n\\- Worked with the frontend team to ensure all bugs were fixed from a design standpoint.\\\n**Larrotiz:** \n\n\\- Provided feedback on design decisions.\n\n\\- Overhauled the design of the welcome page\n\n\\- Ensured the UI experience was consistent on all screen sizes by finding and fixing inconsistencies.\\\n**Mitchie:** \\\n\\- Provided feedback and guidance during early stages of design implementation\\\n\\- Implemented design suggestions to the landing page\\\n\\\n**Pablo:**\n\n\\- Worked closely with Lucas, Mitchie, and Fiyin on design decisions for the App. We reskinned the whole thing. The original design was created by Lucas for the App, then Fiyin refined it by adding new elements and making the color scheme consistent. \n\n\\- I helped simplify a lot of things throughout the app and removed unnecessary buttons, copy, etc… Even some whole pages like the proposals page (which we may bring back with the new governance flows.\n\n\\- Mitchie came in with a whole new radical and cool design, then we merged his design and the original one after a few conversations about design elements. Iterations of this design can be viewed in the [Figma](https://www.figma.com/file/8m3DomqMxU0yAoaVfIcx4h/MoonDAO?type=design\\&node-id=1-3\\&mode=design) (Components, then Hi Fi designs, lastly Final Designs.\n\n\\- I also assisted in rewriting all the copy for the landing page and worked closely with Mitchie and Ryan on improving that page.\\\n**Ryan:** Bigger picture changes identified such as a complete reordering of the app pages ie Welcome with video and why join, progressing into join with tiers, then governance and/or sweepstakes. [Copy and layout changes to landing page](https://docs.google.com/document/d/11bHvSvSTISNYGv_my_4_U0Zm-bv7-ib7-Uwe0ios99I/edit?usp=sharing) with Pablo’s help and based on Anna’s initial input, ultimately implemented by Mitchie.\n\n\n## Coordinape Results\n\n[**Link to the Coordinape**](https://app.coordinape.com/circles/30111/give)\n\n|                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| Pablo           |                        | None                |\n| Ryan            |                        | None                |\n| Mitchie         |                        | None                |\n| Larrotiz        |                        | None                |\n| Elijah          |                        | None                |\n| Anna            |                        | 9,000 DAI           |\n| Colin           |                        | 7,000 DAI           |\n| Eliot           |                        | 4,000 DAI           |\n| Ariel           |                        | 2,000 DAI           |\n| Fiyin           |                        | 1,000 DAI           |\n\n\n## Treasury Transparency\n\n[Link to Treasury](https://app.safe.global/home?safe=eth:0xB01F19De628B5f5dd3D609776C66272DEE91958c) with unused funds returned to the main DAO Treasury.\n\n|               |                                                                   |                                       |                                                    |                                                                                                                      |                                                                                                                                                                                                                  |\n| ------------- | ----------------------------------------------------------------- | ------------------------------------- | -------------------------------------------------- | -------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- |\n| Txn Title     | Reason                                                            | Amount                                | Recipient                                          | Etherscan Link or Gnosis Link                                                                                        | Deliverable                                                                                                                                                                                                      |\n| Safe creation | Safe creation                                                     | N/A                                   | N/A                                                | [Safe creation](https://etherscan.io/tx/0xd682ee81e9bc377e045b2de544cf19106c6f0662fe127ebad2359fd25db75b27)          | Multlisig created                                                                                                                                                                                                |\n| 0             | Rejection                                                         | N/A                                   | N/A                                                | [Rejection](https://etherscan.io/tx/0x37687670d3e948a1a37b3714dd577029a5071b3013f9bf7921cde3922d0e2578)              | N/A                                                                                                                                                                                                              |\n| 1             | Rejection                                                         | N/A                                   | N/A                                                | [Rejection](https://etherscan.io/tx/0x0b4e3d942996f709698b3194a8279cfcebeb81359ee1acc5135ecbd6d0be35c8)              | N/A                                                                                                                                                                                                              |\n| 2             | Token Swap                                                        | N/A                                   | N/A                                                | [Token Swap](https://etherscan.io/tx/0x45dcfd520e760431d849d616b1d764aed4cca8f3102022912d7d5b21c3f17f7b)             | Stability                                                                                                                                                                                                        |\n| 3             | Streaming payments to team members                                | 6,000 DAI                             | In order of batch transaction: Colin, Ariel, Fiyin | <https://etherscan.io/tx/0x10ff52b92c5dad8eff6178489f5c02aee7a18d18c0e3a1290359d457dab459f2>                         | Due to inter-project budgetary adjustments, other contributors on this project were paid through the [sweepstakes project](https://docs.google.com/document/d/1TW62-jUdaV1Xv_nrQyOIIRe9EeflheiDtcvPPNvhUBw/edit) |\n| 4             | Additional stream for Colin to compensate for budgetary oversight | 3,000 DAI                             | Colin                                              | <https://etherscan.io/tx/0xeb2eab7f99e5a2e482d6f54b26e0db8028396a19a897ac7cfcb5e136f30bdf4e>                         |                                                                                                                                                                                                                  |\n| 5             | Treasury Reimbursement                                            | .01 ETH and 46.124748466745203749 DAI | Main Treasury                                      | [Treasury Reimbursement](https://etherscan.io/tx/0x44ca11cf2a1f73a52326da7c276ae1e7d7f759cd641b78b9a51d27ae639b7aa7) | Remaining funds returned                                                                                                                                                                                         |",
  "contributors": "[{\"Contributor\":\"Mitchie\",\"Payout Address\":\"0x3d1F623BEedc1bdAaeA4E7F968B44e6262eaCcAd\",\"Voting Address\":\"0x3d1F623BEedc1bdAaeA4E7F968B44e6262eaCcAd\",\"Eth\":0.638,\"Mooney\":4296,\"Dai\":0},{\"Contributor\":\"Coordinape\",\"Payout Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Voting Address\":\"0x15B513F658f7390D8720dCE321f50974B28672EF\",\"Eth\":0.010,\"Mooney\":4759,\"Dai\":0},{\"Contributor\":\"Ryan\",\"Payout Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Voting Address\":\"0x78176eaabcb3255e898079dc67428e15149cdc99\",\"Eth\":0.681,\"Mooney\":353497,\"Dai\":0},{\"Contributor\":\"Pablo\",\"Payout Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Voting Address\":\"0x679d87D8640e66778c3419D164998E720D7495f6\",\"Eth\":0.848,\"Mooney\":456899,\"Dai\":0},{\"Contributor\":\"Colin\",\"Payout Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Voting Address\":\"0x80581C6e88Ce00095F85cdf24bB760f16d6eC0D6\",\"Eth\":0.000,\"Mooney\":375066,\"Dai\":0},{\"Contributor\":\"Larrotiz\",\"Payout Address\":\"0x5640Ddc028f2436B5C0BA0305D2199556C1b5a95\",\"Voting Address\":\"0x5640Ddc028f2436B5C0BA0305D2199556C1b5a95\",\"Eth\":3.862,\"Mooney\":352076,\"Dai\":0},{\"Contributor\":\"Elijah\",\"Payout Address\":\"0x66CD14267fb5a1609496CdC37eB55E6FE3f59C75\",\"Voting Address\":\"0x66CD14267fb5a1609496CdC37eB55E6FE3f59C75\",\"Eth\":3.862,\"Mooney\":47594,\"Dai\":0},{\"Contributor\":\"Gavin\",\"Payout Address\":\"0xeEA7d0FFc09997B8b0cC59C9BBC93cdEd33c14e4\",\"Voting Address\":\"0xeEA7d0FFc09997B8b0cC59C9BBC93cdEd33c14e4\",\"Eth\":3.129,\"Mooney\":0,\"Dai\":0},{\"Contributor\":\"Luffy\",\"Payout Address\":\"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\",\"Voting Address\":\"0xe6f4DC7260e77AA6Dc2F36596F3d19493eB20B93\",\"Eth\":0.097,\"Mooney\":48379,\"Dai\":0},{\"Contributor\":\"Phil\",\"Payout Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Voting Address\":\"0x6bFd9e435cF6194c967094959626ddFF4473a836\",\"Eth\":0.048,\"Mooney\":24190,\"Dai\":0},{\"Contributor\":\"Daniel\",\"Payout Address\":\"0x1B7D7d183Bd233af690DDB33cE818f41995118a9\",\"Voting Address\":\"0x1B7D7d183Bd233af690DDB33cE818f41995118a9\",\"Eth\":3.862,\"Mooney\":361717,\"Dai\":0}]"
}
