{
  "body": "# **MoonDAO Ticket To Space Documentary: Final Report**\n\n## [MoonDAO Final Report Reference](https://docs.google.com/document/d/16F-_bcC0C4889YmuQl6WWChDKQObHhmfjasDna0wOmk/edit?usp=sharing)\n\n## Summary\n\n## The Ticket To Space Documentary was going to be a film about the journey of our selected astronaut Yan Kejun from China, to the USA, and to space. However, after he was unable to get a US Visa to come for astronaut training, the filming of the movie was put on hold. There was an extended contract negotiation process, and no contract was signed. After we select our next astronaut we will revisit the idea of doing long-form storytelling about our second astronaut. The filmed content is located here: <https://icedrive.net/dashboard/#/cloud>The content is password protected, Pablo has the password and if anyone needs to access the data they can ask him, at his discretion.**Between November 2022 and August 2023, 600 hours from Fernando and 600 hours from Susie contributed to the Ticket to Space Film development and pre-production work. In addition, remote producing, travel, and shooting from March 23-March 27 2023 for international travel, 2 days of principal photography, and post shoot footage processing.** **Total suggested payment Fernando $7000 Susie $7000.** **In reference to outstanding debts outlined in:** https\\://snapshot.org/#/tomoondao.eth/proposal/0x491675142e26cdd737ab9d50047fee04fa8059ab0338720760a4e562303ee0f2 * **Proposal references $11k us equivalent plus an added** **$4,075.55 to meet debt expenses incurred by filmmakers. At time of transfer, $4,078.66 was received and $9,321 was received. Outstanding unpaid debt left at: $1675.89**\n\n## Results\n\n1. **Objective:** Portray Yan’s unique journey to space in a way that captures the public imagination and exposes new audiences to the inspiring goals of MoonDAO and DAOs in general\n\n   1. **Key Result**: Achieve Key Production Milestones: Yan’s life in Beijing; his journey and training in Texas; the flight; a post-flight follow-up with Yan and MoonDAO.\n\n      1. **Results**: A few interviews were conducted with the MoonDAO team and with Yan virtually, and an in person event at Blue Origin too. However, after Yan was unable to come to the US filming was stopped.\n\n      2. **Learnings**: \n\n      3. **Maintenance**: Store files sent over by Fernando for a potential future film.\n\n      4. **Team’s Self-Reported Score**: 0.3\n\n      5. **Team Contributions****Fernando**: Fernando covered hours of interviews between Yan, Pablo and other MoonDao members, as they met through online platforms to discuss strategies to bring Yan over to the US. All footage has been delivered to MoonDao. He also interviewed Yan on several occasions, in which Yan got to talk about his background, family and his Ticket To Space journey.\\\n**Pablo**:\\\n**Suzy**:2. **Key Result**: Illuminate Yan and the historic event of his flight experience in a powerful way that inspires a broad audience, and leaves viewers with food for thought.\n\n   1. **Results**: None\n\n   2. **Learnings**: N/A\n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions\\\n      Fernando**: Fernando interviewed Yan on two occasions, in which Yan got to talk about his background, family and his Ticket To Space journey.\\\n      **Pablo**:\\\n      **Suzy**:****\n\n3. **Key Result**: Immortalize the story of MoonDAO's early years, creating inspiration for potentially millions of future members to join MoonDAO and serve its mission.\n\n   1. **Results**: There were some interviews conducted with earlier members of MoonDAO.\n\n   2. **Learnings**: \n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: 0.1\n\n   5. **Team Contributions**\\\n      **Fernando**: Fernando traveled to Florida and Cape Canaveral in late March 2023 to film and interview MoonDao members as they participated in the Blue Origin tour and Astronaut Party gathering with fellow astronauts that have flown on the New Shepard. Fernando followed and filmed Pablo and other MoonDao members as they visited NASA facilities and the Blue Origin factory where the new rockets are being built. He also interviewed Blue Origin members, mechanical engineers, and staff. All footage has been delivered to MoonDao, in 4K 4.2.2 10-bit S-Log3 for maximum quality.\\\n      **Pablo**:\\\n      **Suzy**: Suzy produced the Florida and Cape Canaveral trip, making sure the film crew had all its gear, accommodation and schedules in order to ensure a correct shooting of the event.\n\n4. **Key Result**: Generate promotional buzz and marketing with StudioDAO team throughout the production process and at festivals.\n\n   1. **Results**: None\n\n   2. **Learnings**: N/A\n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions\\\n      Fernando**: Fernando participated in several online conversations and podcasts where he talked about the film, about MoonDao’s journey and Mission. He participated in the JuiceCast along with Suzy, Pablo and other StudioDao staff.\\\n      **Pablo**:\\\n      **Suzy**: Suzy participated in several podcasts where he talked about the film, about MoonDao’s journey and Mission. He participated in the JuiceCast along with Fernando, Pablo and other StudioDao staff.\n\n5. **Key Result**: Release the film with a distribution strategy that maximizes audience impact.\n\n   1. **Results**: None\n\n   2. **Learnings**: N/A\n\n   3. **Maintenance**:\n\n   4. **Team’s Self-Reported Score**: \n\n   5. **Team Contributions\\\n      Fernando**:\\\n      **Pablo**:\\\n      **Suzy**:****\n-------------------\n\n## Coordinape Results\n\n## [Link to the Coordinape](https://app.coordinape.com/circles/17732)|                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| **Fernando**    | 33.33                  |                     |\n| **Pablo**       | 33.33                  |                     |\n| **Suzy**        | 33.33                  |                     |\n",
  "contributors": "[{\"Contributor\": \"Pablo\", \"Payout Address\": \"0x679d87D8640e66778c3419D164998E720D7495f6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"93,026\", \"Dai\": \"5,084.61\"}, {\"Contributor\": \"Susie\", \"Payout Address\": \"0x2Ca5F90962c415DA3E3E1761f7Ca159d2E081c46\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"93,026\", \"Dai\": \"319.47\"}, {\"Contributor\": \"Fernando\", \"Payout Address\": \"0x01A5109eC48a25C7c26C517b595FD7a5c2cE44eb\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"93,026\", \"Dai\": \"319.47\"}]"
}
