{
  "body": "# **Project Final Report Template****Summary**\n\n# This was a renewal of the newsletter project, focusing on weekly updates and a few other initiatives, namely monetization and organic growth through referrals. Some elements were a success, like the weekly updates and changes to automated sequences and things within the direct confines of ConvertKit or SparkLoop. Other things were more challenging or not possible to deliver. There were roadblocks in implementing prize referral within Discord, and the US entity to accept fiat payments still does not exist. Despite those setbacks, there were other elements added into the project that went beyond the scope of the original proposal in terms of deliverables or impact whether through additional emails for separate initiatives like DeSci or ZeroG, a giveaway prize not originally planned, etc. [Original Proposal](https://docs.google.com/document/d/1N95G5-dKzWaE7oQw2j-IoNVuu6xJrZoC-isFETiwRyM/edit?usp=sharing) \n\n# **Results**\n\n# 1. **Objective:** Update Autoresponder Sequences + Add New Ones + Maintenance\n\n   1. **Key Result**: Update any factual changes within the two large existing autoresponder sequences with regard to governance or internal changes.\n\n      1. **Member(s)**: ryand2d\n\n      2. **Results**: Light changes were needed for some of the automated emails, particularly the Active Web3 sequence with regards to onboarding such as adding the roles and info about Guild.xyz, MoonDAO guild changes, and deemphasizing DeWork. Added more to the General Sequence that goes to all subs. Some things that were planned to be added, like 101.xyz, were unable to be included due to the dissolution of that site.\n\n      3. **Learnings:** Keep things general and not super specific.\n\n      4. **Maintenance**: There have been more changes that need to be updated, such as the new Onboarding flow with Spect, Yan losing his Blue Origin seat, etc.\n\n      5. **Team’s Self-Reported Score: 0.8**\n\n   2. **Key Result**: Create a new cold subscriber sequence and tag which will attempt to warm up any inactive members before they are tagged for deletion, in an attempt to keep the list clean and ensure we aren’t paying for inactive users.\n\n      1. **Member(s)**: ryand2d\n\n      2. **Results**: Created a new Warm-up sequence of 18 days with four emails, which has been used to help differentiate the actives from inactives. 3,900 have gone through that process, and a few thousand have been culled and permanently removed – although I can’t find an exact figure from the multiple COLD deletes (those who failed to be warmed back up). Doing so improves deliverability and ensures we don’t enter a higher paid tier unnecessarily.  There are currently 1,019 people that went from Cold to Warm (that would have otherwise been deleted).\n\n      3. **Learnings:** None.\n\n      4. **Maintenance**: Could add more emails to the sequence. Will need to continue tagging cold subs to go through the sequence occasionally and also deleting the truly inactive members.\n\n      5. **Team’s Self-Reported Score: 0.9******![](https://lh7-rt.googleusercontent.com/docsz/AD_4nXfwlKNjdPS9AXrgGbcE_IoD6FH1b7hYpCSn4n78rZAnEV5hld-AobhrtmIOgFHJkAIXwV4ZacFSdvIcsS3_i_S3le6KH1t5kdN0BLxVhZjSgNEb0buH4lzEwbx43_uOWKHYFEHa8kBHESMeusxUtoZL9jXI?key=FPV7FQN0JfwMilFMaFhmtA)****3) **Key Result**: Add some additional emails to the general sequence promoting the refer-a-friend system and encouraging users to share the email list with friends or on social media.\n\n   1. **Member(s)**: ryand2d\n\n   2. **Results**: Added refer-a-friend info to the footer of every single email and also added promotion of this feature within the General sequence so all should be aware. I also added a basic sequence when someone successfully makes their first referral and encourages them to continue doing so.\n\n   3. **Learnings:** Ensure that all needed elements are in place before starting with this. There were a number of roadblocks that prevented us from capitalizing on this feature, namely failure to deliver the prize for Step 1, which is a special Discord role.\n\n   4. **Maintenance**: The basic infrastructure is all in place, but we do not have an effective way to deliver the prize to those making referrals even for the initial free prize of a Discord role, the approval of which blocks any follow up prizes – and we don’t have the t-shirt store live yet either.\n\n   5. **Team’s Self-Reported Score: 0.5**2) **Objective:** Weekly Mooney Monday Emails\n\n   1. **Key Result**: Start up the weekly Mooney Monday emails again with space news, and MoonDAO updates, such as those seen on the [public MoonDAO emails page](https://moondao.ck.page/posts)\n\n      1. **Member(s)**: ryand2d\n\n      2. **Results**: All weekly emails were delivered, including a few supplemental or bonus emails for special occasions like DeSci or ZeroG. Each email included weekly space news, updates on MoonDAO projects and Governance, etc. All can be seen from the link above.\n\n      3. **Learnings:** None.\n\n      4. **Maintenance**: Project continuation for weekly emails. \n\n      5. **Team’s Self-Reported Score: 1.0**3. **Objective:** Create a PDF Sponsorship document\n\n   1. **Key Result**: Compiling info and statistics with info about the MoonDAO email list in a small 1-2 page PDF document with rates that we can share with Web3 or Space Organizations.\n\n      1. **Member(s)**: ryand2d\n\n      2. **Results**: Gathered rates and examples from other space newsletters, put together the initial draft document via Canva/PDF with statistics but never went live, as it was also waiting for a US entity via MIDAO and ability to accept payments.\n\n      3. **Learnings:** Don’t count on deliverables from other projects within the goals of an unrelated project.\n\n      4. **Maintenance**: None, waiting on internal MoonDAO developments.\n\n      5. **Team’s Self-Reported Score: 0.2**\n\n   2. **Key Result**: Create snippet codes within ConvertKit that will allow us to easily embed any text or image advertisements within the existing body of emails and allow us to swap them out or change them in the future without having to edit individual emails. \n\n      1. **Member(s)**: ryand2d\n\n      2. **Results**: Done, created two different promotional snippet codes that have been incorporated into all primary sequences, one in the middle and one near the end of each email. The snippet codes have been used thus far to promote the ZeroG event with two different 1:1 square images but can be changed out easily to promote any major initiatives.\n\n      3. **Learnings:** None.\n\n      4. **Maintenance**: Changing out the images and/or text for different initiatives or falling back toward a more generic Call to Action CTA.\n\n      5. **Team’s Self-Reported Score: 1.0**\n\n# **Team Member Contributions**\n\n### **@ryand2d**\n\n# 1. **Objective:** Update Autoresponder Sequences + Add New Ones + Maintenance\n\n   1. **Key Result**: Update any factual changes within the two large existing autoresponder sequences with regard to governance or internal changes.: \n\n      1. **Impact:__** Ensures content is up to date and accurate.\n\n      2. **Complexity:** Not too complex, just requires redoing some elements.****\n\n   2. **Key Result**: Create a new cold subscriber sequence and tag which will attempt to warm up any inactive members before they are tagged for deletion, in an attempt to keep the list clean and ensure we aren’t paying for inactive users.\n\n      1. **Impact:** Ensures we are not paying for people that are not opening emails and improves overall deliverability and engagement metrics. List was trimmed down by a few thousand, which is why overall growth statistics are somewhat flat from \\~11,500 to 12,900 now, despite deleting at least 2,000 or more. \n\n      2. **Complexity:** Slightly complex to implement the tagging, sequences, and automation flow.****\n\n   3. **Key Result**: Add some additional emails to the general sequence promoting the refer-a-friend system and encouraging users to share the email list with friends or on social media.\n\n      1. **Impact:** We had 61 different users who referred at least one person successfully to our email list turning them into advocates or missionaries for MoonDAO,  for a total of \\~194 referrals since activating out of 1,329 referral traffic, for a 14.5% conversion rate.\n\n      2. **Complexity:** The actual SparkLoop set up and integration was somewhat complex, the creation of emails not so much, and the integration into our existing template was slightly complex.\n\n2. **Objective:** Weekly Mooney Monday Emails\n\n   1. **Key Result**: Start up the weekly Mooney Monday emails again with space news, and MoonDAO updates, such as those seen on the [public MoonDAO emails page](https://moondao.ck.page/posts)\n\n      1. **Impact:__** Weekly emails for three months to update members about the latest MoonDAO news and activities, also crossposted in threads to Twitter.\n\n      2. **Complexity:** This was the most complex task of all, requiring me to be up-to-date with all the various things going on at MoonDAO, from projects to initiatives, to bounties, to governance decisions, votes, town halls, etc, etc.****\n\n3. **Objective**: Create a PDF Sponsorship document\n\n   1. **Key Result**: Compiling info and statistics with info about the MoonDAO email list in a small 1-2 page PDF document with rates that we can share with Web3 or Space Organizations.\n\n      1. **Impact:__** None, not live.\n\n      2. **Complexity:** Slightly complex to gather rates from space newsletters, decide on types of advertising to allow, gather statistics.****\n\n   2. **Key Result**: Create snippet codes within ConvertKit that will allow us to easily embed any text or image advertisements within the existing body of emails and allow us to swap them out or change them in the future without having to edit individual emails. \n\n      1. **Impact:** Generating clicks and eyeballs for some of our initiatives like ZeroG and Lifeship. It is difficult to discern ZeroG since there was a lot of other crosspromotion (with 628 unique people clicking) whereas Lifeship was just a brief footer mention for 175 unique people clicking at least once.\n\n      2. **Complexity:** Slight complexity to implement the snippet codes and designs into our template and/or emails.\n\n# **Coordinape Results**\n\n# No Coordinape, done via call because of small team.|                 |                        |                           |\n| --------------- | ---------------------- | ------------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment**       |\n| @ryand2d        | 90                     | 9,000 DAI, 600,000 MOONEY |\n| @pmoncada       | 10                     | 1,000 DAI                 |\n\n# **Treasury Transparency**\n\n[Link to Treasury](https://app.safe.global/transactions/history?safe=eth:0x2a8DC4e7892045b6729ae27C1a8e56eb3928eEBc) with unused funds returned to the main DAO Treasury.\\\n|               |                                                               |                |               |                                                                                 |                                                              |\n| ------------- | ------------------------------------------------------------- | -------------- | ------------- | ------------------------------------------------------------------------------- | ------------------------------------------------------------ |\n| **Txn Title** | **Reason**                                                    | **Amount**     | **Recipient** | **Etherscan Link or Gnosis Link**                                               | **Deliverable**                                              |\n| Nonce 6       | Mooney via LlamaPay to ryand2d                                | 600,000 Mooney | ryand2d       | [link](https://etherscan.io/address/0x40A2aCCbd92BCA938b02010E17A5b8929b49130D) | MVP                                                          |\n| Nonce 7       | Rejected/ Mistake                                             |                |               |                                                                                 |                                                              |\n| Nonce 8       | DAI via LlamaPay to pmoncada                                  | 1,000 DAI      | pmoncada      | [link](https://etherscan.io/address/0xB93427b83573C8F27a08A909045c3e809610411a) | MVP                                                          |\n| Nonce 9       | DAI via LlamaPay to ryand2d                                   | 9,000 DAI      | ryand2d       | [link](https://etherscan.io/address/0x40A2aCCbd92BCA938b02010E17A5b8929b49130D) | MVP                                                          |\n| Nonce 10      | Bounty reward for winning the February refer-a-friend contest | 10,000 Mooney  | luffy54       | [link](https://etherscan.io/address/0x40A2aCCbd92BCA938b02010E17A5b8929b49130D) | Referring friends through SparkLoop and winning the drawing."
}
