{
  "body": "# **MIDAO Final Report****Summary**\n\nThis was a 9 month long process of getting MoonDAO registered as a legal entity in the Marshall Islands. There was a lot of hidden complexity here. The first major blocker was the large coordination of the DAO to create a custom operating agreement where the DAO holds all governance decision power and the MIDAO is a legal wrapper. We had a lot of custom language on the operating agreement and tailored it to fit our needs. The next big step was to update our Constitution to be aligned with the MIDAO operating agreement and getting a lawyer to review all of our DAO processes and make sure that we are following the laws of the Marshall Islands, this included a review of our Constitution, Projects System, and Operating Agreement.This process took longer than normal because of many reviews between legal and coordinating between the larger DAO to vote to [accept the operating agreement and updates to the Constitution.](https://snapshot.org/#/tomoondao.eth/proposal/0x68c585ecb3021c50a83258d321f085c5862269c9c84cd4575afcb3f1548a31e3)There were also changing requirements from MIDAO halfway through the process so we had to [update the operating agreement ](https://snapshot.org/#/tomoondao.eth/proposal/0x834285d81a62d255435fc5ba392be1601d11709a98ed6dfb6c45ed937f7565d7)a second time with new managing members and define them as the Astronauts rather than the Multisig holders.The operating agreement and all legal paperwork (certificates, identity, FIBL) was submitted to the Marshall Islands government in May, nearly two months later we have not yet heard back officially. However the work is completed, we just need to get the final stamp of approval from the government.I’ve gotten word from MIDAO that we should hear back by July 15th at the latest, if the application is rejected then we’ll just pull this project from the incentives this quarter -- this project report assumes a positive result on the application.**Original Proposal:** [MDP-39: MoonDAO Marshall Islands DAO Entity Creation\\\n****](https://snapshot.org/#/tomoondao.eth/proposal/0x0e2005d472f9fdd24dbf982be4d6f7fdb20b102ae9316141cd89596e18558aae)**Results**1) **Objective #1: Have our application to become a legal entity be approved.**\n\n   1. _Submit the application through MIDAO.org and provide the requisite paperwork._\n\n      1. **Member(s)**: Pablo\n\n      2. **Results**: Final operating agreement submitted:[(v2) The Moon DAO LLC Customized ERC-20 Operating Agreement Template](https://docs.google.com/document/d/1MViMoZ9iUEyIe43TXSLkV-iFfEbAvJrHeW6b7YDpD3Y/edit)Vote to adopt Operating agreement and update to Constitution: <https://snapshot.org/#/tomoondao.eth/proposal/0x68c585ecb3021c50a83258d321f085c5862269c9c84cd4575afcb3f1548a31e3>Vote to update Operating Agreement and Constitution after changes to MIDAO requirements: <https://snapshot.org/#/tomoondao.eth/proposal/0x834285d81a62d255435fc5ba392be1601d11709a98ed6dfb6c45ed937f7565d7> 3. **Learnings:** Coordinating Constitution changes and lawyers is a very slow process. Legal moves slow, and then also to get everyone on the same page about the Constitution takes time. There were also unforeseen slowdowns with changing requirements from MIDAO.\n\n4. **Maintenance**: We will need to pay our taxes and submit relevant forms to MI over time. We may need a project to make sure this happens. Once there’s final approval we will also change the ownership of the Macau entities to be in the hands of the MIDAO.\n\n5. **Team’s Self-reported Score: 0.7** (Was slower than expected but we powered through the process. This assumes that we actually get approval, like I said if we don’t get approval we’ll just pull this project from the incentives.)2. _Have three members submit the requisite applications to go through the KYC process._ \n\n   1. **Member(s)**: Pablo\n\n   2. **Results**: It actually only needed to be me in the end who needed to KYC. I’d add proof that I did it but the KYC form has some sensitive information like my home address so I won’t share this document publicly.\n\n   3. **Learnings:** None.\n\n   4. **Maintenance**: None.\n\n   5. **Team’s Self-reported Score: 1.0** (Binary result -- the KYC was submitted successfully and passed).\n\n3. _Follow up with MIDAO on finalizing the application._ 1) **Member(s)**: Pablo\n\n2) **Results**: Communicated with Adam and MIDAO on multiple occasions with the application. It’s submitted just waiting for that final stamp of approval.\n\n3) **Learnings:** None.\n\n4) **Maintenance**: Follow up will continue if we fail.\n\n5) **Team’s Self-reported Score: 1.0** (Assuming it is successfully accepted.)\n------------------------------------------------------------------------------\n\n# **Team Member Contributions**\n\n### **Pablo and Favian**\n\n## 1. **This effort was initially coordinated with Favian and me, however he stepped down halfway through the project and I picked up the torch and saw it through. I’m getting confirmation from him about how he wants to split up the project rewards. He’s not available to fill in his contributions, but Favian did a lot of research on the MIDAO system and coordinated the first few meetings with their team. I did some heavy lifting coordinating the DAO to review the drafted operating agreement and having that alongside our Constitution and Projects system be reviewed by a lawyer.**\n\n# **Coordinape Results**\n\n## Link: N/A Distributed between team|                 |                        |                     |\n| --------------- | ---------------------- | ------------------- |\n| **Member Name** | **% of total rewards** | **Upfront Payment** |\n| @pmoncada       | 80                     | 0 MVP               |\n| @favian         | 20                     | 0 MVP               |\n\n# **Treasury Transparency**\n\n## No treasury. Just a one time transaction to pay for the legal incorporation of MIDAO.<https://gnosis-safe.io/app/eth:0xce4a1E86a5c47CD677338f53DA22A91d85cab2c9/transactions/multisig_0xce4a1E86a5c47CD677338f53DA22A91d85cab2c9_0xaf76033b3d5a030cb126be88aa20bdb9fdbf2e9b0861d00b50a9b84a03da9d57>The budget also allocated $5,000 to be paid each January, however since we didn’t finish incorporation by then we didn’t require this, we will need to allocate $5,000/year towards maintaining this incorporation status.**Project Wrap Up Checklist*** [ ] Added Project Final Report onto the Website Dashboard",
  "contributors": "[{\"Contributor\": \"pmoncada\", \"Payout Address\": \"0x679d87D8640e66778c3419D164998E720D7495f6\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"1,036,978\", \"Dai\": \"4,253.87\"}, {\"Contributor\": \"Favian\", \"Payout Address\": \"0xafa46468De1D6f1ab77DEFAe5F7657467911182d\", \"Voting Address\": \"\", \"Eth\": \"0\", \"Mooney\": \"259,244\", \"Dai\": \"2,000.00\"}]"
}
